[
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/",
        "titleJP": "",
        "titleEN": "",
        "publication": "",
        "abstract": "",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/kawahara.png",
        "titleJP": "投影輝度向上および利用者との衝突回避を目指したプロジェクタドローンの動的配置",
        "titleEN": "研究者: 河原　拓海",
        "publication": "論文種別・提出年: 卒業論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "近年，プロジェクションマッピング（Projection Mapping: PM）が注目を集め，プロジェクタを利用した複合現実感技術に関する研究が進められている．一般的に，エンタータイメント用に行われているPMは主に建築物のような静止した物体に投影される．しかし，人や車などのように移動する物体への拡張を考える場合，投影対象が自由に動いている場合でも投影像が対象に位置合わせできることが重要となる．動的なPMにおいては，プロジェクタを環境に固定して投影する方法と，プロジェクタを移動させて投影する方法がある．環境に設置する場合の利点は，目的の位置にずれなく安定して投影できることであるが，投影対象の移動可能な範囲が制限されてしまい，移動可能な範囲を広げるため複数のプロジェクタを用いる必要がある．一方，プロジェクタを移動させて用いる方法は，利用者がプロジェクタを持ち運び，手のひらや本などの身の回りのものに投影し，情報提示をする研究がなされている．この場合，プロジェクタの設置場所に制約を受けることなく，利用者の周りであれば投影が可能である．しかし，投影範囲が利用者の周りに限られてしまうことや，プロジェクタが利用者の活動を妨げてしまうという問題がある．        上述の問題点を解決するため，空間を自由に動くことのできるドローンにプロジェクタを搭載することが提案されている．これにより従来，投影品質を保つことが困難であった高所への投影も可能となり，プロジェクタの投影範囲が広がることが期待できる．しかし，飛行時に投影像が振動すること，積載可能なプロジェクタの制限による投影輝度の低下で投影像が鮮明でなくなること，利用者のドローンとの接触による危険性などの問題が起きる．本研究では，プロジェクタをドローンに搭載した場合における投影輝度の問題について解決するため，利用者との衝突を考慮し，輝度を向上させる位置へドローンを配置する.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/sato.png",
        "titleJP": "複数台のパンプロジェクタを用いたハンドヘルド型投影システム",
        "titleEN": "研究者: 佐藤　貴俊",
        "publication": "論文種別・提出年: 卒業論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "近年, プロジェクタを用いた複合現実感に関する研究は盛んに行われている. プロジェクタを用いて, 仮想空間の情報を実世界に重畳することにより, 仮想世界と実世界を融合させることで. 実物体の存在感を失うことなく, 質感や色彩などの見えを変化させることができる. また, 近年, プロジェクタの小型化が進んでおり, 安価で軽量かつ高性能なプロジェクタが生産されており, スマートフォンなどのモバイル機器への搭載も実現している. スマートフォンなどの携帯端末は, プロジェクタが搭載されることで, どこにいても大きな画面を提示することができ, 大画面で動画を鑑賞したり, 複数人で同じ画面を共有することができるなど様々な場面で有用である. そのため, 今後, 手で持ち運び可能な投影システム(以降, ハンドヘルド型投影システム) が普及していくことが見込まれる.         プロジェクタの小型化に伴って, ハンドヘルド型投影システムに関する研究は盛んに行われてきた. 従来の研究では, 主に幾何補正技術に焦点が当てられていたが, 本研究では別の問題として, 投影範囲と投影輝度のトレードオフに着目する. 投影範囲と投影輝度のトレードオフとは, 投影対象とプロジェクタの距離が近づくと, 投影輝度は上がるが, 投影範囲は狭くなってしまうという現象である. 光量が少なく投影範囲が狭い小型プロジェクタを用いたハンドヘルド型投影システムにおいては, このトレードオフを適切に調整することが極めて重要となる.        そこで, 本研究では, 複数台のプロジェクタの投影方向をミラーを用いて変化させ, ユーザが適応的に投影範囲と投影輝度を変更可能なハンドヘルド型投影システムを提案する. 提案システムによって, 小型の投影システムであっても, 広範囲に投影可能であり, 高画質の映像を提示することができると考えられる. ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/tanabe.png",
        "titleJP": "仮想手操作における非操作手への触覚呈示に関する研究",
        "titleEN": "研究者: 田辺　育暉",
        "publication": "論文種別・提出年: 卒業論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "私たちは自分の手を介して様々な対象に干渉して生活をしている．対象が自分の手の届く範囲内にある場合は，不便なくその対象に働きかけることができる．しかし，対象が自分の手が届く範囲外にある場合はその対象に手が届く位置まで自身が移動する必要がある．こうした制約を解消するインタフェースとして，投影バーチャルハンドを介して遠隔対象に対しても自分の手で対象を直接扱うかのように働きかけることのできるExtendedHand がある．本研究ではこのExtendedHand を使用する．中でも，投影バーチャルハンドの操作に普及の進んだスマートフォンを用いたシステムを利用する．        しかし，現行のExtendedHand では投影バーチャルハンドの視覚情報しか得られず，自分の手で得られる感覚である触覚を得ることができない．そのため，実物体に干渉する場合において，ExtendedHand で得られる感覚と自分の手で得られる感覚には差が生じている．そこで，インタフェースにおける触覚フィードバックの重要性から，ExtendedHand に触覚フィードバックシステムを組み込む．バーチャルハンドを操作する手（操作手）に触覚フィードバックを返す研究が行われている．しかし，操作手に触覚フィードバックを返すシステムには，操作部とフィードバック部を統合することによって機構が複雑になる点やフィードバックデバイスを装着する手間がある点といった問題がある．        そこで，本研究では非操作手に触覚フィードバックを返すことで上記の問題を解決するとともに，ExtendedHand において投影バーチャルハンドを操作していても自分の手で実環境に触れているかのようにすることを目指す．自分の手で実物体に干渉する際は操作する手にフィードバックが返ってくるため，非操作手に触覚フィードバックを返した際にユーザが実物体に触れた感覚が得られるのかどうかは明らかになっていない．そのため，ユーザがExtendedHand を使用して実物体に干渉した際に，実物体に干渉した感覚が得られるかを調査する必要がある．本研究の目的は，ユーザがExtendedHand を使用して実物体に干渉した際に非操作手に触覚フィードバックを付与し，ユーザが実物体に干渉した感覚が得られるかを調査することである．        ExtendedHand を使用して投影バーチャルハンドが実物体に触れた際に非操作手に触覚フィードバックを付与し，ユーザが実物体に触れた感覚が得られるかを調査する実験を行った．実験の結果，用意した触覚フィードバックにおいては，触覚フィードバックを付与しない時に対し，付与する場合はユーザは実物体に触れた感覚が増す傾向にあることが分かった．また，ExtendedHand において投影バーチャルハンドが実物体に触れた際に非操作手に触覚フィードバックを付与する場合に，非操作手の遮蔽や非操作手と左右が同じバーチャルハンド（非操作手バーチャルハンド）の追従が実物体に触れた感覚が増す要因となるかを調査する実験を行った．実験の結果，ユーザに実物体に触れた感覚を呈示できる可能性があるのは遮蔽があるときであると考えられる．一方，非操作手バーチャルハンドの追従により実物体に触れた感覚を向上させるには被験者に非操作手バーチャルハンドを追従させるか選択させることがよいと考えられる．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/tone.png",
        "titleJP": "投影対象内の導光路を同時３Ｄ印刷するアクティブマーカによる動的プロジェクションマッピング",
        "titleEN": "研究者: 刀根　大樹",
        "publication": "論文種別・提出年: 卒業論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "近年, 現実世界に仮想世界を融合させる複合現実(Mixed Reality: MR) が注目されており,プロジェクタを用いるMR としてプロジェクションマッピング(Projection Mapping) がある. プロジェクションマッピングとは, 現実世界の物体に仮想映像を重畳投影することで, 物体表面の質感や色などの見た目を変化させる技術である. プロジェクションマッピングでは投影面が非平面であるため, 投影像を投影対象に合わせる幾何補正が必要となる. 動く物体を投影対象とする動的プロジェクションマッピングでは, 投影対象が動くたびにカメラ画像や加速度センサの情報から位置姿勢を推定しなければならない.         位置姿勢推定の方法の一つとして, 投影対象にマーカを設置する手法がある. カメラで認識されたマーカを, 予め保存されたマーカの三次元座標データベースと対応づけすることで位置姿勢を推定する. この手法では, マーカの対応を取得するためにマーカから特徴量を抽出する必要があるが, マーカに特徴量を持たせるためにはマーカを大きしなければならない.そのため設置できるマーカの最大数に制約が課され位置姿勢推定精度に影響が出てしまう.         そこで, 本研究では時間変化によりID を情報を表現するアクティブマーカを用いる手法を提案する. データの表現が時間による変化であるため, マーカの大きさを小さくしつつ特徴量を埋め込むことができる. 提案手法では, マルチマテリアル3D プリンタを用いてマーカと投影対象を同時に印刷することで, マーカ設置の手間を省き, さらにマーカ設置位置のずれによる位置姿勢推定の誤差を解消している.         第1 章では, 複合現実感やプロジェクションマッピングについての説明と, 動的プロジェクションマッピングの関連研究, そして3D プリンタによる導光路印刷について述べ, 本研究の目的を明らかにする. 第2 章では, 3D プリンタでアクティブマーカを同時印刷する手法と, アクティブマーカを認識し位置姿勢推定する提案手法を述べる. 第3 章では, アクティブマーカを認識するために必要な投影対象モデルの設計方法を, マーカ認識実験を通して検討する. 第4 章では, 第3 章で作成したモデルに対して位置姿勢推定し, 正しい投影像が取得できるか実験して, 結果を考察する. 最後に第5 章で本論文の結論を述べる.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/mine.png",
        "titleJP": "非平面プロジェクションにおける画素密度均一化のための光路透明層の形状最適化",
        "titleEN": "研究者: 峯　隆太郎",
        "publication": "論文種別・提出年: 卒業論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "近年，現実世界の情報と，仮想世界の情報を融合させる複合現実感が非常に注目されている．複合現実感を実現する技術のうち，プロジェクタを用いた投影型の複合現実感では，ユーザが特別なデバイスを装着することがなく投影像を変化させることで現実世界の物の色や質感などを変化させることができる．しかし，プロジェクタは光軸に対して垂直に設置された平面の投影対象を想定して設計されているため，一般的に三次元物体に対する投影では01投影画素密度が空間的に偏り，均一な解像度の投影結果とならない．そこで本研究では，リアプロジェクション方式を採用し，投影面下に3D プリンタで印刷した透明層を埋め込み，投影像を空間非一様に屈折させて投影面の画素密度を均一にすることを提案する．        提案手法を実現するために，投影を行いたい領域に密度均一な画素配置を行い，プロジェクタの各画素との対応関係を求めた後，その対応を実現できる屈折面の構成を行う．画素密度が均一な投影を行うためには，投影面上に配置されている密度が不均一な画素を画素密度が均一になるよう再配置する必要がある．各画素に対し，理想の距離に近づくよう距離に応じた引力と斥力を設定し，各画素を力の働く方向へ移動させる．画素に働く力が平衡状態になるまで移動させることで任意形状における均一な画素配置を求める．また，プロジェクタの画素全体において，なるべく少ない光路の変形で目標の均一画素配置が実現できるように最小コスト輸送問題を解く．画素密度均一に配置された各目標画素と投影光の各画素の対応を求めるために，補正を行わない投影光路と目標画素座標との距離を変形を行うコストとして用いる．加えて，制約条件として屈折可能な角度の制約と輝度低下の制約を設けることで，屈折面によって実現することが可能な範囲内における対応関係の中で最適解を求めた．また，投影光全体が想定した屈折を実現できるように，屈折面形状の最適化を行う．分割した屈折面によって各画素の光路の変形を行い，画素密度均一に配置された目標画素と，投影光の画素との対応関係を実現する．この分割した屈折面を結合することで，透明層の屈折面を生成する．各分割面の結合の際に，段差が大きい結合をしてしまうと屈折面表面において投影光の損失が発生してしまため，分割面全体が段差を抑えて結合できるように最適化を行う．加えて，隣接する面の間をベジェ曲面によって補間することで，異なる法線を持つ面同士をなめらかに結合する．        提案手法に基づき，画素密度均一化を実現することができる透明層の設計を行い画素密度均一化の評価を行う．また，投影物体を実際に作成し投影を行うことで，提案手法の有効性を確かめた．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/takezawa.png",
        "titleJP": "工業製品意匠設計における投影型拡張現実技術を用いた表面質感変調および視覚形状変形に関する研究",
        "titleEN": "研究者: 竹澤　拓郎",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2017.",
        "abstract": "工業製品意匠設計において，現行プロセスでは，二次元スケッチ，三次元CAD を用いた設計，モックアップ制作の工程を最終決定がなされるまで何度も行われており，時間とコストがかかることが問題となっている．また，工業製品の表面質感は製品がユーザに与える印象において重要な役割を果たす．現行プロセスでは素材サンプルを一つずつ比較検討する必要があるが，意匠設計過程でモックアップ全体で異なる表面質感を検証することは難しく，また素材サンプルがない表面質感を検証することができない．そこで仮想現実技術や複合現実技術を用いた工業製品意匠設計支援に関する研究開発が行われている．これらの研究では時間とコストを現行プロセスよりも削減し，様々な色，形状のデザインを検討することがきる．しかし，HMDを用いたシステムではデバイスの装着による不快感が懸念され，ディスプレイ上に表示するシステムではディスプレイの解像度の制約があるため，表面質感の表現に限界がある．そこで本研究では投影型拡張現実技術を用いて，視覚形状変形（明暗，コントラスト，陰影などの光学的な情報や隠蔽関係，遠近法などの幾何学的な情報から心理的記憶的に奥行を知覚するための情報をモックアップに重畳表示することで，見かけ上の形状変形する）を行う．また，投影によってモックアップの表面質感を変調させる．        本論文ではそれを実現するシステムを提案し，そのシステムを使用した動作確認実験として，視覚形状変形がどの程度実際に変形しているように感じるか（知覚形状変形度合）と視覚形状変形のための視覚刺激によって投影対象の表面質感変調が見られるかを調査する．また，製品の実際の使用環境を想定して環境光として木漏れ日を投影によって再現し，それが表面質感変調を引き起こすかを調査する．まず，視覚形状変形としてキャラクタラインを想定した視覚形状変形を行い，次に空間的連続変形と不連続変形の2 種類の視覚刺激とそれぞれに対する環境光の有無による知覚形状変形度合と表面質感変調を評価した．実験の結果として検証した深度-15mm から15mm のキャラクタラインでは意匠設計支援の有用性が示唆された．視覚形状変形では連続変形より不連続変形の方が知覚形状変形度合が大きく，粗さの項目で知覚形状変形度合が確認されない場合でも仮想空間内の変形後物体がもつ表面質感が知覚される傾向が見られた．さらに，環境光による表面質感変調も見られた．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/aoki.png",
        "titleJP": "視温覚融合投影インタフェースにおける視覚刺激に対する温覚刺激の設計",
        "titleEN": "研究者: 青木 芽衣",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "複合現実感インタフェースにおいて，複数の感覚に対して情報を呈示するマルチモーダルシステムが注目されている．マルチモーダルシステムでは，単一の感覚器官に対して情報を 呈示するよりもユーザに多くの情報を呈示することができるため，インタフェースの操作性の向上や，仮想物体のリアリティ向上につながる．最近では，視覚と触覚に情報を呈示するシステムの研究が盛んに行なわれている．従来の視触覚呈示方法には，ユーザが触覚呈示デバイスに触れたり，装着したりすることで触覚刺激を得る方法が多い．一方で，デバイスを把持したり装着したりすることなく，空気圧や超音波，熱放射を利用して触覚刺激を非接触で呈示する手法も提案されている．著者は，触覚の中でも特に温覚に着目し，ユーザの身体へ非接触で任意の場所に視覚情報と温覚情報を同時に呈示可能な，視温覚融合投影インタフェースを構築した．        視温覚融合投影インタフェースは，熱を持つ仮想物体を，3 次元空間で視覚的・温覚的にユーザに知覚させるために使用することを想定している．可視光プロジェクタから仮想物体の映像をユーザの身体へ投影し，同時に赤外光プロジェクタから投影像の位置に合わせて熱を照射する．しかし，赤外光プロジェクタの空間分解能の低さや，人間の温覚の応答速度の低さから，呈示された視温覚刺激が空間的に整合しない場合がある．すると，ユーザは知覚した投影像と熱を関連付けることができなくなり，熱を持つ仮想物体を知覚することが困難になる．        そこで本研究では，視温覚融合投影インタフェースにおいて，視覚刺激と温覚刺激の間に生じる空間的不整合を考慮した上で，ユーザに熱を持つ仮想物体を表現することを目的とする．実験では，様々な形状や動きをする視覚刺激と，強度の異なる温覚刺激を組み合わせて被験者の身体へ呈示し，それぞれの視温覚刺激に対して適切さ(調和度・実在感・好ましさ)を評価させた．実験の結果，提案インタフェースに設けるべき視温覚刺激に関する制約と，呈示された視覚刺激に対する適切な温覚刺激の呈示方法を得ることができた．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/asayama.png",
        "titleJP": "マーカを同時印刷した3Dプリンタ出力を対象とするビジョンベースの三次元物体位置・変形推定",
        "titleEN": "研究者: 浅山 弘孝",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": " 「3DCAD(Three-Dimensional Computer Assisted Design)や3DCG(Three-Dimensional Computer Graphics)などといったデータをもとに三次元物体を造形する機器として3Dプリンタがある.近年, この技術の発展により樹脂材料から金属材料などといったさまざまな材料を用いて高精度な印刷を行うことが可能となっている.そのため, 航空・宇宙・自動車などで使用される産業機器用の部品やインプラントなどの医療材料への利用などさまざまな分野への応用が期待されている.本研究では,その応用の一つとして複合現実感に注目する。機械 精度での画像マーカの印刷や事前シミュレーションによるマーカ設計の最適化などを行うことができるという点で, 3Dプリンタ技術は複合現実感における位置・変形推定という技術 課題を解決するアプローチの一つとなったと言える.本稿では,以下の二つの問題に対する提案とその結果について述べる。        提案手法では投影対象に対して,位置推定のための画像マーカを遺伝的アルゴリズムによって計算された最適な位置に印刷する.プロジェクションマッピングの際には,投影色補正によってマーカを隠消して投影結果の画質を向上させる.さらに,この位置推定とマーカ隠消という二つの技術課題と3Dプリンタの印刷方式を考慮した最適なマーカ設計の指針を提案する.        非剛体物体の変形推定への応用について述べる.非剛体物体を対象とする複合現実感の例として, 医療分野における臓器を対象とした血管などの情報提示が挙げられる.この際、適切な位置に適切な情報を提示するためには,対象の位置姿勢だけでなく変形も推定する必要がある.提案手法では,対象物体内部にドットマーカを印刷し,魚眼カメラによって内部から変形を推定する.推定方法としては,変形に応じて変化するドットマカの動きを機械学習の一つであるランダムフォレストを用いて行う、学習に使用するデータを, 印刷する3Dモデルデータを用いたシミュレーションによって作成することで, データ作成のコストを削減する. ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/ueda.png",
        "titleJP": "タブレットと投影仮想手による身体のサイバー拡張-Tablet-based ExtendedHand-",
        "titleEN": "研究者: 上田　雄太",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "手を用いた行動は我々の生活には欠かせない．我々は，ジェスチャによる対象の選択や場　所の指示，直接物に触れての操作，触覚による物の状態の把握，握手のような身体接触による交流など多くの場面で手を使用する．一方，身体的制約から，手を効果的に利用できる状況は，対象が手の届く近くの範囲にある場合に限られ，我々は手の届かない対象にポインタやリモコンを用途に応じて使用してきた．しかし，ポインタでは手のジェスチャのような表現に乏しく，リモコンでは手で直接物を操作するような動きでの入力ができない．また，各機器は個別に使い分けられ，統合的に手の役割を担う物では無い．そこで，本研究では，手の模倣物によって手の役割を統合的に代用し，身体性の高い表現や操作を遠くの対象にも可能とすることを目指す．        本研究では，プロジェクタから手のCG を投影し，その像を実手の動きで操作することで，手の投影像を介して遠くの対象に働きかける手法を提案する．従来の手のCGの操作には，没入感を重視して，装着の必要なデータグローブや手にマーカを貼り付けるモーションキャプチャが使用されてきたが，本研究では，日常的な場面でのシステムの使用を想定し，使用に際する準備が少なく，一般的に普及したデバイスであるタブレット（スマートフォンも含む）を操作機器に使用することを提案する．システムの設計については，学術的なデモ展示発表を通じて評価を収集し，改善を繰り返した．手の像の操作は，移動，手先の回転，指の曲げ，指差し，把持などが可能である．本研究ではネットワークを介して複数台のスマホで複数の手の像を操作できるシステムと，タブレット1 台で必要な処理が完結し，他のシステムへの組み込みが容易であるシステムの2 種類を実装し，デモ発表を通じて各々の実証実験を行った．現在，これらを応用した会議支援や福祉システムの研究が進められており，提案システムの多方面での応用が考えられる．実証実験では，手の像の動きとサイズに関する指摘を得た．このため，手の像の動きを，ユーザとの接続を保つような動きに改善した．さらに，接続性の保たれない，壁に手の像を投影する状況においては，その手の像の出現位置とサイズに関する被験者実験を行った．この結果，右手モデルの場合は投影範囲外の右下から投影ハンドを出現するように設定すべき，など今後の設計の指標となるユーザの傾向を得た．さらに，手の像をより実手の代わりに扱えるよう，コミュニケーションだけでなく，実環境中の物体の選択や操作にも使用できるような機能とシステムの実装も行った．        本稿では，タブレットで操作する投影ハンドを介して手の届く範囲を拡張する技術を提案し，その実現可能性と身体拡張技術の応用性の高さを，システムや機能の実装によって示す．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/kitajima.png",
        "titleJP": "光センサを用いたレーザプロジェクタの走査計測に基づく位置・姿勢推定",
        "titleEN": "研究者: 北島　友喜",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "投影型複合現実感技術は，複数の利用者が機器を装着せずに，実環境と仮想空間を統合した世界を共有できる技術である．この技術応用として，プロジェクタを実物体に向けることで，実物体の表面質感を変化させたり，アノテーション等の付加情報を物体位置にぴったり合わせて重畳表示するプロジェクションマッピング（Projection Mapping; PM) がある．プロジェクションマッピングでは，プロジェクタと実物体の相対位置が変化する動的な環境でも投影像と実物体が位置がずれずに，焦点ボケ等の画質劣化がないことが理想である．        実物体と投影像の位置合わせのためには，カメラやその他のセンサ（磁気式，超音波式，光学式など）を用いて，プロジェクタに対する投影対象の相対的に位置・姿勢を推定し，変形した画像をプロジェクタから投影する必要がある．カメラを用いる既存手法は，投影対象を遠隔から撮影した際に得られる画像特徴量から位置・姿勢を計算するが，投影対象の模様や形状や照明環境に大きく依存して精度が落ちてしまうことや，プロジェクタ-カメラ間の座標位置合わせ誤差の影響強く受ける欠点がある．またその他のセンサを用いる場合においても，環境中に金属や鉄筋等が存在する状況では精度が落ちること（磁気式）や，環境中に等間隔に受信機を配置する必要があり設置コストが高いこと（超音波式），所望の画像を鮮明に投影できなくなる欠点がある．        そこで，本研究では動的なPMにおける位置合わせ技術として，レーザプロジェクタと光センサの受光タイミングに基づく対象の位置姿勢推定手法を提案する．本手法ではレーザプロジェクタを用いるため，小型の装置で焦点合わせが不要という利点に加えて，提案する手法の特徴として計測のためのパターン光なしに，連続的に対象を追跡できる利点がある．        本稿では，提案した手法と作成したシステム，精度評価実験，アプリケーションについて示す．特にアプリケーションでは，ライトペン，マジックレンズ，プロジェクタドローン，動的プロジェクションマッピングシステム，マルチプロジェクタの幾何キャリブレーションシステムなどの複数の応用システムを作成し，提案手法の有効性を示したことを報告する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/aoyama.png",
        "titleJP": "重畳投影パターンの手に対する相対速度変調による力覚の操作",
        "titleEN": "研究者: 青山 宗太",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2016.",
        "abstract": "近年，複合現実感環境において視覚刺激のみを用いた疑似的な触力覚フィードバックを提示する研究が行われており，その提示には Pseudo-Haptics と呼ばれる錯知覚が利用されている．Pseudo-Haptics とは，固有受容感覚 (自分が身体を動かす感覚) と視覚情報との間で不整合が生じた際に，人間の脳の特性により，視覚情報が優先されることで実際には存在しない触力覚を知覚する現象のことである．Pseudo-Haptics を利用した研究の多くでは視覚情報提示デバイスとして，遮蔽型HMD(Head Mounted Display) や二次元ディスプレイなどが用いられている．しかし，それらにはディスプレイの解像度の低さや視野角の制限による疲労感や提示範囲の狭さといった問題がある．それらの問題を解決するために，プロジェクタを用いて実世界にリアルタイムで視覚情報を提示する手法が考えられるが，プロジェクタによる視覚刺激提示を用いた Pseudo-Haptics の研究はあまり行われていない．        そこで本研究では，プロジェクタを用いた視覚情報の提示により Pseudo-Haptics を生起させ，力覚を操作することに注目する．従来研究から，HMDや二次元ディスプレイによる視覚情報提示では，操作対象の速度を変調させることで疑似力覚の提示が可能であるという知見が得られている．この知見を利用し，ユーザが動かしている手にドットパターンの重畳投影を行い，ドットパターンの手に対する相対速度を変調させることで，ユーザの力覚にどのような影響があるのか調査し，分析することを目的とする．調査の結果，投影パターンの相対速度を大きくすることで，実際の力をより小さく知覚することがわかった．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/izawa.png",
        "titleJP": "適応的フォーカススイープ投影によるプロジェクタの被写界深度の拡張",
        "titleEN": "研究者: 井澤 英俊",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2016.",
        "abstract": "プロジェクタを用いた複合現実感(Mixed Reality:MR) では仮想空間の映像を実空間に投影することで, 仮想空間と実空間を光学的に重畳させるため特別なデバイスを身に着ける必要がなく, 現実感や臨場感の高い複合現実感を提示することができる. そのため, 娯楽・医療・教育など様々な分野で応用可能であり, これからの発展が期待されている. しかし, プロジェクタは投影像の明るさを保つために大きな開口を持ち, それにより投影像の焦点の合う領域（被写界深度）が狭くなってしまう. それゆえ, 一定の奥行き幅を持つ 三次元物体にプロジェクタで投影を行った場合, 焦点の合っていない領域が生じてしまい, 投影像の品質を著しく落としてしまう.        この問題を解決するために, 焦点を光軸方向に振動させる技術であるフォーカススイープをプロジェクタに適用することで, 視覚的に被写界深度を拡張する研究が行われた. この手法では, 焦点を常に同じ波形で振動させ, 投影する画像に補正を加えることで, 被写界深度を拡張させている.  ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/asai.png",
        "titleJP": "バーチャルハンドインタフェース搭載型車椅子のタッチ操作における機械学習による操作対象の推定",
        "titleEN": "研究者: 浅井 唯貴",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2016.",
        "abstract": "人間の手は表現力に富んでおり，コミュニケーションにおいてその表現力は自身の意図や目的を相手に正しく伝えるほか，相手に理解を促す補助としての役割を担っている．それは物事の指示であったり，物体の形状の伝達であったり，意思や関係性の伝達など様々な形で存在する．しかし車椅子の使用者の場合は，自身の手を用いてコミュニケーションを取ることができる範囲が制限される．なぜなら車椅子の使用者は，車椅子に座しているために手で直接操作できる範囲が狭くなるためである．また，車椅子が移動や旋回を行うのに十分な空間的余裕が無い場合，車椅子を移動させることができず対象に対して手が届く位置まで移動して対象を手で直接操作するといった動作を行えないことも挙げられる．ゆえに，車椅子の使用者には，手が届かない遠隔対象に対しても手を用いたコミュニケーションを可能とする手段が必要である．そこで，遠隔対象に対しても自身の手で対象を直接扱うかのような働きかけを可能とするバーチャルハンドインタフェースの一つである，ExtendedHandシステムを車椅子に搭載することを提案する．ExtendedHandでは，プロジェクタによって人間の手を模したCGモデル(バーチャルハンド)を実世界上に投影し，遠隔対象に干渉する際にバーチャルハンドを自身の手の代用として使用する．本研究ではタブレット端末を使用してバーチャルハンドを操作可能なExtendedHandを車椅子に搭載し，プロジェクタ投影されたバーチャルハンドを操作することによって，手を用いてコミュニケーション可能な範囲を拡張する．それと同時に，一つのタブレット端末を使用して車椅子とバーチャルハンドを共に片手でタッチ操作することができるように，車椅子の操作部を改造し，無線モジュールを介入させて車椅子とタブレット端末を無線接続させる．しかし，これによってタッチ操作の対象が二つ存在することになるため，ユーザがタッチ操作する際に操作対象を切り替える必要がある．その切り替え手法は，ボタンスイッチのような，ユーザに不要な動作が生じない手法が望ましい．そこで本研究では，車椅子とバーチャルハンドを操作する際に操作対象によってタッチパネルに接触する指の接触面積に差異が生じると仮定し，指の接触面積を機械学習させることでユーザが望む操作対象を自動で推定する手法を提案し，その推定精度を検証する．また，提案手法を用いて車椅子およびバーチャルハンドの操作対象の推定が可能であるか検証するために，指の接触面積を入力とした機械学習による操作対象の推定システムを実装し，操作対象の推定実験を行い，正しく推定できることを確認した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/enomoto.png",
        "titleJP": "複数人利用時のバーチャルハンドに対する識別と所有感覚",
        "titleEN": "研究者: 榎本 龍一",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2016.",
        "abstract": "身体拡張型インタフェースとは，人間の身体を擬似的に拡張することで自分の身体を扱うように操作が可能なインタフェースである．身体拡張型インタフェースは操作対象に自分の身体に類似したモデルを使用することで，操作対象を自分の身体のように感じさせ，仮想物体に対して直感的な操作を可能にする．投影型の身体拡張型インタフェースであるExtendedHandはカメラなどのセンサを用いてユーザの手の動きを認識し，それに応じてプロジェクタから投影されるバーチャルハンドを動作させることによりユーザの手先をその移動方向に疑似的に伸ばすことができるインタフェースである．今後このインタフェースが普及し，複数人で使用する状況が想定できる．本研究では複数人でExtendedHandを使用する状況を想定し，会議等でバーチャルハンドを互いに操作してコミュニケーションを行う状況について考える．同じ色や形状のバーチャルハンドが表示されている中で，自分が操作しているバーチャルハンドに対して，「このバーチャルハンドは自分が操作している」という操作対象が自己に帰属する感覚(所有感覚)の生起の有無について調査を行った．また，所有感覚の生起しやすさについて，バーチャルハンドとポインタとの間の有意差の存在の有無について調査を行った．調査のため実験参加者には，ディスプレイ上に表示されている複数のバーチャルハンドの中から自分が操作できる唯一のバーチャルハンドを捜すタスクを行わせ，タスクに要した時間を計測した．計測の結果，バーチャルハンドに対して所有感覚が生起することが確認され，また所有感覚の生起までの時間についてポインタとの間に有意差が見られた．この結果から，操作対象の見た目をバーチャルハンドからポインタに変えたことでユーザの感覚に違いが生まれ，バーチャルハンドの方が所有感覚の生起が早い傾向にあることが推測された．一方で他者から見たときに「バーチャルハンドが誰に操作されているのか」が一目でわかるようにするため，ユーザ位置からバーチャルハンドを進入させる機能を，ユーザとバーチャルハンドの幾何整合性を利用して実装した．システムの評価実験を行った結果，10度前後の誤差で推定することができた．また実験参加者の感想から，表示するバーチャルハンドが右手であるか，左手であるかによって誤差に対する感覚が変化することが推測された．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/okutani.png",
        "titleJP": "視覚的形状操作において実物体表面質感を毀損しないステレオ投影に関する研究",
        "titleEN": "研究者: 奥谷 凪",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2016.",
        "abstract": "製品デザイン工程では，クレイモデル等のモックアップを何度も試作し，最終的なデザインの決定を行う手法が主流であるが，モックアップの作成に費用や時間がかかってしまい 効率的とは言い難い．モックアップ製作数を減らすべく，近年では複合現実感(MR :Mixed Reality) 技術を用いた様々なデザイン支援システムの研究が行われている．そのなかでもプロジェクションマッピング（PM: Projection Mapping）により，実物体を視覚的に形状操作するステレオ投影技術は，製品の「ボリューム感」や「味わい」などを損なうことなく製品デザインプロセスを効率化することが期待できる。しかし，プロジェクタの空間解像度およびダイナミックレンジには限界があり，映像のみでシボ等の表面質感の高品位な再現は困難である．シボ等の表面質感は高級感やソフト感などの感性品質の要因の一つであり，製品デザインにおいて重要である．        そこで本研究では，プロジェクタを用いたデザイン支援システムにおいて，高解像度な表面質感の表現を可能とすることを目的とする．従来の投影型デザインシステムのように白色実物体に表面質感情報を投影するのではなく，表現したい表面質感を持つ実物体を投影対象とすることで，その質感を保持しつつ実物体の形状を操作する手法を提案する．さらに提案手法により，視覚的形状操作後も表面質感が保たれているようにユーザが知覚することを実験的に確認した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/nakamura.png",
        "titleJP": "移動ロボットへのプロジェクションマッピングによる動き補正",
        "titleEN": "研究者: 中村 萌",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2016.",
        "abstract": "近年，介護用ロボットや医療用ロボット，サービスロボットなど人のそばで働くロボットが発展している．これらのロボットは介護施設や医療施設だけではなく家庭での使用も想定されているが，一般家庭に普及するには未だ高価である．自然で滑らかな動きを実現するために高価なアクチュエータを使用していることがその理由の一つである．ロボットが自然な動きをしつつ安価であれば，高価なロボットよりも一般家庭に普及しやすいと考えられるため，ぎこちないロボットの動きを緩急のある自然な動きに見せるため，複合現実感技術のひとつであるプロジェクションマッピングを用いて見た目の速度を変調することを考える．多くのプロジェクションマッピングは明るい場所での使用に適していないが，静止画を動いているように見せた変幻灯は比較的明るい場所での使用も可能である．この変幻灯の技術を用いて静止画ではなく移動するロボットの見た目の速度を変調することが本研究の目的である．提案手法としては，移動ロボットの位置姿勢をカメラ画像より推定し，現在位置画像と目標位置画像の輝度の差分を移動ロボットに投影することで見た目の速度補正を行う．移動ロボットにマーカーとして再帰性反射材を取り付け，照射し反射された赤外線をカメラ画像処理によって認識することで移動ロボットの位置姿勢推定を行う．実験では,等速で直進するまたは加速する移動ロボットに加速・減速方向の投影をし，テクスチャの輝度差分の投影の場合最高 65%の減速効果，50%の加速効果，ランダムドットパターンの投影の場合最高60%の減速効果，35%の加速効果を確認した．結果としてテクスチャの輝度差分の投影によって，等速または加速するルンバの速度を半数以上のある割合で実際よりも遅くまたは速く見せることができた．またずれの変位が同じ場合概ねランダムドットパターンの投影よりもテクスチャの輝度差分の投影がより補正効果があることがわかった．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/kanamori.png",
        "titleJP": "投影型複合現実感における視覚的な接触対象の変形および身体の平行移動による形状知覚操作",
        "titleEN": "研究者: 金森 俊雄",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2015.",
        "abstract": "現実空間と仮想空間をリアルタイムで重ね合わせる複合現実空間(MR: Mixed Reality) において，視覚刺激のみを用いて疑似的に触力覚を提示する研究が行われている．その提示にはPseudo-Haptics と呼ばれる視覚-力触覚間に発生する錯知覚が利用されている．Pseudo-Haptics とは，視覚と力触覚との間に不整合が生じた際に，視覚による情報が優勢になるという脳の特性から，力触覚に錯覚が生じる現象のことである．現在では，Pseudo-Haptics を用いた視触覚システムの大半では，実装する複合現実感方式として遮蔽型HMD (Head Mounted Display) や二次元ディスプレイなどを使用するビデオシースルー方式を用いている．しかし，視覚情報をプロジェクタより実世界上に重畳する投影型MR を用いた力触覚フィードバック提示については，定量的な評価や議論は現在でもあまり進んでいない．        そこで本研究では，これまで十分な調査が行われていない投影型MR におけるPseudo-Haptics に着目する．投影型MR において，映像で提示する物体の形状およびユーザの手先の運動軌跡を変調させることによって，実物体の形状に対する知覚を変化させることが可能であるかどうかを実験的に検証することを目的とする．具体的には，実際の物体に触れているユーザの手の動きを検出し，それに同期させて，手先の映像をユーザの実際の手先位置からずらして異なる形状の物体に触れている映像を重畳投影することによって，視覚情報と力触覚情報との間に不整合を生じさせる手法を提案し，形状知覚に与える影響を実験で検証した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/shinmei.png",
        "titleJP": "投影型上腕拡張UIにおける触覚フィードバック?",
        "titleEN": "研究者: 新明 拓也",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2015.",
        "abstract": "タブレット端末やスマートフォンなどのタッチ入力インタフェースの普及により，ユーザは操作したい対象に直接手で触れることで対象の操作が可能になった．以後，このような操作を直接的な入力と呼ぶ．一方で，一般的なタッチ入力インタフェースには手元にタッチパネルが無ければ入力を行うことができないという距離的な制約がある．距離的な制約を持たず，タッチ入力のように直接的な入力が行えるインタフェースの一つに，身体拡張ユーザインタフェースがある．身体拡張ユーザインタフェースとは，ユーザの身体が疑似的に拡張(伸びる，大きくなるなど)された視覚表現を呈示することにより，ユーザに対して自分の身体が拡張されたかのような感覚を与え，ユーザの身体が直接届かない場所にある操作対象に対してもユーザが直接的な入力を行えるインタフェースである．しかし，これらのインタフェースは，入力によって得られるフィードバックが視覚から得られる情報のみである．そのため，ユーザから遠い位置での作業や，視覚的に遮蔽がある場合，インタフェースの位置把握が難しくなる．このような問題を解決し，身体拡張ユーザインタフェースの操作性を向上させるためには，視覚以外のフィードバックをユーザに与える方法が考えられる．特に，触覚フィードバックをユーザに呈示することで操作性を向上させる研究は数多く行われており，その効果が示されている．触覚フィードバックを付与することで，ユーザが操作をしているもの(ポインタ・カーソルなど)の位置を認知するサポートを行うことができ，さらに，操作したい対象が定まっていれば，対象までの距離に応じた触覚フィードバックを与えるなどの工夫を行うことで，対象の周辺までの移動を早めることができるため，操作したい対象の周辺への到達時間が短くなると考えられる．そこで本研究では，身体拡張ユーザインタフェースに触覚フィードバックを付与することで，これらの問題を緩和する．        本研究の目的は，距離的な制約を解消し，直接的な入力を行うことができる身体拡張ユーザインタフェースに，触覚フィードバックを付与することで，視覚的な問題を解消でき，ユーザにとってより扱いやすいインタフェースの設計指針を示すことである．そのため，実際に様々な種類の触覚フィードバックをユーザに呈示する身体拡張ユーザインタフェースを構成し，どのような触覚フィードバック要素が実際に物体に触れている感覚に有効であるのかを調査する．また本システムは，机の上や部屋の中に多くの物体があるような一般的な実環境における実装を想定しているため，環境に応じた触覚フィードバックを呈示したい．そこで，環境のセンシングを行い，環境の変化にも対応できるシステムを構築する．構成した実験システムを用いて，各触覚フィードバック要素がユーザへ与える影響を調査するための心理実験を行い，考察を行い，知見を得た．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "",
        "titleJP": "移動体への投影を考慮した複数台プロジェクタドローンの投影輝度最大化のための配置の動的最適化",
        "titleEN": "研究者: 細溝 仁人",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2015.",
        "abstract": "今日，ドローンは輸送・撮影・災害調査を始め，多方面で活躍し始めている．また，法整備が進み始めたことで，今後の更なる市場の発展が期待されている．近年では，ドローンの柔軟な移動能力を活かした映像提示デバイスが提案されている．例えば，タブレット端末を搭載したものやプロジェクタを搭載したもの（以下，プロジェクタドローンと記す）が提案されており，公共ディスプレイやモバイルプロジェクタとしての役割を担うことが想定されている．また，これらは複合型現実感(MR : Mixed Reality)技術との親和性が高く，MR技術を利用したサービスの提供も可能となることが期待できる．例えば，歩行者への情報提示や移動体に追従しながらの投影などが考えられ，固定式のディスプレイやプロジェクタと違い，移動を伴う使用に柔軟に対応可能となることが考えられる．その中でもプロジェクタドローンは，現実世界へのCG(Computer Graphics)の重畳表示が可能かつ小型の機器でも大画面を提示できる利点を持つ．しかし，プロジェクタドローンはまだ研究の緒についたばかりの段階にあり，投影時の映像の揺動，投影輝度の低さとそれに伴う投影距離の制限による投影範囲の縮小が課題として挙げられる．映像の揺動を抑制する手法はこれまでにも提案されてきたが，輝度の低下や投影範囲の縮小を解決するアプローチは未だ提案されていない．        本研究では，プロジェクタドローンの投影輝度の低下と投影範囲の縮小に対する課題解決 のためのアプローチを提案する．具体的には，複数台のプロジェクタドローンによる投影範 囲の拡大とそれらの配置を投影輝度に関して動的に最適化する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/matsukage.png",
        "titleJP": "遠隔教育用共有机上に投影された対話者腕の方向一致によるソーシャルプレゼンス強化",
        "titleEN": "研究者: 松蔭 瞭",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2015.",
        "abstract": "代表的な遠隔教育メディアであるテレビ電話では対話者非言語情報の欠落が生じるため，対話者の非言語情報や作業内容を机上に投影して双方向に共有する遠隔共有机の研究が行われている．従来の遠隔共有机では，対話者の作業内容やジェスチャを共有するために，遠隔地の机上映像をもう一方の机上に投影する．そのため，互いの机上の書面の位置関係が同じでなければ机上の状態と投影内容の位置的整合性が崩れてしまう問題がある．さらに，ディスプレイ上遠隔対話者と対話者腕（机上に投影された対話者のハンドジェスチャ）の方向的不整合から生じる遠隔対話者ソーシャルプレゼンス（対話者が実在しているかのような意思疎通の円滑さ）低下が考慮されていない．ソーシャルプレゼンス強化は心理的距離縮小や参加促進など，教師や学習者に多くのメリットを与える．そこで本研究では，ディスプレイ上対話者から対話者腕が伸びてくる遠隔書類座標系共有机を提案することで，上述の二つの問題にアプローチした．机上状態と投影内容の不整合に対しては書類座標系に基づく机上共有を提案することで従来の遠隔共有机の机上書面位置関係の制約を解消し，異なる作業環境間においても位置的に整合された机上共有を実現した．ソーシャルプレゼンス低下に対してはディスプレイ上対話者と対話者腕の方向的整合を提案することで遠隔対話者のソーシャルプレゼンス強化を図り，提案モデルと実寸大ディスプレイ環境の組み合わせによりCo-presence が強化(p < 0:01) されることを確認した．さらに環境に依存せず提案モデルがAttentional allocation (p < 0:01), Affective understanding (p < 0:01), Affective interdependence (p < 0:05), Behavioral interdependence (p < 0:01), Partner Reality(p < 0:01) を強化することを確認した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "",
        "titleJP": "Expression Manipulation: Changing Facial Expression with Projection Mapping",
        "titleEN": "研究者: Stanley Mah",
        "publication": "論文種別・提出年: テクニカルレポート, Aug. 2015. ",
        "abstract": "Through the use of projectors and computer algorithms, we are able to change the perceived image of a persons face. This is done through a method called projection mapping, which, in a very basic definition, is projecting an image onto an object to change the appearance of the object. For this particular research, the focus will be on facial expressions. The origin of this study came from the “OMOTE/REAL-TIME FACE TRACKING & PROJECTION MAPPING” project who's goal was to express “[beauty] and [make-up art] instead of technological gimmicks and impacts” that projection mapping can create. The project was the first of its kind and so many things had to be created from the ground up, such as a sensor capturing program to capture sensors placed on the face and processing the sensor positions to map CG rendered images to the face using a projector. What was important for the project members was to be able to convey a message through a rich facial expression while allowing the user to be able to move around freely.         The goal the my study developed was to determine how effective projection mapping is when trying to change a person's perceived facial expression and what are the effects of mixing two different facial expressions together. While mixing different facial expressions together in preliminary testing, it was found that using the same person's face caused little to no difference to the expression so the studies focus was more towards mixing expressions of different people. ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/takeda.jpg",
        "titleJP": "非平面投影システムにおける投影面反射率パターンの反復修正に基づく相互反射抑制手法",
        "titleEN": "研究者: 竹田　翔一",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2015.",
        "abstract": "仮想現実感(Virtual Reality: VR) の分野では，プロジェクタを利用した投影システムに関する研究が盛んに行われている．その中でも，高コントラスト投影表示は，重要な技術課題の一つである．平面対象物とは異なり，非平面対象物への投影については，投影面間で発生する相互反射(高次の拡散反射光) を考慮する必要がある．相互反射により，本来表示されるべき画像とは異なり，不自然に明るくなった画像が表示される．これを解決するためさまざまなアプローチが提案されてきたが，プロジェクタのダイナミックレンジが有限なために，完全に相互反射補償を行うことはできていない．そこで本研究では，非平面投影システムにおける相互反射抑制効果を，従来よりも大きくすることを目的とする．そこで今回，本研究ではフォトクロミズム(Photochromism) と呼ばれる現象に着目した．フォトクロミズムは，光刺激によってある化合物の状態が可逆的に変化する現象のことを呼ぶ．光刺激には紫外線等の短波長光が用いられ，吸収波長帯も材料ごとに異なり，その変色の種類もさまざまである．本研究では，紫外線を照射すると無色から黒色に変色する性質を持つフォトクロミック化合物を，白色の布地に塗布したものを投影対象として用いることで，投影面反射率の変調を可能とした．フォトクロミズムを利用することで投影面反射率を空間的に変調させる，平面対象物への高コントラスト投影表示のための新たな手法は，すでに提案されている．一方で，フォトクロミズムを利用した非平面対象物への高コントラスト投影表示手法は，未だ提案されてはいない．よって本研究では，フォトクロミズムを利用した非平面対象物への高コントラスト投影表示手法を提案する．具体的には，投影光と投影面反射率パターンの二つの反復修正によって，高コントラスト投影表示を行うシステムを提案する． ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/takeuchi.jpg",
        "titleJP": "Visuo-Thermal Projector: 視覚と温覚に対する非接触情報提示インタフェース",
        "titleEN": "研究者: 武内　真梨奈",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2015.",
        "abstract": "温覚は，仮想空間への没入感や仮想物体の現実感を高める重要な感覚である．仮想空間において，仮想物体の温度を再現してユーザに提示することができれば，仮想物体がより自然なものとして知覚されると考えられる．我々は，視覚情報に加えて温覚情報を提示することができるインタフェース「Visuo-Thermal Projector」を構築した．Visuo-Thermal Projector は，熱をもつ仮想物体を，3 次元空間で視覚的および温覚的にユーザに知覚させることを想定している．可視光プロジェクタから仮想物体の視覚情報をユーザの身体に投影し，同時に赤外光プロジェクタから仮想物体の温覚情報を投影する．このとき，提案インタフェースが提示する視温覚刺激の対応が，実空間で熱をもつ物体に触れたときに与えられる視温覚刺激の対応と同じように整合していれば，熱をもつ仮想物体があたかも実在しているかのように，違和感なくユーザに知覚されると考えられる．一方で，提示する視温覚刺激の対応に不整合が生じると，ユーザに熱をもつ仮想物体を自然に知覚させることができなくなる可能性がある．さらに，提案インタフェースは視覚情報と温覚情報を同時に提示するため，クロスモーダル錯覚が生じると考えられる．そのため，提案インタフェースにおいて生じるクロスモーダル錯覚が，ユーザが知覚する視温覚刺激の対応に与える影響も考慮する必要がある．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/asayama.jpg",
        "titleJP": "動的プロジェクションマッピングにおける投影対象の位置姿勢推定のための3Dプリンタ出力へのマーカ埋め込み",
        "titleEN": "研究者: 浅山　弘孝",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2015.",
        "abstract": "複合現実感技術の一つに，色や形状のある三次元物体に投影を行うプロジェクションマッピング(PM) がある．PMでは，投影対象の色や形状に合わせて投影画像の補正を様々に行うため，投影対象の位置や姿勢などを測定する必要がある．この測定は投影対象が動く度に行わなければならないので，PMの投影対象は静的な物体であることが多く，動的な物体を対象としたPMは少ない. 以上のことから，本研究では動的な物体へのPMに注目する．従来の動的PMの位置姿勢推定手法は，投影対象にマーカを取り付ける手法と取り付けない手法に分けられる．前者には，追跡が行えるように投影対象は緩やかな動きに限られるという制約があり，後者においては，マーカを手作業で貼付することが多いため，手間に加えて誤差が発生して推定精度が低下する可能性がある．そこで，本研究では動的PM における位置姿勢推定のために，あらかじめ3D モデルにマーカを埋め込み，3D プリンタで投影対象を作成する手法を提案する．3D モデルに対するマーカの埋め込み，および3D プリンタによる投影対象の作成は，マーカ取り付けの手間と誤差を削減することや，事前のシミュレーションによって位置姿勢推定が正しく行えるようなマーカ配置を自動的に見つけることを可能にするといった利点がある．また，3D プリンタのフルカラー印刷技術により，マーカの色の濃さを自由に変えることが可能である．そのため，色を薄くすることで，プロジェクタの投影によって観測者からマーカを視認できなくすることが可能である．提案手法では，そのようなマーカの色を決定し，任意の方向から安定に位置姿勢推定ができるマーカ配置を遺伝的アルゴリズムによって自動的に算出する．この提案手法による動的PM の実現を本研究の目的とする．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/",
        "titleJP": "",
        "titleEN": "",
        "publication": "",
        "abstract": "",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/",
        "titleJP": "",
        "titleEN": "",
        "publication": "",
        "abstract": "",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/",
        "titleJP": "",
        "titleEN": "",
        "publication": "",
        "abstract": "",
        "link": "",
        "collaboration": ""
    }, 

    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/",
        "titleJP": "",
        "titleEN": "",
        "publication": "",
        "abstract": "",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "user interfaces",
        "photoPass": "images/researches/colormod.jpg",
        "titleJP": "3Dプリント後でも自由に色が変えられる",
        "titleEN": "ColorMod: Recoloring 3D Printed Objects using Photochromic Inks",
        "publication": "ACM CHI 2018",
        "abstract": "ColorModが利用するインクは、基本の染料、光重合開始剤、そして光順応染料を混合したものだ。特定の波長の光を照射すると、光順応染料が基本染料の色を発色させるのを促し、光重合開始剤が基本染料を硬化させる仕組みだ。インクはUV光照射でアクティベートされて発色するが、可視光を照射すると非アクティベートされて無色になる。...",
        "link": "http://hcie.csail.mit.edu/research/colormod/colormod.html",
        "collaboration": "HCI Engineering Group@MIT CSAIL [<a href='http://hcie.csail.mit.edu/' target='_new' class='research-link'>HP</a>]との共同調査"
    },
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/markerfab.jpg",
        "titleJP": "隠消型プロジェクションマッピングマーカー",
        "titleEN": "Fabricating Diminishable Visual Markers for Projection Mapping",
        "publication": "IEEE TVCG 2018, IEEE VR 2018, Siggraph Asia ETech 2015",
        "abstract": "工業デザインや医療情報可視化などの応用を見据え、3Dプリンタで出力したモックアップにきちんと映像を3次元的に位置合わせするためのプロジェクションマッピング技術を研究しています。これまで位置合わせを行うためには、投影対象となるモックアップ等にマーカーと呼ばれる目印を取り付ける必要がありましたが、これらのマーカーはプロジェクション...",
        "link": "http://daisukeiwai.org/jp/research/markerfab.html",
        "collaboration": ""
    },
    {
        "theme": "user interface",
        "photoPass": "images/researches/consistentdesk.jpg",
        "titleJP": "ConsistentDesk: 遠隔の机状況のプロジェクション共有",
        "titleEN": "ConsistentDesk: Geometrically Consistent Projection-based Tabletop Sharing",
        "publication": "IEEE Access 2018, Siggraph Asia ETech 2015",
        "abstract": "一般的なテレビ会議では互いの顔を見ながら会話できますが、離れた机の上同士で共同作業する場合は手元が見えず、十分な情報伝達ができているとは言えません。そこで私たちは、遠く離れた机の上での作業の様子をカメラで撮影して、プロジェクタを使って自分側の机の上に表示する技術を研究しています。このような技術を共有机と呼び、遠隔教育などへの応用を...",
        "link": "http://daisukeiwai.org/jp/research/consistentdesk.html",
        "collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/spap.jpg",
        "titleJP": "SPAP: 走査時間計測によるレーザプロジェクタ幾何補正",
        "titleEN": "SPAP: Simultaneous Projection and Positioning",
        "publication": "IEEE TVCG 2017, IEEE ISMAR 2017",
        "abstract": "走査型のレーザプロジェクタを対象として、従来必要とされてきた特殊パターンの投影やカメラ計測が不要で、光センサによる走査時間計測にもとづいて幾何補正を行う技術(SPAP: Simultaneous Projection and Positioning)を提案する。...",
        "link": "http://daisukeiwai.org/jp/research/spap.html",
        "collaboration": ""
    },
    {	
        "theme": "projector-camera system",
        "photoPass": "images/researches/makeup.jpg",
        "titleJP": "Makeup Lamps: 顔へのリアルタイムプロジェクションマッピング",
        "titleEN": "Makeup Lamps: Live Augmentation of Human Faces via Projection",
        "publication": "Computer Graphics Forum 2017, Eurographics 2017",
        "abstract": "人の顔にマーカーレスでプロジェクションマッピングする技術を開発しました。高速プロジェクタとカメラを使用し、CPUとGPUを駆使した処理最適化によって、顔の位置姿勢化に対して投影像が平均9.8ミリ秒の遅延で追従し、表情変化に応じてインタラクティブに投影コンテンツを切り替えることを実現しました。...",
        "link": "https://www.disneyresearch.com/publication/makeup-lamps-live-augmentation-of-human-faces-via-projection/",
        "collaboration": "Disney Research Zürich [<a href='https://www.disneyresearch.com/' target='_new' class='research-link'>HP</a>]との共同調査"
    },
    {
        "theme": "user interfaces",
        "photoPass": "images/researches/lazynav.jpg",
        "titleJP": "VR空間探索のための「くつろいだ」インタフェース",
        "titleEN": "LazyNav: 3D Ground Navigation with Non-Critical Body Parts",
        "publication": "IEEE TVCG 2017, IEEE 3DUI 2015",
        "abstract": "くつろいだ姿勢でバーチャル空間を効率的に探索するためのインタフェースの概念LazyNavを提唱した。手に荷物を持っていても問題なくバーチャル空間を探索できるよう、体幹と脚のジェスチャ（ただし、小さい動きに限る）を採用し、身体動作とバーチャル空間の移動回転の自然な対応を調査した。...",
        "link": "https://perso.telecom-paristech.fr/boubek/papers/LazyNav/",
        "collaboration": "フランスTelecom ParisTechのTamy Boubekeur教授 [<a href='https://perso.telecom-paristech.fr/boubek/' target='_new' class='research-link'>HP</a>]との共同調査"
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/deforme.jpg",
        "titleJP": "DeforMe: 柔軟物体の変形可視化プロジェクション",
        "titleEN": "DeforMe: Visualization of Tangential Surface Deformation using Invisible Textures",
        "publication": "KJMR 2013, ACM SIGGRAPH Asia 2013: Emerging Technologies, and Springer VR 2015",
        "abstract": "柔軟物体の変形をプロジェクションマッピングにより可視化する技術の研究を行っている。投影像に影響を受けない赤外線のみを選択的に吸収する特殊なインクで柔軟物に人の目には見えない特徴点を書き込み、それを赤外線カメラを用いて計測することで変形の計測を行った。ユーザインタラクションによる遮蔽がある場合でも頑健に変形計測が動作する。...",
        "link": "https://punpongsanon.info/deforme/",
        "collaboration": ""
    },
    {
      "theme": "projector-camera system",
      "photoPass": "images/researches/STAR18.jpg",
      "titleJP": "最新のプロジェクションマッピング研究動向の網羅的調査",
      "titleEN": "Recent Advances in Projection Mapping Algorithms, Hardware and Applications",
      "publication": "Computer Graphics Forum 2018, Eurographics 2018",
      "abstract": "プロジェクションマッピングの最新の研究動向を網羅的に調査しました。非平面投影時の位置合わせ、模様面投影時の色補償といった基盤技術に加え、ここ数年、技術進歩の著しい動的プロジェクションマッピングを実現するアルゴリズムについてまとめています。さらに、通常のプロジェクタの技術的制約を解決し、広ダイナミックレンジ・高速・高解像度・広被写界深度な投影を実現する新たなハードウェアに技術ついても紹介しています。...",
      "link": "https://www.disneyresearch.com/publication/recent-advances-in-projection-mapping-algorithms/",
      "collaboration": "Disney Research Zürich[<a href='https://www.disneyresearch.com/' target='_new' class='research-link'>HP</a>]との共同調査"
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/hysar.jpg",
		"titleJP": "HySAR: プロジェクションマッピングと透過型ARを組み合わせた質感再現",
		"titleEN": "HySAR: Hybrid Material Rendering by an Optical See-Through Head-Mounted Display with Spatial Augmented Reality Projection",
		"publication": "IEEE TVCG 2018, IEEE VR 2018",
		"abstract": "プロジェクションマッピングと透過型の拡張現実感ディスプレイ(例: ホロレンズ)を組み合わせた、高品位な質感再現フレームワークを提案しました。プロジェクションマッピングを用いることで、現実空間に所望の質感をもつ3次元物体を再現する試みが行われてきました。しかしながら、プロジェクションマッピングで描画される模様は、見る方向が変わっても同じ...",
		"link": "http://daisukeiwai.org/jp/research/hysar.html",
		"collaboration": "慶應義塾大学・杉本麻樹准教授[<a href='http://im-lab.net/' target='_new' class='research-link'>HP</a>]、東京工業大学・伊藤勇太助教[<a href='http://www.ar.c.titech.ac.jp/' target='_new' class='research-link'>HP</a>]との共同研究"
    },
    {
        "theme": "projector-camera system",
		"photoPass": "images/researches/distopt2.jpg",
		"titleJP": "分散最適化にもとづく協調型プロジェクションマッピング影除去",
		"titleEN": "Inter-reflection Compensation of Immersive Projection Display by Spatio-Temporal Screen Reflectance Modulation",
		"publication": "Computer Graphics Forum 2017, Eurographics 2017",
		"abstract": "プロジェクションマッピングでは、プロジェクタと投影対象との間に遮蔽物があると、映像に影が生じてしまうという問題がある。一方、プロジェクションマッピングでは、複数台のプロジェクタが同時に使用されることが多く、特に大規模な場合には、数十台のプロジェクタが使われることもある。...",
		"link": "http://daisukeiwai.org/jp/research/distopt2.html",
		"collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/softar.jpg",
        "titleJP": "SoftAR: プロジェクションマッピングによる柔らかさ知覚操作",
        "titleEN": "SoftAR: Visually Manipulating Haptic Softness Perception in Spatial Augmented Reality",
        "publication": "IEEE TVCG 2015, IEEE ISMAR 2015",
        "abstract": "プロジェクションマッピングによる視覚効果で、触っているものの柔らかさ知覚を操作する研究を行っている。五感の中での視覚の優位性を利用して、触っている指先の色と、対象の模様の動きを視覚的に変調することで、触っているものをより柔らかく感じさせる。準備として、様々な柔らかさの物体を押した時の押す強さと表面模様の動きとの関係を計測...",
        "link": "http://daisukeiwai.org/jp/research/softar.html",
        "collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/distopt.jpg",
        "titleJP": "分散最適化にもとづく協調型プロジェクションマッピング色補正",
        "titleEN": "Radiometric Compensation for Cooperative Distributed Multi-Projection System through 2-DOF Distributed Control",
        "publication": "IEEE TVCG 2015, IEEE ISMAR 2015",
        "abstract": "継ぎ目のないプロジェクションマッピングを行うためには多くのプロジェクタが必要となる。各プロジェクタに対して画像を生成するのは非常にコストが高く、1台の端末で行うことは困難である。さらに、生成された画像を各プロジェクタに伝送することは通信量が膨大となり現実的ではない。一方、非白色面に映像投影する際に生じる色ズレを補償し、所望...",
        "link": "http://daisukeiwai.org/jp/research/distopt.html",
        "collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/ffsp.jpg",
        "titleJP": "高速焦点スイープ投影によるプロジェクタの被写界深度拡大",
        "titleEN": "Extended Depth-of-Field Projector by Fast Focal Sweep Projection",
        "publication": "IEEE TVCG 2015, IEEE ISMAR 2015",
        "abstract": "プロジェクタの被写界深度を拡大するシンプルな手法を提案する。コンピュータ制御により焦点距離を変調できる液体レンズを、プロジェクタレンズの前面に設置し、人の視覚の臨界融合周波数の頻度で焦点距離を周期的に変調する。これにより、投影画像の合焦距離を、投影シーン中にプロジェクタに対して前後方向に高速にスイープすることができる...",
        "link": "http://daisukeiwai.org/jp/research/ffsp.html",
        "collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/synthprocams.jpg",
        "titleJP": "合成開口撮投影による影除去",
        "titleEN": "Shadow Removal of Projected Imagery by Occluder Shape Measurement in a Multiple Overlapping Projection System",
        "publication": "Virtual Reality 2014",
        "abstract": "分散配置された複数台のプロジェクタからの映像を投影対象に重畳させる環境を構築して、遮蔽によってプロジェクション映像に生じる影を除去する。これまでの研究では、影を検出するために投影対象を撮影するカメラは遮蔽されないことが仮定されており、実応用には適さなかった。本研究ではこの制約を緩和するため、複数台のカメラを分散配置し、合成開口...",
        "link": "http://daisukeiwai.org/jp/research/synthprocams.html",
        "collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/pantilt.jpg",
        "titleJP": "パンチルト投影でのモーションブラー抑制",
        "titleEN": "Reducing Motion Blur Artifact of Foveal Projection for Dynamic Focus-Plus-Context Display",
        "publication": "IEEE TCSVT 2014",
        "abstract": "本研究では、パンチルト投影を用いて、動的なフォーカス・プラス・コンテキスト(F+C)ディスプレイを実現する際に、パンチルト投影のモーションブラーを抑制する技法を提案する。動的F+Cディスプレイでは、観察者が注目する領域に追従して高解像度表示するプロジェクタと、そうでない領域全体を低解像度表示する固定プロジェクタによって構成され...",
        "link": "http://daisukeiwai.org/jp/research/pantilt.html",
        "collaboration": ""
    },
    {
        "theme": "user interfaces",
        "photoPass": "images/researches/bluewarm.jpg",
        "titleJP": "色と温度の感覚間相互作用",
        "titleEN": "Combining colour and temperature",
        "publication": "Scientific Reports 2014",
        "abstract": "一般に、赤い色は温かい印象を、青い色は冷たい印象を引き起こすと考えられている。しかし我々は、温度を直接手で触れて感じるときには、逆の関係性があることを示した。実験1では、色の付いた物体に触れたときに「温かい」と感じられる最低の温度を計測した。...",
        "link": "http://daisukeiwai.org/jp/research/bluewarm.html",
        "collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/phc.jpg",
        "titleJP": "高コントラスト投影のためのフォトクロミズムを利用した動的反射率制御",
        "titleEN": "Projection Screen Reflectance Control for High Contrast Display using Photochromic Compounds and UV LEDs",
        "publication": "Optics Express 2014",
        "abstract": "本研究では、スクリーンの反射率を時空間的に制御することで、プロジェクションディスプレイのコントラストを向上させる手法を提案する。明るい映像を表示する箇所の反射率を高く、暗い映像を表示する箇所の反射率を低く制御することによって、通常の単一白色のスクリーンを使用するときと比べて、投影結果のコントラストをブーストさせることができる。...",
        "link": "http://daisukeiwai.org/jp/research/phc.html",
        "collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/shadow.jpg",
        "titleJP": "実影に映像が浮かび上がるテーブルトップ型コンピュータ",
        "titleEN": "Making Graphical Information Visible in Real Shadows on Interactive Tabletops",
        "publication": "IEEE TVCG 2014, ISMAR 2014",
        "abstract": "我々は、インタラクティブサーフェスの研究において、サーフェス上にできるユーザの影の中に情報を浮かび上がらせる画像情報隠蔽技法を提案する。提案手法では3台のプロジェクタを使用する。1台はサーフェス背面に設置し、他の2台はサーフェス上方に設置する。...",
        "link": "http://daisukeiwai.org/jp/research/shadow.html",
        "collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/radcomp.jpg",
        "titleJP": "高精度プロジェクション色補正",
        "titleEN": "Artifact Reduction in Radiometric Compensation of Projector-Camera Systems for Steep Reflectance Variations",
        "publication": "IEEE TCSVT 2014",
        "abstract": "投影対象の反射率が投影1画素内で空間的に均一でない場合の色補正精度の悪化を最小化するため、近年低コストで入手できるようになった1,000万オーダーの画素数をもつ高解像度カメラを用いて、この問題を解決する技術を提案する。投影1画素内の投影反射色を高密度に計測し、プロジェクタに入力する画素値と投影表示される反射色との関係を得る。...",
        "link": "http://daisukeiwai.org/jp/research/radcomp.html",
        "collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/avatar.jpg",
        "titleJP": "アンドロイド顔表情の高品位化",
        "titleEN": "Augmenting Physical Avatars Using Projector-Based Illumination",
        "publication": "ACM TOG 2013, Siggraph Asia 2013",
        "abstract": "アンドロイドの顔表情を豊かにするために、プロジェクタからの映像投影技術を利用することを提案する。ロボットの物理的制約により再現可能な動作は低周波数なものになってしまうことから、陰影映像投影により、不足している高周波数な動作を重畳することで、極めて印象的な顔表情を再現することを可能とした。...",
        "link": "https://www.disneyresearch.com/publication/augmenting-physical-avatars-using-projector-based-illumination/",
        "collaboration": "Disney Research Zürich [<a href='https://www.disneyresearch.com/' target='_new' class='research-link'>HP</a>]との共同研究"
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/layout.jpg",
        "titleJP": "プロジェクションされたAR情報の最適レイアウト",
        "titleEN": "View Management of Projected Labels on Non-Planar and Textured Surfaces",
        "publication": "IEEE TVCG 2013, ISMAR 2013",
        "abstract": "実物体の表面に直接仮想情報を重畳させるプロジェクション方式を採用する。投影型複合現実感においてアノテーションの提示を行う際には、アノテーションのレイアウトを行う際に留意すべき点に加え、投影型アプローチ特有の問題を考慮しなければならず、特に投影面の状態により投影像の可読性が大きく低下するという問題が大きい。...",
        "link": "http://daisukeiwai.org/jp/research/layout.html",
        "collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/3DSDR.jpg",
        "titleJP": "3D高ダイナミックレンジ投影",
        "titleEN": "High Dynamic Range 3D Display System with Projector and 3D Color Printer Output",
        "publication": "ISMAR 2011",
        "abstract": "本研究では、3次元のハイダイナミックレンジディスプレイを提案する。我々は、立体視の手法を用いるのではなく、カラー3Dプリンタ出力模型に、印刷されているのと同様のテクスチャをプロジェクタから投影して光を二重変調することで、3次元立体面上でのハイダイナミックレンジ表示を実現する。...",
        "link": "http://daisukeiwai.org/jp/research/3DSDR.html",
        "collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/sonic.jpg",
        "titleJP": "インタラクティブ本棚",
        "titleEN": "Interactive Bookshelf Surface for In Situ Book Searching and Storing Support",
        "publication": "Augmented Human 2011",
        "abstract": "我々は，身近な実物体表面をインタラクティブサーフェス化することで，広範囲の日常活動を支援することができると考え，本論文では，本棚をインタラクティブサーフェス化し，収納された文書の探索および収納を支援することを提案した．...",
        "link": "http://daisukeiwai.org/jp/research/IBS.html",
        "collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/momo.jpg",
        "titleJP": "プロジェクション映像の焦点ボケ補償および影除去",
        "titleEN": "Dynamic Defocus and Occlusion Compensation of Projected Imagery by Model-Based Optimal Projector Selection in Multi-projection Environment",
        "publication": "Virtual Reality 2011",
        "abstract": "複数台のプロジェクタを使用する投影型複合現実感環境において, プロジェクタ・投影対象の幾何学的情報に基づき, 対象上で影のない鮮明な投影像表示を実現する多重焦点制御手法について述べる。 ...",
        "link": "http://daisukeiwai.org/jp/research/multiprojection.html",
        "collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/SDR.jpg",
        "titleJP": "高ダイナミックレンジ投影",
        "titleEN": "Superimposing Dynamic Range",
        "publication": "ACM TOG 2008, Siggraph Asia 2008",
        "abstract": "我々は、反射型画像変調により、シンプルかつ安価な静止画HDRディスプレイを実現した。...",
        "link": "http://daisukeiwai.org/jp/research/SDR.html",
        "collaboration": "Bauhaus-Universität Weimar, Germany [<a href='http://www.uni-weimar.de/medien/AR/' target='_new' class='research-link'>HP</a>]との共同研究"
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/ThermoReality.jpg",
        "titleJP": "ThermoReality: サーモグラフィープロジェクション",
        "titleEN": "Optical Superimposition of Infrared Thermography through Video Projection",
        "publication": "Infrared Physics & Technology 2010",
        "abstract": "熱情報を媒介する特殊な波長域である遠赤外領域の光を捉えることのできる赤外線カメラは、対象物体の温度情報を非接触で2次元画像として可視化することが可能であり、これまで検査・医療・災害救助といった分野での利用がなされてきている。...",
        "link": "http://daisukeiwai.org/jp/research/thermoreality.html",
        "collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/LimpidDesk.jpg",
        "titleJP": "LimpidDesk: 机上書類の透明化プロジェクション",
        "titleEN": "Limpid Desk: See-Through Access to Disorderly Desktop in Projection-Based Mixed Reality",
        "publication": "Virtual Reality 2011",
        "abstract": "机上に積み重ねられた書類に関して、下層の書類の映像をカメラで取得し、あたかも上層の書類が透明になるように処理した映像を、投影型複合現実感技術の色補正処理を施しつつ、上層の書類へプロジェクタ投影するシステム\"Limpid Desk\"を提案する。...",
        "link": "http://daisukeiwai.org/jp/research/limpiddesk.html",
        "collaboration": ""
    },
    {
        "theme": "projector-camera system",
        "photoPass": "images/researches/ThermoPainter.jpg",
        "titleJP": "ThermoPainter: 熱で絵を描くペインティングインタフェース",
        "titleEN": "Heat Sensation in Image Creation with Thermal Vision",
        "publication": "ACE 2005",
        "abstract": "コンピュータでの描画作業において、マウスとペンしか用いることができないのは直感的でないことに着目し、筆などの道具をそのまま用いてコンピュータ上に描画できるインタフェースの研究を行った。薄い紙面に暖かいものが触れたときの面上の温度変化をサーモグラフィで取得し、接触領域の位置を計測するという方式を提案した。...",
        "link": "http://daisukeiwai.org/jp/research/thermopainter.html",
        "collaboration": ""
    },
    {
        "theme": "user interfaces",
        "photoPass": "images/researches/dance.jpg",
        "titleJP": "日本人と南米人の踊りのノリ",
        "titleEN": "Analysis and Synthesis of Latin Dance using Motion Capture Data",
        "publication": "Journal of ITE 2011",
        "abstract": "クラブなんかに踊りに行くと、踊っているシルエットを見るだけで、その人が日本人なのか他の外国の人なのかがわかる。この違いは、どこにあるのかを調べようと思って、同じクラスの留学生と始めた研究。留学生の子が南米人ということもあって、とりあえず日本人と南米人で調べることに。...",
        "link": "http://daisukeiwai.org/jp/research/dance.html",
        "collaboration": ""
    },
    {
        "theme": "user interfaces",
        "photoPass": "images/researches/nonverbal_top.jpg",
        "titleJP": "共感覚（音と色のノンバーバルマッピング）",
        "titleEN": "Non-verbal Mapping between Sound and Color - Mapping Derived from Colored Hearing Synesthetes and Its Applications",
        "publication": "ICEC 2005",
        "abstract": "映画やテレビ番組、そしてWebデザインなどの映像作品に対して、それに合う音楽をつけるという作業は、その道のエキスパートでさえも困難なものである。しかし、ひとたび合う音楽がつけば作品の魅力は2倍にも3倍にもふくれあがる。このことから、映像に合う音楽を抽出するルールを生成することで、このような創造活動を支援する...",
        "link": "http://daisukeiwai.org/jp/research/synesthesia.html",
        "collaboration": ""
    }
]
