[
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/kawahara.png",
        "titleJP": "投影輝度向上および利用者との衝突回避を目指したプロジェクタドローンの動的配置",
        "titleEN": "研究者: 河原　拓海",
        "publication": "論文種別・提出年: 卒業論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "近年，プロジェクションマッピング（Projection Mapping: PM）が注目を集め，プロジェクタを利用した複合現実感技術に関する研究が進められている．一般的に，エンタータイメント用に行われているPMは主に建築物のような静止した物体に投影される．しかし，人や車などのように移動する物体への拡張を考える場合，投影対象が自由に動いている場合でも投影像が対象に位置合わせできることが重要となる．動的なPMにおいては，プロジェクタを環境に固定して投影する方法と，プロジェクタを移動させて投影する方法がある．環境に設置する場合の利点は，目的の位置にずれなく安定して投影できることであるが，投影対象の移動可能な範囲が制限されてしまい，移動可能な範囲を広げるため複数のプロジェクタを用いる必要がある．一方，プロジェクタを移動させて用いる方法は，利用者がプロジェクタを持ち運び，手のひらや本などの身の回りのものに投影し，情報提示をする研究がなされている．この場合，プロジェクタの設置場所に制約を受けることなく，利用者の周りであれば投影が可能である．しかし，投影範囲が利用者の周りに限られてしまうことや，プロジェクタが利用者の活動を妨げてしまうという問題がある．        上述の問題点を解決するため，空間を自由に動くことのできるドローンにプロジェクタを搭載することが提案されている．これにより従来，投影品質を保つことが困難であった高所への投影も可能となり，プロジェクタの投影範囲が広がることが期待できる．しかし，飛行時に投影像が振動すること，積載可能なプロジェクタの制限による投影輝度の低下で投影像が鮮明でなくなること，利用者のドローンとの接触による危険性などの問題が起きる．本研究では，プロジェクタをドローンに搭載した場合における投影輝度の問題について解決するため，利用者との衝突を考慮し，輝度を向上させる位置へドローンを配置する.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/sato.png",
        "titleJP": "複数台のパンプロジェクタを用いたハンドヘルド型投影システム",
        "titleEN": "研究者: 佐藤　貴俊",
        "publication": "論文種別・提出年: 卒業論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "近年, プロジェクタを用いた複合現実感に関する研究は盛んに行われている. プロジェクタを用いて, 仮想空間の情報を実世界に重畳することにより, 仮想世界と実世界を融合させることで. 実物体の存在感を失うことなく, 質感や色彩などの見えを変化させることができる. また, 近年, プロジェクタの小型化が進んでおり, 安価で軽量かつ高性能なプロジェクタが生産されており, スマートフォンなどのモバイル機器への搭載も実現している. スマートフォンなどの携帯端末は, プロジェクタが搭載されることで, どこにいても大きな画面を提示することができ, 大画面で動画を鑑賞したり, 複数人で同じ画面を共有することができるなど様々な場面で有用である. そのため, 今後, 手で持ち運び可能な投影システム(以降, ハンドヘルド型投影システム) が普及していくことが見込まれる.         プロジェクタの小型化に伴って, ハンドヘルド型投影システムに関する研究は盛んに行われてきた. 従来の研究では, 主に幾何補正技術に焦点が当てられていたが, 本研究では別の問題として, 投影範囲と投影輝度のトレードオフに着目する. 投影範囲と投影輝度のトレードオフとは, 投影対象とプロジェクタの距離が近づくと, 投影輝度は上がるが, 投影範囲は狭くなってしまうという現象である. 光量が少なく投影範囲が狭い小型プロジェクタを用いたハンドヘルド型投影システムにおいては, このトレードオフを適切に調整することが極めて重要となる.        そこで, 本研究では, 複数台のプロジェクタの投影方向をミラーを用いて変化させ, ユーザが適応的に投影範囲と投影輝度を変更可能なハンドヘルド型投影システムを提案する. 提案システムによって, 小型の投影システムであっても, 広範囲に投影可能であり, 高画質の映像を提示することができると考えられる. ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/tanabe.png",
        "titleJP": "仮想手操作における非操作手への触覚呈示に関する研究",
        "titleEN": "研究者: 田辺　育暉",
        "publication": "論文種別・提出年: 卒業論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "私たちは自分の手を介して様々な対象に干渉して生活をしている．対象が自分の手の届く範囲内にある場合は，不便なくその対象に働きかけることができる．しかし，対象が自分の手が届く範囲外にある場合はその対象に手が届く位置まで自身が移動する必要がある．こうした制約を解消するインタフェースとして，投影バーチャルハンドを介して遠隔対象に対しても自分の手で対象を直接扱うかのように働きかけることのできるExtendedHand がある．本研究ではこのExtendedHand を使用する．中でも，投影バーチャルハンドの操作に普及の進んだスマートフォンを用いたシステムを利用する．        しかし，現行のExtendedHand では投影バーチャルハンドの視覚情報しか得られず，自分の手で得られる感覚である触覚を得ることができない．そのため，実物体に干渉する場合において，ExtendedHand で得られる感覚と自分の手で得られる感覚には差が生じている．そこで，インタフェースにおける触覚フィードバックの重要性から，ExtendedHand に触覚フィードバックシステムを組み込む．バーチャルハンドを操作する手（操作手）に触覚フィードバックを返す研究が行われている．しかし，操作手に触覚フィードバックを返すシステムには，操作部とフィードバック部を統合することによって機構が複雑になる点やフィードバックデバイスを装着する手間がある点といった問題がある．        そこで，本研究では非操作手に触覚フィードバックを返すことで上記の問題を解決するとともに，ExtendedHand において投影バーチャルハンドを操作していても自分の手で実環境に触れているかのようにすることを目指す．自分の手で実物体に干渉する際は操作する手にフィードバックが返ってくるため，非操作手に触覚フィードバックを返した際にユーザが実物体に触れた感覚が得られるのかどうかは明らかになっていない．そのため，ユーザがExtendedHand を使用して実物体に干渉した際に，実物体に干渉した感覚が得られるかを調査する必要がある．本研究の目的は，ユーザがExtendedHand を使用して実物体に干渉した際に非操作手に触覚フィードバックを付与し，ユーザが実物体に干渉した感覚が得られるかを調査することである．        ExtendedHand を使用して投影バーチャルハンドが実物体に触れた際に非操作手に触覚フィードバックを付与し，ユーザが実物体に触れた感覚が得られるかを調査する実験を行った．実験の結果，用意した触覚フィードバックにおいては，触覚フィードバックを付与しない時に対し，付与する場合はユーザは実物体に触れた感覚が増す傾向にあることが分かった．また，ExtendedHand において投影バーチャルハンドが実物体に触れた際に非操作手に触覚フィードバックを付与する場合に，非操作手の遮蔽や非操作手と左右が同じバーチャルハンド（非操作手バーチャルハンド）の追従が実物体に触れた感覚が増す要因となるかを調査する実験を行った．実験の結果，ユーザに実物体に触れた感覚を呈示できる可能性があるのは遮蔽があるときであると考えられる．一方，非操作手バーチャルハンドの追従により実物体に触れた感覚を向上させるには被験者に非操作手バーチャルハンドを追従させるか選択させることがよいと考えられる．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/tone.png",
        "titleJP": "投影対象内の導光路を同時３Ｄ印刷するアクティブマーカによる動的プロジェクションマッピング",
        "titleEN": "研究者: 刀根　大樹",
        "publication": "論文種別・提出年: 卒業論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "近年, 現実世界に仮想世界を融合させる複合現実(Mixed Reality: MR) が注目されており,プロジェクタを用いるMR としてプロジェクションマッピング(Projection Mapping) がある. プロジェクションマッピングとは, 現実世界の物体に仮想映像を重畳投影することで, 物体表面の質感や色などの見た目を変化させる技術である. プロジェクションマッピングでは投影面が非平面であるため, 投影像を投影対象に合わせる幾何補正が必要となる. 動く物体を投影対象とする動的プロジェクションマッピングでは, 投影対象が動くたびにカメラ画像や加速度センサの情報から位置姿勢を推定しなければならない.         位置姿勢推定の方法の一つとして, 投影対象にマーカを設置する手法がある. カメラで認識されたマーカを, 予め保存されたマーカの三次元座標データベースと対応づけすることで位置姿勢を推定する. この手法では, マーカの対応を取得するためにマーカから特徴量を抽出する必要があるが, マーカに特徴量を持たせるためにはマーカを大きしなければならない.そのため設置できるマーカの最大数に制約が課され位置姿勢推定精度に影響が出てしまう.         そこで, 本研究では時間変化によりID を情報を表現するアクティブマーカを用いる手法を提案する. データの表現が時間による変化であるため, マーカの大きさを小さくしつつ特徴量を埋め込むことができる. 提案手法では, マルチマテリアル3D プリンタを用いてマーカと投影対象を同時に印刷することで, マーカ設置の手間を省き, さらにマーカ設置位置のずれによる位置姿勢推定の誤差を解消している.         第1 章では, 複合現実感やプロジェクションマッピングについての説明と, 動的プロジェクションマッピングの関連研究, そして3D プリンタによる導光路印刷について述べ, 本研究の目的を明らかにする. 第2 章では, 3D プリンタでアクティブマーカを同時印刷する手法と, アクティブマーカを認識し位置姿勢推定する提案手法を述べる. 第3 章では, アクティブマーカを認識するために必要な投影対象モデルの設計方法を, マーカ認識実験を通して検討する. 第4 章では, 第3 章で作成したモデルに対して位置姿勢推定し, 正しい投影像が取得できるか実験して, 結果を考察する. 最後に第5 章で本論文の結論を述べる.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/mine.png",
        "titleJP": "非平面プロジェクションにおける画素密度均一化のための光路透明層の形状最適化",
        "titleEN": "研究者: 峯　隆太郎",
        "publication": "論文種別・提出年: 卒業論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "近年，現実世界の情報と，仮想世界の情報を融合させる複合現実感が非常に注目されている．複合現実感を実現する技術のうち，プロジェクタを用いた投影型の複合現実感では，ユーザが特別なデバイスを装着することがなく投影像を変化させることで現実世界の物の色や質感などを変化させることができる．しかし，プロジェクタは光軸に対して垂直に設置された平面の投影対象を想定して設計されているため，一般的に三次元物体に対する投影では01投影画素密度が空間的に偏り，均一な解像度の投影結果とならない．そこで本研究では，リアプロジェクション方式を採用し，投影面下に3D プリンタで印刷した透明層を埋め込み，投影像を空間非一様に屈折させて投影面の画素密度を均一にすることを提案する．        提案手法を実現するために，投影を行いたい領域に密度均一な画素配置を行い，プロジェクタの各画素との対応関係を求めた後，その対応を実現できる屈折面の構成を行う．画素密度が均一な投影を行うためには，投影面上に配置されている密度が不均一な画素を画素密度が均一になるよう再配置する必要がある．各画素に対し，理想の距離に近づくよう距離に応じた引力と斥力を設定し，各画素を力の働く方向へ移動させる．画素に働く力が平衡状態になるまで移動させることで任意形状における均一な画素配置を求める．また，プロジェクタの画素全体において，なるべく少ない光路の変形で目標の均一画素配置が実現できるように最小コスト輸送問題を解く．画素密度均一に配置された各目標画素と投影光の各画素の対応を求めるために，補正を行わない投影光路と目標画素座標との距離を変形を行うコストとして用いる．加えて，制約条件として屈折可能な角度の制約と輝度低下の制約を設けることで，屈折面によって実現することが可能な範囲内における対応関係の中で最適解を求めた．また，投影光全体が想定した屈折を実現できるように，屈折面形状の最適化を行う．分割した屈折面によって各画素の光路の変形を行い，画素密度均一に配置された目標画素と，投影光の画素との対応関係を実現する．この分割した屈折面を結合することで，透明層の屈折面を生成する．各分割面の結合の際に，段差が大きい結合をしてしまうと屈折面表面において投影光の損失が発生してしまため，分割面全体が段差を抑えて結合できるように最適化を行う．加えて，隣接する面の間をベジェ曲面によって補間することで，異なる法線を持つ面同士をなめらかに結合する．        提案手法に基づき，画素密度均一化を実現することができる透明層の設計を行い画素密度均一化の評価を行う．また，投影物体を実際に作成し投影を行うことで，提案手法の有効性を確かめた．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/takezawa.png",
        "titleJP": "工業製品意匠設計における投影型拡張現実技術を用いた表面質感変調および視覚形状変形に関する研究",
        "titleEN": "研究者: 竹澤　拓郎",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2017.",
        "abstract": "工業製品意匠設計において，現行プロセスでは，二次元スケッチ，三次元CAD を用いた設計，モックアップ制作の工程を最終決定がなされるまで何度も行われており，時間とコストがかかることが問題となっている．また，工業製品の表面質感は製品がユーザに与える印象において重要な役割を果たす．現行プロセスでは素材サンプルを一つずつ比較検討する必要があるが，意匠設計過程でモックアップ全体で異なる表面質感を検証することは難しく，また素材サンプルがない表面質感を検証することができない．そこで仮想現実技術や複合現実技術を用いた工業製品意匠設計支援に関する研究開発が行われている．これらの研究では時間とコストを現行プロセスよりも削減し，様々な色，形状のデザインを検討することがきる．しかし，HMDを用いたシステムではデバイスの装着による不快感が懸念され，ディスプレイ上に表示するシステムではディスプレイの解像度の制約があるため，表面質感の表現に限界がある．そこで本研究では投影型拡張現実技術を用いて，視覚形状変形（明暗，コントラスト，陰影などの光学的な情報や隠蔽関係，遠近法などの幾何学的な情報から心理的記憶的に奥行を知覚するための情報をモックアップに重畳表示することで，見かけ上の形状変形する）を行う．また，投影によってモックアップの表面質感を変調させる．        本論文ではそれを実現するシステムを提案し，そのシステムを使用した動作確認実験として，視覚形状変形がどの程度実際に変形しているように感じるか（知覚形状変形度合）と視覚形状変形のための視覚刺激によって投影対象の表面質感変調が見られるかを調査する．また，製品の実際の使用環境を想定して環境光として木漏れ日を投影によって再現し，それが表面質感変調を引き起こすかを調査する．まず，視覚形状変形としてキャラクタラインを想定した視覚形状変形を行い，次に空間的連続変形と不連続変形の2 種類の視覚刺激とそれぞれに対する環境光の有無による知覚形状変形度合と表面質感変調を評価した．実験の結果として検証した深度-15mm から15mm のキャラクタラインでは意匠設計支援の有用性が示唆された．視覚形状変形では連続変形より不連続変形の方が知覚形状変形度合が大きく，粗さの項目で知覚形状変形度合が確認されない場合でも仮想空間内の変形後物体がもつ表面質感が知覚される傾向が見られた．さらに，環境光による表面質感変調も見られた．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/aoki.png",
        "titleJP": "視温覚融合投影インタフェースにおける視覚刺激に対する温覚刺激の設計",
        "titleEN": "研究者: 青木 芽衣",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "複合現実感インタフェースにおいて，複数の感覚に対して情報を呈示するマルチモーダルシステムが注目されている．マルチモーダルシステムでは，単一の感覚器官に対して情報を 呈示するよりもユーザに多くの情報を呈示することができるため，インタフェースの操作性の向上や，仮想物体のリアリティ向上につながる．最近では，視覚と触覚に情報を呈示するシステムの研究が盛んに行なわれている．従来の視触覚呈示方法には，ユーザが触覚呈示デバイスに触れたり，装着したりすることで触覚刺激を得る方法が多い．一方で，デバイスを把持したり装着したりすることなく，空気圧や超音波，熱放射を利用して触覚刺激を非接触で呈示する手法も提案されている．著者は，触覚の中でも特に温覚に着目し，ユーザの身体へ非接触で任意の場所に視覚情報と温覚情報を同時に呈示可能な，視温覚融合投影インタフェースを構築した．        視温覚融合投影インタフェースは，熱を持つ仮想物体を，3 次元空間で視覚的・温覚的にユーザに知覚させるために使用することを想定している．可視光プロジェクタから仮想物体の映像をユーザの身体へ投影し，同時に赤外光プロジェクタから投影像の位置に合わせて熱を照射する．しかし，赤外光プロジェクタの空間分解能の低さや，人間の温覚の応答速度の低さから，呈示された視温覚刺激が空間的に整合しない場合がある．すると，ユーザは知覚した投影像と熱を関連付けることができなくなり，熱を持つ仮想物体を知覚することが困難になる．        そこで本研究では，視温覚融合投影インタフェースにおいて，視覚刺激と温覚刺激の間に生じる空間的不整合を考慮した上で，ユーザに熱を持つ仮想物体を表現することを目的とする．実験では，様々な形状や動きをする視覚刺激と，強度の異なる温覚刺激を組み合わせて被験者の身体へ呈示し，それぞれの視温覚刺激に対して適切さ(調和度・実在感・好ましさ)を評価させた．実験の結果，提案インタフェースに設けるべき視温覚刺激に関する制約と，呈示された視覚刺激に対する適切な温覚刺激の呈示方法を得ることができた．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/asayama.png",
        "titleJP": "マーカを同時印刷した3Dプリンタ出力を対象とするビジョンベースの三次元物体位置・変形推定",
        "titleEN": "研究者: 浅山 弘孝",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": " 「3DCAD(Three-Dimensional Computer Assisted Design)や3DCG(Three-Dimensional Computer Graphics)などといったデータをもとに三次元物体を造形する機器として3Dプリンタがある.近年, この技術の発展により樹脂材料から金属材料などといったさまざまな材料を用いて高精度な印刷を行うことが可能となっている.そのため, 航空・宇宙・自動車などで使用される産業機器用の部品やインプラントなどの医療材料への利用などさまざまな分野への応用が期待されている.本研究では,その応用の一つとして複合現実感に注目する。機械 精度での画像マーカの印刷や事前シミュレーションによるマーカ設計の最適化などを行うことができるという点で, 3Dプリンタ技術は複合現実感における位置・変形推定という技術 課題を解決するアプローチの一つとなったと言える.本稿では,以下の二つの問題に対する提案とその結果について述べる。        提案手法では投影対象に対して,位置推定のための画像マーカを遺伝的アルゴリズムによって計算された最適な位置に印刷する.プロジェクションマッピングの際には,投影色補正によってマーカを隠消して投影結果の画質を向上させる.さらに,この位置推定とマーカ隠消という二つの技術課題と3Dプリンタの印刷方式を考慮した最適なマーカ設計の指針を提案する.        非剛体物体の変形推定への応用について述べる.非剛体物体を対象とする複合現実感の例として, 医療分野における臓器を対象とした血管などの情報提示が挙げられる.この際、適切な位置に適切な情報を提示するためには,対象の位置姿勢だけでなく変形も推定する必要がある.提案手法では,対象物体内部にドットマーカを印刷し,魚眼カメラによって内部から変形を推定する.推定方法としては,変形に応じて変化するドットマカの動きを機械学習の一つであるランダムフォレストを用いて行う、学習に使用するデータを, 印刷する3Dモデルデータを用いたシミュレーションによって作成することで, データ作成のコストを削減する. ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/ueda.png",
        "titleJP": "タブレットと投影仮想手による身体のサイバー拡張-Tablet-based ExtendedHand-",
        "titleEN": "研究者: 上田　雄太",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "手を用いた行動は我々の生活には欠かせない．我々は，ジェスチャによる対象の選択や場　所の指示，直接物に触れての操作，触覚による物の状態の把握，握手のような身体接触による交流など多くの場面で手を使用する．一方，身体的制約から，手を効果的に利用できる状況は，対象が手の届く近くの範囲にある場合に限られ，我々は手の届かない対象にポインタやリモコンを用途に応じて使用してきた．しかし，ポインタでは手のジェスチャのような表現に乏しく，リモコンでは手で直接物を操作するような動きでの入力ができない．また，各機器は個別に使い分けられ，統合的に手の役割を担う物では無い．そこで，本研究では，手の模倣物によって手の役割を統合的に代用し，身体性の高い表現や操作を遠くの対象にも可能とすることを目指す．        本研究では，プロジェクタから手のCG を投影し，その像を実手の動きで操作することで，手の投影像を介して遠くの対象に働きかける手法を提案する．従来の手のCGの操作には，没入感を重視して，装着の必要なデータグローブや手にマーカを貼り付けるモーションキャプチャが使用されてきたが，本研究では，日常的な場面でのシステムの使用を想定し，使用に際する準備が少なく，一般的に普及したデバイスであるタブレット（スマートフォンも含む）を操作機器に使用することを提案する．システムの設計については，学術的なデモ展示発表を通じて評価を収集し，改善を繰り返した．手の像の操作は，移動，手先の回転，指の曲げ，指差し，把持などが可能である．本研究ではネットワークを介して複数台のスマホで複数の手の像を操作できるシステムと，タブレット1 台で必要な処理が完結し，他のシステムへの組み込みが容易であるシステムの2 種類を実装し，デモ発表を通じて各々の実証実験を行った．現在，これらを応用した会議支援や福祉システムの研究が進められており，提案システムの多方面での応用が考えられる．実証実験では，手の像の動きとサイズに関する指摘を得た．このため，手の像の動きを，ユーザとの接続を保つような動きに改善した．さらに，接続性の保たれない，壁に手の像を投影する状況においては，その手の像の出現位置とサイズに関する被験者実験を行った．この結果，右手モデルの場合は投影範囲外の右下から投影ハンドを出現するように設定すべき，など今後の設計の指標となるユーザの傾向を得た．さらに，手の像をより実手の代わりに扱えるよう，コミュニケーションだけでなく，実環境中の物体の選択や操作にも使用できるような機能とシステムの実装も行った．        本稿では，タブレットで操作する投影ハンドを介して手の届く範囲を拡張する技術を提案し，その実現可能性と身体拡張技術の応用性の高さを，システムや機能の実装によって示す．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/kitajima.png",
        "titleJP": "光センサを用いたレーザプロジェクタの走査計測に基づく位置・姿勢推定",
        "titleEN": "研究者: 北島　友喜",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "投影型複合現実感技術は，複数の利用者が機器を装着せずに，実環境と仮想空間を統合した世界を共有できる技術である．この技術応用として，プロジェクタを実物体に向けることで，実物体の表面質感を変化させたり，アノテーション等の付加情報を物体位置にぴったり合わせて重畳表示するプロジェクションマッピング（Projection Mapping; PM) がある．プロジェクションマッピングでは，プロジェクタと実物体の相対位置が変化する動的な環境でも投影像と実物体が位置がずれずに，焦点ボケ等の画質劣化がないことが理想である．        実物体と投影像の位置合わせのためには，カメラやその他のセンサ（磁気式，超音波式，光学式など）を用いて，プロジェクタに対する投影対象の相対的に位置・姿勢を推定し，変形した画像をプロジェクタから投影する必要がある．カメラを用いる既存手法は，投影対象を遠隔から撮影した際に得られる画像特徴量から位置・姿勢を計算するが，投影対象の模様や形状や照明環境に大きく依存して精度が落ちてしまうことや，プロジェクタ-カメラ間の座標位置合わせ誤差の影響強く受ける欠点がある．またその他のセンサを用いる場合においても，環境中に金属や鉄筋等が存在する状況では精度が落ちること（磁気式）や，環境中に等間隔に受信機を配置する必要があり設置コストが高いこと（超音波式），所望の画像を鮮明に投影できなくなる欠点がある．        そこで，本研究では動的なPMにおける位置合わせ技術として，レーザプロジェクタと光センサの受光タイミングに基づく対象の位置姿勢推定手法を提案する．本手法ではレーザプロジェクタを用いるため，小型の装置で焦点合わせが不要という利点に加えて，提案する手法の特徴として計測のためのパターン光なしに，連続的に対象を追跡できる利点がある．        本稿では，提案した手法と作成したシステム，精度評価実験，アプリケーションについて示す．特にアプリケーションでは，ライトペン，マジックレンズ，プロジェクタドローン，動的プロジェクションマッピングシステム，マルチプロジェクタの幾何キャリブレーションシステムなどの複数の応用システムを作成し，提案手法の有効性を示したことを報告する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "images/researches/yoshiyama.png",
        "titleJP": "符号化間歇照明による照明識別を利用した昼間化画像処理",
        "titleEN": "研究者: 吉山　仁望",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2017.",
        "abstract": "危険な場所や，狭い場所，水中など，人間が直接向かって作業を行うことが困難な場所での調査・探索活動において，遠隔操作ロボットの利用が増加している．遠隔からロボットを利用して，周囲の状況や調査対象を観察する際，カメラから得られる映像が，オペレータにとって重要な役割を果たす．一方で，電力の供給が停止した災害現場，床下，水中洞窟など，暗所におけるロボットの利用もしばしば見られ，そのような暗所における作業においては，カメラから周囲を視認可能な映像を取得することは困難である．本研究では，環境中に点滅点灯する間歇照明を配置することで，低消費電力に周囲を広範囲に照らすことを可能にする．ただし，間歇照明を利用する際に発生する照明の点滅が，オペレータの操作の妨げとなることが考えられる．そこで，間歇照明下の映像を基に，ロボットを操作することを目標に，画像処理により点滅点灯の影響を軽減し，視認性の高い映像を生成することを目指す．        本研究では，間歇照明下で撮影した低輝度と高輝度の領域がフレーム毎に異なる画像列から，現在フレームにおける低輝度領域を過去フレームの対応する高輝度領域を探索して補間することで，常に照明が点灯しているかのような画像列を生成する，``昼間化画像処理手法'を提案する．各間歇照明には，固有の点灯パターンを持たせることで，照明の識別・位相合わせを行い，現在フレームにおける点灯状況を推定し，点灯状況に応じた合成処理を可能とする．撮影に用いるカメラは，遠隔操作ロボットに搭載することを想定しており，合成する画像間では，被写体とカメラの位置・姿勢が異なることが予想されるため，カメラの移動を考慮したうえで昼間画像を合成する．提案手法の動作を確認するシミュレーション実験により，識別・位相合わせから入力画像の照明点灯状況を正しく推定可能であること，更に目視により真値画像列と類似した昼間画像列を生成できることを確認した．また，入力画像列と昼間画像列それぞれの真値に対するPSNR/SSIMをそれぞれ比較した結果，昼間化を行うことで，平均PSNRおよび平均SSIMが向上することを確認した．実機実験においては，識別・位相合わせの動作確認と実環境における昼間化の課題を考察した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "sensor network",
        "photoPass": "images/researches/imakawa.png",
        "titleJP": "照度変動に起因する無意識的行動に基づく快不快推定",
        "titleEN": "研究者: 菊川 剛",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2016.",
        "abstract": "生産年齢人口の減少・インターネットの普及に伴い, 知的生産性の向上が持続的経済発展を実現する上での課題となっている．知的生産性向上させるため, 室内環境を一人一人の体調や嗜好に合わせて自動制御することが望まれる．このようなシステムを構築する上で, 人の心理状態の推定手法が現在問題となっている．人の心理状態を推定する研究は従来から行われているが, 高精度かつ実システムへの応用が可能な推定手法は確立されていないのが現状である．本論文ではより高精度な心理推定を実現するため, 新たなアプローチとして, 人の心理状態と無意識的行動の相関性に着目する．人の心理状態と無意識的行動に関する研究成果は複数報告されており, 無意識的行動を測定することで, より高精度な快不快推定を行うことができると考える．本論文では, 人のデスクワーク作業中における環境に対する快不快推定を想定し, 机上面照度分布を微小変動させることで人の無意識的行動を誘発する．照度微小変動に伴う無意識的行動の快不快状態推定の有効性を検証するため, 以下の項目の検証を目的とする．        1.照度変動に伴う無意識的行動の快不快状態に依存する変化の分析        2.無意識的行動変化に基づいた快不快推定精度      1.では, 検証に用いるデータを取得するため, デスクワーク中に照度変動を行う実験を行い, その際の行動変化を眼電位計, 座圧計, モーションキャプチャを用いて計測した．計測の結果, 照度微小変動直後において, 被験者の快不快状態による行動変化が観測された． 2.では, センサから観測されたデータから, 快/不快状態を識別する識別器を構築した．各センサデータから算出した特徴量ベクトルで構築した識別器に入力し, 識別器の性能を評価した．評価実験の結果, 最大でF-Measure=0.86を達成し, 高精度な快不快推定を行える可能性が明らかになった．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/aoyama.png",
        "titleJP": "重畳投影パターンの手に対する相対速度変調による力覚の操作",
        "titleEN": "研究者: 青山 宗太",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2016.",
        "abstract": "近年，複合現実感環境において視覚刺激のみを用いた疑似的な触力覚フィードバックを提示する研究が行われており，その提示には Pseudo-Haptics と呼ばれる錯知覚が利用されている．Pseudo-Haptics とは，固有受容感覚 (自分が身体を動かす感覚) と視覚情報との間で不整合が生じた際に，人間の脳の特性により，視覚情報が優先されることで実際には存在しない触力覚を知覚する現象のことである．Pseudo-Haptics を利用した研究の多くでは視覚情報提示デバイスとして，遮蔽型HMD(Head Mounted Display) や二次元ディスプレイなどが用いられている．しかし，それらにはディスプレイの解像度の低さや視野角の制限による疲労感や提示範囲の狭さといった問題がある．それらの問題を解決するために，プロジェクタを用いて実世界にリアルタイムで視覚情報を提示する手法が考えられるが，プロジェクタによる視覚刺激提示を用いた Pseudo-Haptics の研究はあまり行われていない．        そこで本研究では，プロジェクタを用いた視覚情報の提示により Pseudo-Haptics を生起させ，力覚を操作することに注目する．従来研究から，HMDや二次元ディスプレイによる視覚情報提示では，操作対象の速度を変調させることで疑似力覚の提示が可能であるという知見が得られている．この知見を利用し，ユーザが動かしている手にドットパターンの重畳投影を行い，ドットパターンの手に対する相対速度を変調させることで，ユーザの力覚にどのような影響があるのか調査し，分析することを目的とする．調査の結果，投影パターンの相対速度を大きくすることで，実際の力をより小さく知覚することがわかった．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/izawa.png",
        "titleJP": "適応的フォーカススイープ投影によるプロジェクタの被写界深度の拡張",
        "titleEN": "研究者: 井澤 英俊",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2016.",
        "abstract": "プロジェクタを用いた複合現実感(Mixed Reality:MR) では仮想空間の映像を実空間に投影することで, 仮想空間と実空間を光学的に重畳させるため特別なデバイスを身に着ける必要がなく, 現実感や臨場感の高い複合現実感を提示することができる. そのため, 娯楽・医療・教育など様々な分野で応用可能であり, これからの発展が期待されている. しかし, プロジェクタは投影像の明るさを保つために大きな開口を持ち, それにより投影像の焦点の合う領域（被写界深度）が狭くなってしまう. それゆえ, 一定の奥行き幅を持つ 三次元物体にプロジェクタで投影を行った場合, 焦点の合っていない領域が生じてしまい, 投影像の品質を著しく落としてしまう.        この問題を解決するために, 焦点を光軸方向に振動させる技術であるフォーカススイープをプロジェクタに適用することで, 視覚的に被写界深度を拡張する研究が行われた. この手法では, 焦点を常に同じ波形で振動させ, 投影する画像に補正を加えることで, 被写界深度を拡張させている.  ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/asai.png",
        "titleJP": "バーチャルハンドインタフェース搭載型車椅子のタッチ操作における機械学習による操作対象の推定",
        "titleEN": "研究者: 浅井 唯貴",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2016.",
        "abstract": "人間の手は表現力に富んでおり，コミュニケーションにおいてその表現力は自身の意図や目的を相手に正しく伝えるほか，相手に理解を促す補助としての役割を担っている．それは物事の指示であったり，物体の形状の伝達であったり，意思や関係性の伝達など様々な形で存在する．しかし車椅子の使用者の場合は，自身の手を用いてコミュニケーションを取ることができる範囲が制限される．なぜなら車椅子の使用者は，車椅子に座しているために手で直接操作できる範囲が狭くなるためである．また，車椅子が移動や旋回を行うのに十分な空間的余裕が無い場合，車椅子を移動させることができず対象に対して手が届く位置まで移動して対象を手で直接操作するといった動作を行えないことも挙げられる．ゆえに，車椅子の使用者には，手が届かない遠隔対象に対しても手を用いたコミュニケーションを可能とする手段が必要である．そこで，遠隔対象に対しても自身の手で対象を直接扱うかのような働きかけを可能とするバーチャルハンドインタフェースの一つである，ExtendedHandシステムを車椅子に搭載することを提案する．ExtendedHandでは，プロジェクタによって人間の手を模したCGモデル(バーチャルハンド)を実世界上に投影し，遠隔対象に干渉する際にバーチャルハンドを自身の手の代用として使用する．本研究ではタブレット端末を使用してバーチャルハンドを操作可能なExtendedHandを車椅子に搭載し，プロジェクタ投影されたバーチャルハンドを操作することによって，手を用いてコミュニケーション可能な範囲を拡張する．それと同時に，一つのタブレット端末を使用して車椅子とバーチャルハンドを共に片手でタッチ操作することができるように，車椅子の操作部を改造し，無線モジュールを介入させて車椅子とタブレット端末を無線接続させる．しかし，これによってタッチ操作の対象が二つ存在することになるため，ユーザがタッチ操作する際に操作対象を切り替える必要がある．その切り替え手法は，ボタンスイッチのような，ユーザに不要な動作が生じない手法が望ましい．そこで本研究では，車椅子とバーチャルハンドを操作する際に操作対象によってタッチパネルに接触する指の接触面積に差異が生じると仮定し，指の接触面積を機械学習させることでユーザが望む操作対象を自動で推定する手法を提案し，その推定精度を検証する．また，提案手法を用いて車椅子およびバーチャルハンドの操作対象の推定が可能であるか検証するために，指の接触面積を入力とした機械学習による操作対象の推定システムを実装し，操作対象の推定実験を行い，正しく推定できることを確認した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/enomoto.png",
        "titleJP": "複数人利用時のバーチャルハンドに対する識別と所有感覚",
        "titleEN": "研究者: 榎本 龍一",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2016.",
        "abstract": "身体拡張型インタフェースとは，人間の身体を擬似的に拡張することで自分の身体を扱うように操作が可能なインタフェースである．身体拡張型インタフェースは操作対象に自分の身体に類似したモデルを使用することで，操作対象を自分の身体のように感じさせ，仮想物体に対して直感的な操作を可能にする．投影型の身体拡張型インタフェースであるExtendedHandはカメラなどのセンサを用いてユーザの手の動きを認識し，それに応じてプロジェクタから投影されるバーチャルハンドを動作させることによりユーザの手先をその移動方向に疑似的に伸ばすことができるインタフェースである．今後このインタフェースが普及し，複数人で使用する状況が想定できる．本研究では複数人でExtendedHandを使用する状況を想定し，会議等でバーチャルハンドを互いに操作してコミュニケーションを行う状況について考える．同じ色や形状のバーチャルハンドが表示されている中で，自分が操作しているバーチャルハンドに対して，「このバーチャルハンドは自分が操作している」という操作対象が自己に帰属する感覚(所有感覚)の生起の有無について調査を行った．また，所有感覚の生起しやすさについて，バーチャルハンドとポインタとの間の有意差の存在の有無について調査を行った．調査のため実験参加者には，ディスプレイ上に表示されている複数のバーチャルハンドの中から自分が操作できる唯一のバーチャルハンドを捜すタスクを行わせ，タスクに要した時間を計測した．計測の結果，バーチャルハンドに対して所有感覚が生起することが確認され，また所有感覚の生起までの時間についてポインタとの間に有意差が見られた．この結果から，操作対象の見た目をバーチャルハンドからポインタに変えたことでユーザの感覚に違いが生まれ，バーチャルハンドの方が所有感覚の生起が早い傾向にあることが推測された．一方で他者から見たときに「バーチャルハンドが誰に操作されているのか」が一目でわかるようにするため，ユーザ位置からバーチャルハンドを進入させる機能を，ユーザとバーチャルハンドの幾何整合性を利用して実装した．システムの評価実験を行った結果，10度前後の誤差で推定することができた．また実験参加者の感想から，表示するバーチャルハンドが右手であるか，左手であるかによって誤差に対する感覚が変化することが推測された．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/okutani.png",
        "titleJP": "視覚的形状操作において実物体表面質感を毀損しないステレオ投影に関する研究",
        "titleEN": "研究者: 奥谷 凪",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2016.",
        "abstract": "製品デザイン工程では，クレイモデル等のモックアップを何度も試作し，最終的なデザインの決定を行う手法が主流であるが，モックアップの作成に費用や時間がかかってしまい 効率的とは言い難い．モックアップ製作数を減らすべく，近年では複合現実感(MR :Mixed Reality) 技術を用いた様々なデザイン支援システムの研究が行われている．そのなかでもプロジェクションマッピング（PM: Projection Mapping）により，実物体を視覚的に形状操作するステレオ投影技術は，製品の「ボリューム感」や「味わい」などを損なうことなく製品デザインプロセスを効率化することが期待できる。しかし，プロジェクタの空間解像度およびダイナミックレンジには限界があり，映像のみでシボ等の表面質感の高品位な再現は困難である．シボ等の表面質感は高級感やソフト感などの感性品質の要因の一つであり，製品デザインにおいて重要である．        そこで本研究では，プロジェクタを用いたデザイン支援システムにおいて，高解像度な表面質感の表現を可能とすることを目的とする．従来の投影型デザインシステムのように白色実物体に表面質感情報を投影するのではなく，表現したい表面質感を持つ実物体を投影対象とすることで，その質感を保持しつつ実物体の形状を操作する手法を提案する．さらに提案手法により，視覚的形状操作後も表面質感が保たれているようにユーザが知覚することを実験的に確認した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/nakamura.png",
        "titleJP": "移動ロボットへのプロジェクションマッピングによる動き補正",
        "titleEN": "研究者: 中村 萌",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2016.",
        "abstract": "近年，介護用ロボットや医療用ロボット，サービスロボットなど人のそばで働くロボットが発展している．これらのロボットは介護施設や医療施設だけではなく家庭での使用も想定されているが，一般家庭に普及するには未だ高価である．自然で滑らかな動きを実現するために高価なアクチュエータを使用していることがその理由の一つである．ロボットが自然な動きをしつつ安価であれば，高価なロボットよりも一般家庭に普及しやすいと考えられるため，ぎこちないロボットの動きを緩急のある自然な動きに見せるため，複合現実感技術のひとつであるプロジェクションマッピングを用いて見た目の速度を変調することを考える．多くのプロジェクションマッピングは明るい場所での使用に適していないが，静止画を動いているように見せた変幻灯は比較的明るい場所での使用も可能である．この変幻灯の技術を用いて静止画ではなく移動するロボットの見た目の速度を変調することが本研究の目的である．提案手法としては，移動ロボットの位置姿勢をカメラ画像より推定し，現在位置画像と目標位置画像の輝度の差分を移動ロボットに投影することで見た目の速度補正を行う．移動ロボットにマーカーとして再帰性反射材を取り付け，照射し反射された赤外線をカメラ画像処理によって認識することで移動ロボットの位置姿勢推定を行う．実験では,等速で直進するまたは加速する移動ロボットに加速・減速方向の投影をし，テクスチャの輝度差分の投影の場合最高 65%の減速効果，50%の加速効果，ランダムドットパターンの投影の場合最高60%の減速効果，35%の加速効果を確認した．結果としてテクスチャの輝度差分の投影によって，等速または加速するルンバの速度を半数以上のある割合で実際よりも遅くまたは速く見せることができた．またずれの変位が同じ場合概ねランダムドットパターンの投影よりもテクスチャの輝度差分の投影がより補正効果があることがわかった．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "images/researches/sakano.png",
        "titleJP": "瞬き・サッカードを用いた非知覚画像計測手法",
        "titleEN": "研究者: 城野 亮",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2016.",
        "abstract": "計測技術の一つに画像計測がある．画像計測ではカメラを用いて，計測対象の画像を取得することにより物理量の計測を行う．計測の手法は大きく二つに分けられ，カメラのみを用いる手法を受動的手法と呼ぶ．対して，カメラ以外に光源を使用し，対象物に光を照射し画像を取得する手法を能動的手法と呼ぶ．能動的手法を用いると，一般に受動的手法に比べ精度良く物理量を計測することができる．能動的手法は，光源に不可視光を用いるものと可視光を用いるものに分けられる．不可視光は人間には知覚できないため，計測時に人間の作業を妨げることがないという利点がある．そのためビデオゲームの入力デバイスや，モーションキャプチャー等の，人間がいる環境で測定を行う際に用いられている．一方，可視光の場合は人間に知覚されるため，人のいる環境では作業を妨げる可能性がある．そのため人間がいる環境下では不可視光を用いることが望ましいが，不可視光では計測が困難であり，可視光を用いた計測がより適している物理量が存在する．そのような物理量には可視光に対する光沢や透過率等の光学特性がある．それらを計測する際は，人間の作業を阻害しながら，対象を計測することになってしまう．例えば，デスクワーク中にデスク上の書類の計測を行う場合などが考えられる．そこで本研究では，人間に知覚されずに可視光を照射し作業を阻害せずに計測を行う手法を提案する．        人間に知覚されないようにするために，本研究では瞬きとサッカードの際に発生する知覚能力の低下に着目する．瞬きの際には，瞼に光が遮られるため視覚が遮断される．サッカードの際にはサッカード抑制と呼ばれる知覚能力の低下が発生する．この二つの生体運動を利用するために，それぞれの運動を検出するシステムを実装し，それぞれの運動時の知覚低下の程度を実験により計測し，分析した．そして，その結果に基づき照射する可視光のパターンを決定し，瞬きとサッカード中にパターンを照射し非知覚に画像計測を行う手法を提案する．        更に，サッカードを用いて，非知覚に可視光透過率を計測する実証システムを構築した．そして，システムの評価実験の結果から，非知覚に可視光の照射を用いた透過率の計測に成功した．透過率を得ることで，紙の厚さの分布や，重なっている部分等を得ることができる．結果より正弦波格子で計測することが可能な他の物理量の計測にも，応用が可能であることが考えられる．また，瞬きを利用することでどのようなパターンを照射する場合でも，非知覚に照射することが可能であることが示唆された",        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "sensor network",
        "photoPass": "images/researches/yoshikawa.jfif",
        "titleJP": "ユーザ状態推定のためのアンビエントセンシングシステム",
        "titleEN": "研究者: 吉水　健悟",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2015.",
        "abstract": "近年，コンピュータの小型化やセンサ技術の発達に伴い，腕時計型センサや衣服等に装着する小型センサなどのウェアラブルセンサが普及し，人間が機械を利用するたけでなく，機械が能動的にユーザ状態を推定しサポートを行うシステムが実現されつつある．しかし，ウェアラブルセンサは装着の煩わしさがあるため，環境中に埋め込んだセンサを用いた，ユーザに身体的負荷を与えないセンシング技術であるアンビエントセンシングが実システムでの使用上望ましい．        アンビエントセンシングによるユーザ状態推定に関する課題として，センサの電力源に関する課題と，単一センサシステムに関する課題が存在する．電力源に関して，近年バッテリが多く用いられている．バッテリ駆動の場合，バッテリの交換や充電が必要であり，多数のセンサが生活空間に介在させるような環境においては，それら多数のセンサを管理する負担は無視できない．一方，単一センサシステムに関して，センサが内蔵されたペンのようなモノ埋込型センサの場合，常にそのセンサを使用しているとは限らないため単一センサのみでは限界がある．また，ユーザの状態は個人差やその時の状況によってさまざまであるため，多岐にわたるユーザ状態を安定して推定するためには複数のセンサを用いるマルチセンサシステムが有効であると考えられる．        本研究では，これら2 つの課題を解決するため，エナジーハーベスト技術による環境発電で生成された電力のみで駆動し，ユーザの行動推定が可能なエナジーハーベスト型アンビエントセンシングシステムおよび，複数のアンビエントセンサからユーザの快不快状態を推定するマルチセンサベースアンビエントセンシングシステムを提案する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/kanamori.png",
        "titleJP": "投影型複合現実感における視覚的な接触対象の変形および身体の平行移動による形状知覚操作",
        "titleEN": "研究者: 金森 俊雄",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2015.",
        "abstract": "現実空間と仮想空間をリアルタイムで重ね合わせる複合現実空間(MR: Mixed Reality) において，視覚刺激のみを用いて疑似的に触力覚を提示する研究が行われている．その提示にはPseudo-Haptics と呼ばれる視覚-力触覚間に発生する錯知覚が利用されている．Pseudo-Haptics とは，視覚と力触覚との間に不整合が生じた際に，視覚による情報が優勢になるという脳の特性から，力触覚に錯覚が生じる現象のことである．現在では，Pseudo-Haptics を用いた視触覚システムの大半では，実装する複合現実感方式として遮蔽型HMD (Head Mounted Display) や二次元ディスプレイなどを使用するビデオシースルー方式を用いている．しかし，視覚情報をプロジェクタより実世界上に重畳する投影型MR を用いた力触覚フィードバック提示については，定量的な評価や議論は現在でもあまり進んでいない．        そこで本研究では，これまで十分な調査が行われていない投影型MR におけるPseudo-Haptics に着目する．投影型MR において，映像で提示する物体の形状およびユーザの手先の運動軌跡を変調させることによって，実物体の形状に対する知覚を変化させることが可能であるかどうかを実験的に検証することを目的とする．具体的には，実際の物体に触れているユーザの手の動きを検出し，それに同期させて，手先の映像をユーザの実際の手先位置からずらして異なる形状の物体に触れている映像を重畳投影することによって，視覚情報と力触覚情報との間に不整合を生じさせる手法を提案し，形状知覚に与える影響を実験で検証した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/shinmei.png",
        "titleJP": "投影型上腕拡張UIにおける触覚フィードバック?",
        "titleEN": "研究者: 新明 拓也",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2015.",
        "abstract": "タブレット端末やスマートフォンなどのタッチ入力インタフェースの普及により，ユーザは操作したい対象に直接手で触れることで対象の操作が可能になった．以後，このような操作を直接的な入力と呼ぶ．一方で，一般的なタッチ入力インタフェースには手元にタッチパネルが無ければ入力を行うことができないという距離的な制約がある．距離的な制約を持たず，タッチ入力のように直接的な入力が行えるインタフェースの一つに，身体拡張ユーザインタフェースがある．身体拡張ユーザインタフェースとは，ユーザの身体が疑似的に拡張(伸びる，大きくなるなど)された視覚表現を呈示することにより，ユーザに対して自分の身体が拡張されたかのような感覚を与え，ユーザの身体が直接届かない場所にある操作対象に対してもユーザが直接的な入力を行えるインタフェースである．しかし，これらのインタフェースは，入力によって得られるフィードバックが視覚から得られる情報のみである．そのため，ユーザから遠い位置での作業や，視覚的に遮蔽がある場合，インタフェースの位置把握が難しくなる．このような問題を解決し，身体拡張ユーザインタフェースの操作性を向上させるためには，視覚以外のフィードバックをユーザに与える方法が考えられる．特に，触覚フィードバックをユーザに呈示することで操作性を向上させる研究は数多く行われており，その効果が示されている．触覚フィードバックを付与することで，ユーザが操作をしているもの(ポインタ・カーソルなど)の位置を認知するサポートを行うことができ，さらに，操作したい対象が定まっていれば，対象までの距離に応じた触覚フィードバックを与えるなどの工夫を行うことで，対象の周辺までの移動を早めることができるため，操作したい対象の周辺への到達時間が短くなると考えられる．そこで本研究では，身体拡張ユーザインタフェースに触覚フィードバックを付与することで，これらの問題を緩和する．        本研究の目的は，距離的な制約を解消し，直接的な入力を行うことができる身体拡張ユーザインタフェースに，触覚フィードバックを付与することで，視覚的な問題を解消でき，ユーザにとってより扱いやすいインタフェースの設計指針を示すことである．そのため，実際に様々な種類の触覚フィードバックをユーザに呈示する身体拡張ユーザインタフェースを構成し，どのような触覚フィードバック要素が実際に物体に触れている感覚に有効であるのかを調査する．また本システムは，机の上や部屋の中に多くの物体があるような一般的な実環境における実装を想定しているため，環境に応じた触覚フィードバックを呈示したい．そこで，環境のセンシングを行い，環境の変化にも対応できるシステムを構築する．構成した実験システムを用いて，各触覚フィードバック要素がユーザへ与える影響を調査するための心理実験を行い，考察を行い，知見を得た．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "",
        "titleJP": "移動体への投影を考慮した複数台プロジェクタドローンの投影輝度最大化のための配置の動的最適化",
        "titleEN": "研究者: 細溝 仁人",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2015.",
        "abstract": "今日，ドローンは輸送・撮影・災害調査を始め，多方面で活躍し始めている．また，法整備が進み始めたことで，今後の更なる市場の発展が期待されている．近年では，ドローンの柔軟な移動能力を活かした映像提示デバイスが提案されている．例えば，タブレット端末を搭載したものやプロジェクタを搭載したもの（以下，プロジェクタドローンと記す）が提案されており，公共ディスプレイやモバイルプロジェクタとしての役割を担うことが想定されている．また，これらは複合型現実感(MR : Mixed Reality)技術との親和性が高く，MR技術を利用したサービスの提供も可能となることが期待できる．例えば，歩行者への情報提示や移動体に追従しながらの投影などが考えられ，固定式のディスプレイやプロジェクタと違い，移動を伴う使用に柔軟に対応可能となることが考えられる．その中でもプロジェクタドローンは，現実世界へのCG(Computer Graphics)の重畳表示が可能かつ小型の機器でも大画面を提示できる利点を持つ．しかし，プロジェクタドローンはまだ研究の緒についたばかりの段階にあり，投影時の映像の揺動，投影輝度の低さとそれに伴う投影距離の制限による投影範囲の縮小が課題として挙げられる．映像の揺動を抑制する手法はこれまでにも提案されてきたが，輝度の低下や投影範囲の縮小を解決するアプローチは未だ提案されていない．        本研究では，プロジェクタドローンの投影輝度の低下と投影範囲の縮小に対する課題解決 のためのアプローチを提案する．具体的には，複数台のプロジェクタドローンによる投影範 囲の拡大とそれらの配置を投影輝度に関して動的に最適化する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/matsukage.png",
        "titleJP": "遠隔教育用共有机上に投影された対話者腕の方向一致によるソーシャルプレゼンス強化",
        "titleEN": "研究者: 松蔭 瞭",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2015.",
        "abstract": "代表的な遠隔教育メディアであるテレビ電話では対話者非言語情報の欠落が生じるため，対話者の非言語情報や作業内容を机上に投影して双方向に共有する遠隔共有机の研究が行われている．従来の遠隔共有机では，対話者の作業内容やジェスチャを共有するために，遠隔地の机上映像をもう一方の机上に投影する．そのため，互いの机上の書面の位置関係が同じでなければ机上の状態と投影内容の位置的整合性が崩れてしまう問題がある．さらに，ディスプレイ上遠隔対話者と対話者腕（机上に投影された対話者のハンドジェスチャ）の方向的不整合から生じる遠隔対話者ソーシャルプレゼンス（対話者が実在しているかのような意思疎通の円滑さ）低下が考慮されていない．ソーシャルプレゼンス強化は心理的距離縮小や参加促進など，教師や学習者に多くのメリットを与える．そこで本研究では，ディスプレイ上対話者から対話者腕が伸びてくる遠隔書類座標系共有机を提案することで，上述の二つの問題にアプローチした．机上状態と投影内容の不整合に対しては書類座標系に基づく机上共有を提案することで従来の遠隔共有机の机上書面位置関係の制約を解消し，異なる作業環境間においても位置的に整合された机上共有を実現した．ソーシャルプレゼンス低下に対してはディスプレイ上対話者と対話者腕の方向的整合を提案することで遠隔対話者のソーシャルプレゼンス強化を図り，提案モデルと実寸大ディスプレイ環境の組み合わせによりCo-presence が強化(p < 0:01) されることを確認した．さらに環境に依存せず提案モデルがAttentional allocation (p < 0:01), Affective understanding (p < 0:01), Affective interdependence (p < 0:05), Behavioral interdependence (p < 0:01), Partner Reality(p < 0:01) を強化することを確認した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "",
        "titleJP": "Expression Manipulation: Changing Facial Expression with Projection Mapping",
        "titleEN": "研究者: Stanley Mah",
        "publication": "論文種別・提出年: テクニカルレポート, Aug. 2015. ",
        "abstract": "Through the use of projectors and computer algorithms, we are able to change the perceived image of a persons face. This is done through a method called projection mapping, which, in a very basic definition, is projecting an image onto an object to change the appearance of the object. For this particular research, the focus will be on facial expressions. The origin of this study came from the “OMOTE/REAL-TIME FACE TRACKING & PROJECTION MAPPING” project who's goal was to express “[beauty] and [make-up art] instead of technological gimmicks and impacts” that projection mapping can create. The project was the first of its kind and so many things had to be created from the ground up, such as a sensor capturing program to capture sensors placed on the face and processing the sensor positions to map CG rendered images to the face using a projector. What was important for the project members was to be able to convey a message through a rich facial expression while allowing the user to be able to move around freely.         The goal the my study developed was to determine how effective projection mapping is when trying to change a person's perceived facial expression and what are the effects of mixing two different facial expressions together. While mixing different facial expressions together in preliminary testing, it was found that using the same person's face caused little to no difference to the expression so the studies focus was more towards mixing expressions of different people. ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/takeda.jpg",
        "titleJP": "非平面投影システムにおける投影面反射率パターンの反復修正に基づく相互反射抑制手法",
        "titleEN": "研究者: 竹田　翔一",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2015.",
        "abstract": "仮想現実感(Virtual Reality: VR) の分野では，プロジェクタを利用した投影システムに関する研究が盛んに行われている．その中でも，高コントラスト投影表示は，重要な技術課題の一つである．平面対象物とは異なり，非平面対象物への投影については，投影面間で発生する相互反射(高次の拡散反射光) を考慮する必要がある．相互反射により，本来表示されるべき画像とは異なり，不自然に明るくなった画像が表示される．これを解決するためさまざまなアプローチが提案されてきたが，プロジェクタのダイナミックレンジが有限なために，完全に相互反射補償を行うことはできていない．そこで本研究では，非平面投影システムにおける相互反射抑制効果を，従来よりも大きくすることを目的とする．そこで今回，本研究ではフォトクロミズム(Photochromism) と呼ばれる現象に着目した．フォトクロミズムは，光刺激によってある化合物の状態が可逆的に変化する現象のことを呼ぶ．光刺激には紫外線等の短波長光が用いられ，吸収波長帯も材料ごとに異なり，その変色の種類もさまざまである．本研究では，紫外線を照射すると無色から黒色に変色する性質を持つフォトクロミック化合物を，白色の布地に塗布したものを投影対象として用いることで，投影面反射率の変調を可能とした．フォトクロミズムを利用することで投影面反射率を空間的に変調させる，平面対象物への高コントラスト投影表示のための新たな手法は，すでに提案されている．一方で，フォトクロミズムを利用した非平面対象物への高コントラスト投影表示手法は，未だ提案されてはいない．よって本研究では，フォトクロミズムを利用した非平面対象物への高コントラスト投影表示手法を提案する．具体的には，投影光と投影面反射率パターンの二つの反復修正によって，高コントラスト投影表示を行うシステムを提案する． ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/takeuchi.jpg",
        "titleJP": "Visuo-Thermal Projector: 視覚と温覚に対する非接触情報提示インタフェース",
        "titleEN": "研究者: 武内　真梨奈",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar. 2015.",
        "abstract": "温覚は，仮想空間への没入感や仮想物体の現実感を高める重要な感覚である．仮想空間において，仮想物体の温度を再現してユーザに提示することができれば，仮想物体がより自然なものとして知覚されると考えられる．我々は，視覚情報に加えて温覚情報を提示することができるインタフェース「Visuo-Thermal Projector」を構築した．Visuo-Thermal Projector は，熱をもつ仮想物体を，3 次元空間で視覚的および温覚的にユーザに知覚させることを想定している．可視光プロジェクタから仮想物体の視覚情報をユーザの身体に投影し，同時に赤外光プロジェクタから仮想物体の温覚情報を投影する．このとき，提案インタフェースが提示する視温覚刺激の対応が，実空間で熱をもつ物体に触れたときに与えられる視温覚刺激の対応と同じように整合していれば，熱をもつ仮想物体があたかも実在しているかのように，違和感なくユーザに知覚されると考えられる．一方で，提示する視温覚刺激の対応に不整合が生じると，ユーザに熱をもつ仮想物体を自然に知覚させることができなくなる可能性がある．さらに，提案インタフェースは視覚情報と温覚情報を同時に提示するため，クロスモーダル錯覚が生じると考えられる．そのため，提案インタフェースにおいて生じるクロスモーダル錯覚が，ユーザが知覚する視温覚刺激の対応に与える影響も考慮する必要がある．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/asayama.jpg",
        "titleJP": "動的プロジェクションマッピングにおける投影対象の位置姿勢推定のための3Dプリンタ出力へのマーカ埋め込み",
        "titleEN": "研究者: 浅山　弘孝",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar. 2015.",
        "abstract": "複合現実感技術の一つに，色や形状のある三次元物体に投影を行うプロジェクションマッピング(PM) がある．PMでは，投影対象の色や形状に合わせて投影画像の補正を様々に行うため，投影対象の位置や姿勢などを測定する必要がある．この測定は投影対象が動く度に行わなければならないので，PMの投影対象は静的な物体であることが多く，動的な物体を対象としたPMは少ない. 以上のことから，本研究では動的な物体へのPMに注目する．従来の動的PMの位置姿勢推定手法は，投影対象にマーカを取り付ける手法と取り付けない手法に分けられる．前者には，追跡が行えるように投影対象は緩やかな動きに限られるという制約があり，後者においては，マーカを手作業で貼付することが多いため，手間に加えて誤差が発生して推定精度が低下する可能性がある．そこで，本研究では動的PM における位置姿勢推定のために，あらかじめ3D モデルにマーカを埋め込み，3D プリンタで投影対象を作成する手法を提案する．3D モデルに対するマーカの埋め込み，および3D プリンタによる投影対象の作成は，マーカ取り付けの手間と誤差を削減することや，事前のシミュレーションによって位置姿勢推定が正しく行えるようなマーカ配置を自動的に見つけることを可能にするといった利点がある．また，3D プリンタのフルカラー印刷技術により，マーカの色の濃さを自由に変えることが可能である．そのため，色を薄くすることで，プロジェクタの投影によって観測者からマーカを視認できなくすることが可能である．提案手法では，そのようなマーカの色を決定し，任意の方向から安定に位置姿勢推定ができるマーカ配置を遺伝的アルゴリズムによって自動的に算出する．この提案手法による動的PM の実現を本研究の目的とする．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "",
        "titleJP": "形状特徴を利用した矢穴石の自動断面位置合わせ",
        "titleEN": "研究者: 森多 花梨",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2015",
        "abstract": "考古学において，分割された状態で出土する遺物破片同士を接合する作業は過去の生活様式や文化などを考察するための重要な作業である．しかし，その作業は目視や手作業に頼る部分が大きく，しかも一度の発掘で出土する遺物は非常に大量であるため，手作業のみでは非常に多くの時間と労力を要する．そこで，計測により取得した遺物の三次元形状データをコンピュータ上で自動的にマッチングさせることで作業の効率化を行う．矢穴石も石材同士の接合関係を調べることでその製作過程や分割技法などが推測されている．矢穴石とは，石材を製作する過程において掘られる矢穴と呼ばれる穴を持つ石のことであり，近世城郭の石垣に用いられる割り石に多く見られる．本研究では，この矢穴石を遺物復元の対象として扱う．また，将来的には，遺物の形状や情報を登録するデータベースと自動復元手法を組み合わせることにより，より広範囲に散らばった破片からでも遺物の復元を行うことができるようになると考えられる．本研究ではそれの要素技術として，データベースの中に接合が予想される2つの石材が存在するときに，その石材の断面を自動で位置合わせする部分を扱う．        矢穴石の断面位置合わせでは，従来研究で利用されているような表面の模様の連続性や外形の情報を用いることは困難であるため，提案手法では他の特徴として矢穴の情報を用いる．矢穴は，石材断面の端に位置し，その大きさと形状はほぼ一定であるという特徴がある．また，対応する石材の破断面を接合させたとき，対応する矢穴は同じ位置に存在する．提案手法では，矢穴の上記のような特徴を破断面を位置合わせするときの対応の手がかりとして利用する．         提案手法は矢穴検出，断面抽出，初期位置推定，多重解像度ICP アルゴリズムによる細かい位置合わせの処理からなる．矢穴検出の処理では，局所領域における法線方向の分布を特徴量としてSupport Vector Machine により判別を行う．その検出した矢穴位置から，矢穴を持つ断面部分のみを石材データから抽出する．次に，検出した矢穴の位置とその向きから断面の位置合わせのために初期位置推定を行う．その初期位置から多重解像度ICP アルゴリズムを用いることで矢穴石の自動断面位置合わせを実現する．実際の矢穴石を計測して取得した三次元形状データを使用した実験により，矢穴を利用して矢穴石の自動断面位置合わせが行えることを確認した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "images/researches/alparslan.jfif",
        "titleJP": "Reconfiguration of Pan-tilt-zoom Cameras（パン・チルト・ズームカメラの視線制御に関する研究）",
        "titleEN": "研究者: Yildiz Alparslan Omer",
        "publication": "論文種別・提出年: 博士論文，大阪大学大学院基礎工学研究科，Mar．2015．",
        "abstract": "This dissertation describes methods and improvements on controlling Pan-tilt-zoom (PTZ) cameras for human tracking. It begins by dening the control of PTZ cameras as a decision problem and formulating the corresponding problem as a Bayesian risk minimization. Further improvements are developed by employing historical information, multiple time-step estimations and online decision making for multiple cameras.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "images/researches/wakabayashi.jfif",
        "titleJP": "赤外画像からのパッチベース可視光画像生成",
        "titleEN": "研究者: 若林　悠",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2015．",
        "abstract": "赤外カメラで取得した単一チャネルの画像を明るい環境で取得した可視光画像のようにカラー化することで、視認性を改善することができる．しかし，従来は赤外画像に対しどのように色を与えるかという部分に着目し，生成する可視光画像の輝度成分を推定していないため，可視光画像に存在しないテクスチャの発生や存在するはずのテクスチャの欠落，輝度の反転などの劣化が生じるという問題があった．そこで本研究では，同一シーンにおける異なる視点のカラー画像を参照画像として与えることで，合成する可視光画像の輝度成分と色差成分をそれぞれ推定し，赤外画像と同一視点での上記劣化の少ない可視光画像を生成する手法を提案する．        提案手法は，色差成分の推定と比較して、輝度成分の推定により重きを置いている．一度，合成する可視光画像の輝度成分が推定され，この可視光画像と参照カラー画像の対応が得られれば，参照カラー画像の色差成分の情報を合成する可視光画像に容易に割り当てることができるからである．輝度成分の推定では，推定する輝度成分の全体構造は赤外画像と整合性を保ち，微細なパターンは参照カラー画像を基に構成することを考え，赤外画像に対する大局的な類似性と参照カラー画像に対する局所的な類似性を最大化するよう，エネルギー最小化の枠組で推定する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "images/researches/satos.jfif",
        "titleJP": "偏光カメラ画像を用いた未知環境の映り込みに頑健な光沢物体のリアルタイム三次元姿勢推定",
        "titleEN": "研究者: 佐藤　博俊",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2015．",
        "abstract": "画像中に写った剛体の三次元姿勢を推定する技術には，AR やVisual Servo 技術等の多くの応用例がある．近年，携帯情報端末機器の普及やロボットの家庭環境や公共空間といった一般的な環境への進出により，AR やVisual Servo 技術が一般の環境で実現可能であることが求められるようになってきた．一般的な環境には，コンピュータビジョンにとって都合の良い光沢性の無い物体だけでなく，光沢性の強い物体が数多く存在しており，光沢物体の周囲には様々な物体が散乱していることも想定される．こうした環境では光沢物体の表面に映り込みが生じ大きく見た目が変わるため，画像のみからそうした物体の姿勢を認識するのは本質的に難しい問題となる．制御されていない一般的な環境で剛体の三次元姿勢を推定するためには，未知の環境の下，受動計測で取得した単一カメラの画像を利用する手法が最も汎用性が高い．従来，物体に映り込む像を利用する手法が複数提案されてきたが，いずれも周囲の環境が静止しているか他のカメラ等で周囲の環境を逐一取得されていることが前提であった．        本研究では，対象物体の三次元モデルが与えられているという条件で，画素単位で偏光情報が取得可能な偏光カメラにより得られる動画像から，環境の情報を使用することなくリアルタイムで安定に，光沢性の有無に関わらずに剛体の三次元姿勢を安定に推定可能な手法の開発を目的とする． ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "images/researches/yoshiyamak.jfif",
        "titleJP": "間歇的照明下における動きベクトル推定を用いた昼間化画像処理",
        "titleEN": "研究者: 吉山　仁望",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar．2015．",
        "abstract": "危険な場所や狭い場所のように人間が直接足を運ぶことが困難な場所に，センサを取り付けたロボットを送り込むことで調査を行うという事例が増えつつある．遠隔操作を行うユーザにとって，周囲の状況や，調査対象の様子を視認するためには，視覚センサであるカメラからの映像が重要になる．暗闇においては，周囲を視認可能な映像を取得することができない．本研究では点滅点灯する間歇的照明を用いることで，低消費電力で長時間周囲を照らすことを可能にする．ただし，間歇的照明を用いると，照明の点滅がユーザの操作の妨げとなると考えられる．本研究では，間歇的照明下の映像を基にロボットを操作することを目標に，点滅点灯の影響を軽減し，視認性の高い映像を生成することを目指す．本研究では，間歇的照明下で撮影した低輝度と高輝度の領域がフレーム毎に異なる画像列から，2 枚の異なる画像において，それぞれの高輝度領域を合成することで，それぞれの画像中で点灯している照明が，同時に点灯しているような画像を生成する昼間化手法を提案する．撮影に用いるカメラは，遠隔操作ロボットに搭載することを想定しており，2 枚の画像間では被写体の位置や姿勢が異なることが予想される．そのため，カメラの移動を考慮した上で昼間画像を合成する．提案手法では，まず現在フレームの直前の高輝度領域を持つ画像から，現在フレームの画像への被写体の動きベクトルを算出し，現在の画像中の被写体の位置を推定する．次に，2 枚の画像の動きベクトルを基に，画像間で同じ被写体を写している領域を求め，より高輝度の領域の輝度値を用いて低輝度領域を補間することで昼間画像を生成する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "digital achieve",
        "photoPass": "images/researches/morita.jpg",
        "titleJP": "加工痕を利用した分割遺物の自動マッチング",
        "titleEN": "研究者: 森多 花梨",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2014.",
        "abstract": "考古学において,発掘された遺物の元の形状を知るために遺物復元は重要な作業の一つである.しかし,現状の遺物復元は手作業による部分が大きいため,復元には多くの時間と労力を費やすことに加え,実際の遺物を使った復元では作業中に遺物が損傷する恐れもある.そこで,遺物を計測して得た三次元形状データを用いて遺物の形状を復元することが考えられる.本研究では,特に遺物復元における破片の接合面のマッチングを扱う. 提案手法は,加工痕の検出,初期位置推定,ICP アルゴリズムの大きく 3 つの処理に分かれる.まず,入力された遺物の三次元形状データから加工痕を検出する.加工痕は石材表面の他の部分に比べ平らであり,面積がほぼ一定であるという特徴を利用し,法線を用いた領域拡張法を適用することで加工痕の検出を行う.次に,検出した加工痕の位置から,断面の位置合わせのために初期位置を推定する.その初期位置から ICP アルゴリズムによって断面の位置合わせをすることで分割遺物の自動マッチングを行う.この ICP アルゴリズムでは,より正しい位置合わせを行えるよう,対応点間の距離と法線を用いて不要な対応関係の除去を施した.実際の遺物を計測して取得した三次元形状データを使用した実験により,加工痕を利用して分割遺物の自動マッチングが行えることを確認した.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "sensor network",
        "photoPass": "images/researches/yoseda.jpg",
        "titleJP": "着座搖動の無拘束計測による心理状態推定とコミュニティ検出を用いた多人数会話解析",
        "titleEN": "研究者: 綿谷 亮",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2014.",
        "abstract": "コミュニケーションを改善することで,日常生活や業務をより円滑にしようとする取り組みがますます強まっている.改善に向けた現状把握を目的に,コミュニケーションを自動で定量解析する試みが近年行われてきた.しかし,そのほとんどが人間の身体や意識を拘束する手法を用いており,コミュニケーションを阻害する可能性があることから,自然な振る舞いを適切に解析しているとは言い難い.そこで,本研究では,ユーザを拘束しない手法において,コミュニケーションを自動で定量化する椅子システム (アンビエントセンシングチェア) の開発を行う.特に,集団の同調傾向を用いた個人の心理状態の推定と,位置関係の情報を用いない会話コミュニティの検出に関して取り上げ,実環境におけるアンビエントセンシングチェアの有効性を検証する.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/ohara.jpg",
        "titleJP": "前腕の伸張表現と重畳投影による身体拡張型ユーザインタフェース",
        "titleEN": "研究者: 岡原 浩平",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2014.",
        "abstract": "仮想オブジェクトを操作する手法の代表例としては,マウスポインタのような操作対象を用いてポインティングを行う手法があげられる. しかし, マウスを用いた入力手法にはデバイスを把持しなければならないという煩わしさや,ポインタを介しての操作であるため,直接的とは言い難いといった欠点がある.デバイスを介在させない入力インタフェースとして, 最も直観的に対象に働きかけることができると考えられるのは身体そのものであり, 身体の動きを情報入力に適用することでデバイスに制限されない自在な操作が可能となる. また, このような入力インタフェースに加えて, 出力インタフェースに身体のモデルを利用することが考えられる. 操作対象が身体モデルであることにより, ユーザはマウスポインタのような形状の操作対象と比べて, より直観的に操作することが可能になる.        本研究では,人間の手の拡張である仮想の手 ”Extended Hand” を机や壁面に投影し, これをユーザの手指の動きを用いて仮想オブジェクト等の操作を行うユーザインタフェースを提案する. また, ユーザの手が伸びたかのように見せる Extended Hand の伸張表現の実装を行う. これにより, ユーザは仮想の手である Extended Hand をより自分の身体のように感じ, 仮想オブジェクトに対して, 直接的な操作が行えることが考えられる. 操作性および身体の拡張感の生起を確認するために行った被験者実験においては, 被験者の主観評価アンケートにより, マウスと比べても劣らない操作性と操作対象を自らの身体のように感じる身体の拡張感が生起したことを示唆する結果を得た. ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/tanaka.jpg",
        "titleJP": "複数台プロジェクタの投影結果推定に基づく画質劣化最小化手法",
        "titleEN": "研究者: 田中 章文",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2014.",
        "abstract": "投影型複合現実感 (Projection-based mixed reality, MR) の技術は,プロジェクタの小型化・低価格化が進んでいることによってより広く扱われるようになってきている.しかし,投影型 MR には,プロジェクタと投影対象間に他の物体が入ることで,投影対象に影ができてしまったり,プロジェクタと投影対象との距離・角度によって投影結果が本来表示したい投影目標に比べて画質劣化してしまったりするなどの欠点がある.そこで近年,複数台のプロジェクタを用いてこれらの問題を解決する手法や,この手法を用いた場合における投影結果の精度を向上させる手法が提案されている.         本研究でもこれらの研究同様,複数台のプロジェクタを利用する.そして,投影面をポリゴンという小領域に分割し,各ポリゴン上で各プロジェクタの各画素が投影面上でどのようにボケるかを表す点拡がり関数 (PSF : Point Spread Function) の計算などを用いて最終的に投影像が,各投影面のポリゴン上でどのような投影結果になるかを推定し,本来の投影目標画像と比較することで,最も投影目標に近い投影結果を得られるプロジェクタをポリゴン毎に選択する手法を提案する.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/mihara.jpg",
        "titleJP": "フォーカススイープ投影によるプロジェクタの Depth of Field の拡張",
        "titleEN": "研究者: 三原 翔一郎",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2014.",
        "abstract": "実世界の三次元物体にプロジェクタで投影を行う場合, プロジェクタの焦点の合う深度(Depth of Field: DOF)の狭さが問題となる. プロジェクタは投影像の輝度を高く保つために大きな開口を持っており, そのため DOF が狭いという特徴を持つ. それゆえ,一定の奥行きを持つ三次元物体にプロジェクタで投影を行った場合, 焦点の合っていない領域が生じてしまい, 投影像の品質を著しく落としてしまう. そこで, 本研究はプロジェクタの焦点を高速に振動させることで, プロジェクタと投影対象の幾何関係が動的な環境でもプロジェクタの DOF を拡張するフォーカススイープ投影を提案する. プロジェクタの焦点を光軸方向に振動させると, 投影像の焦点ぼけの大小が周期的に変化する. このとき焦点振動の周波数が視覚的に知覚できる限界の時間周波数(臨界融合周波数)より高いと, ヒトは投影光の焦点ぼけを時間積分して知覚する. この時間積分された焦点ぼけは, プロジェクタと投影面との距離に依らずほぼ一定になるという特性を持つ.この特性を利用することで, フォーカススイープ投影はプロジェクタと投影対象の幾何関係が動的な環境でもプロジェクタの DOF を拡張することができる.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/parinya.jpg",
        "titleJP": "Projection-based Mixed Reality for Deformable Surfaces using Infrared Textures",
        "titleEN": "研究者: Parinya Punpongsanon",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2014.",
        "abstract": "This thesis presents a new projection-based mixed reality technique for augmenting homogeneous and non-textured deformable surfaces with deformed projection graphics. Unlikeprevious techniques that consider the depth information of the surface, this approach estimated the tangential deformation by capturing infrared textures. First, the system painted the infrared ink or embedded the pieces of infrared-based fabric textures on the surface, and estimate the surface deformation using Moving Least Squares technique. Then, the system interpolated the deformation result to a whole surface, Because this technique relies only on the measurement of apparent motion of the surface, it is not limited to a specific deformation characteristic but flexible for several kinds of deformable materials such as viscoelasticity and elasticity. It allows users to interact with the augmented graphics by several method such as touching, pushing, pulling and pinching, because the proposed method apply within-two-frame feature tracking method which suffer from occlusions of user interaction. To ensure real-time and realistic augmentation, author conducted both quantitative and qualitative evaluations to find the optimal parameter, in particular, the number of feature points on the surface where feature tracking are computed between two successive frames. Moreover, the system evaluation showed that the result of deformation estimation was 5.42 pixels difference from that of an accurate off-line feature tracking through a whole captured sequence method on average.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/kanamorim.jpg",
        "titleJP": "投影型複合現実感における身体重畳投影によるPseudo-Haptics提示",
        "titleEN": "研究者: 金森 俊雄",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar．2014．",
        "abstract": "近年では,複合現実感環境において,視覚刺激のみを用いて疑似的に触力覚フィードバックを提示する研究が行われている.その提示には Pseudo-Haptics と呼ばれる視覚-触覚間に発生する錯知覚が利用されている.Pseudo-Haptics とは,視覚による知覚と固有受容知覚 (自分で感じている体の動き) との間に上整合が生じた際に,視覚による情報が優勢になるという脳の特性から,固有受容知覚に錯覚が生じる現象のことである.現在では,Pseudo-Hapticsを用いた視触覚システムの大半では,遮蔽型 HMD(Head Mounted Display) や PC モニタなどを用いるビデオシースルー方式の複合現実感環境で研究されている.しかし,視覚情報をプロジェクタからリアルタイムでシームレスに実世界上に重畳する投影型複合現実感(Mixed Reality:MR) 方式の擬似触力覚システムについては,定量的な評価や議論は現在でもあまり進んでいない.         そこで本研究では,投影型複合現実感環境において,人工的なパターン像として流れる縞模様を身体に重畳投影することによってユーザに移動感覚を提示する手法,手の身体テクスチャ像を身体に重畳投影することによってユーザの形状知覚を操作する手法を提案する.また提案手法の有効性を確かめるために検証実験を行った.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/shinmeim.jpg",
        "titleJP": "距離画像計測に基づき触覚フィードバックを付与する投影型上腕拡張ユーザインタフェース",
        "titleEN": "研究者: 新明 拓也",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar．2014．",
        "abstract": "本研究の目的は, 身体拡張ユーザインタフェースに触覚フィードバックを付与することで視覚的な問題を解消した, ユーザにとってより扱いやすいインタフェースの設計指針を示すことである. 触覚フィードバックを付与することで, ユーザが操作をしているもの (ポインタ・カーソルなど) の位置を認知するサポートを行うことができ, さらに, 操作したい対象が定まっていれば, 対象までの距離に応じた触覚フィードバックを与えるなどの工夫を行うことで, 対象の周辺までの移動を早めることができるため, 操作したい対象の周辺への到達時間が短くなると考えられる. また, 本研究では, 机の上や部屋の中に多くの物体があるような一般的な実環境における実装を想定しているため, 環境に応じた触覚フィードバックを提示したい. そこで, 環境のセンシングを行い, 環境の変化にも対応できるシステムを構築する.         本研究では, ユーザからの入力を行う機構, 視覚フィードバックを提示する機構, 環境をセンシングする機構, 触覚フィードバックを提示する機構を提案し, 試作機及び実験システムを構成した. 構成した実験システムを用いて, 触覚フィードバックを与えることで操作性が上がるということを示すための検証実験と, 触覚フィードバックによるユーザへの影響を調査する心理実験を行った.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/dronepj.jpg",
        "titleJP": "カメラ画像と内界センサによる位置姿勢推定に基づく自律飛行プロジェクタの揺動投影像幾何補正",
        "titleEN": "研究者: 細溝 仁人",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar．2014．",
        "abstract": "近年,安価かつ高性能なプロジェクタの開発により,医療分野やアート分野など多くのシーンにおいて投影型複合現実感技術の積極的な導入が見られ,今後もプロジェクタの使用シーンは増加することが予測される.これまでにハンドヘルドプロジェクタを用いたインタラクションやウェアラブルシステムとしてプロジェクタを装着する方法が提案されており,プロジェクタを設置することができない環境での重畳表示による情報付加も可能となっている.しかし,このような把持や装着を要求するシステムは,ユーザの動きを制限したり装着による負担を与えたりする. そこで,本研究では自律飛行プロジェクタを提案する.これは,自律飛行ロボットにプロジェクタを搭載したプロジェクションシステムであり,装置を装着する必要がなくなるためユーザの負担が軽減される.また,高所への投影や人が立ち入ることのできない位置からの投影が可能となるため,投影可能範囲の拡大が見込まれる.しかし,自律飛行ロボットは風などの外乱に弱く,所望の位置で完全に静止させることは困難である.そのため,投影像に揺れが生じて投影対象から外れてしまう恐れがある.本研究では,カメラ画像と内界センサによる自己位置推定結果を用いた揺動投影像の幾何補正手法を提案する.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/matsukagem.png",
        "titleJP": "投影型遠隔教育支援システムにおける書類座標系に基づく机上書類位置制約の緩和",
        "titleEN": "研究者: 松蔭 瞭",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar．2014．",
        "abstract": "近年,通信インフラの構築が進み,インターネットなどのネットワーク環境が充実してきた.そして,利用できる装置,サービス,情報が多様化し,ユーザとのインタフェース機器としての情報機器の新規開発がますます激しさを増している.これらにより,遠隔地にいる人とのコミュニケーションが容易になり,現在では遠隔協調作業システムの研究が盛んに進められている.既存の情報端末を用いて遠隔協調作業を行う場合には,作業者間の共通作業領域が情報端末上に限られるという制約がある.そのため,ペンと紙を用いた生徒の学習指導などの,どちらか一方 (もしくは両方) が机上で作業した方が好ましい作業には,既存の情報端末の使用が適切でないという問題点がある.そのため,近年の遠隔協調作業システムの研究では,プロジェクタを用いて遠隔作業者の作業内容を机上に投影する机上用投影型遠隔協調作業システムの研究が行われている. 既存の机上用遠隔協調作業システムでは,遠隔作業者の作業内容を机上に投影する際の座標系として,机上の固定の座標系を用いる.これにより,一方の遠隔作業者の作業内容が投影された書類を移動すると,書類内容と投影内容の幾何的整合性が崩れてしまう.これにより,作業者が自由に書類を移動することができないという問題が生じる.特に,両者のそれぞれの机上にある書類上で遠隔協調作業を行う場合,それぞれの机上における書類の位置関係が同じでなければならないという制約が生じる.そこで本研究では,机上書類の座標系を利用して,遠隔作業者の作業内容を投影する遠隔教育支援システムを実現することで,机上における書類の位置関係の制約の緩和を図る.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "images/researches/sazaki.jpg",
        "titleJP": "多視点三次元復元における空間周波数解析に基づくスケール推定",
        "titleEN": "研究者: 佐々木 貴之",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2014．",
        "abstract": "本研究では,異なる視点で撮影された複数画像からの立体復元において,物体固有の空間周波数を手がかりに,通常取得できないスケールを推定する手法を提案する.提案手法では,事前知識として,様々な物体をカテゴリ分類した上で,個々の物体のテクスチャとカテゴリ内の平均空間周波数が登録される.全体の処理は,画像中の特徴点の三次元位置を復元するStructure from Motion(SfM) 法を基にしており,撮影された環境から物体を抽出し,物体のカテゴリを識別した上で,空間周波数を算出することで,復元空間単位系でのスケールを定める.空間周波数の算出では,抽出された物体の画像をフーリエ変換することで,物体固有の空間周波数が算出される.以上の処理により,環境中の物体と詳細な形状モデルを位置合わせすることなしに,スケールを推定することができる.提案手法の有効性を示すために,概念実証プロトタイプを試作した上で,デスクトップ環境におけるスケール推定精度を検証した.実験により,環境中の繰り返しパターンをもつ物体が一定の成功率で認識されれば,mm オーダーでのスケール推定が可能であることを確認した. ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "images/researches/bayarsaikhan.jpg",
        "titleJP": "二値系列を用いた間歇的照明法",
        "titleEN": "研究者: Bayarsaikhan Bilegsaikhan",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar．2014．",
        "abstract": "遠隔操作型のロボットの多くはカメラで周りの状況を撮影し，操縦者側に送ることで操作も可能にしている．そのため，カメラで撮影された画像の見えやすさが重要となる．人間が自分の周囲からの情報の多くを視覚から得ているのと同様，ロボットの操縦に対して，周囲の状況を撮影した画像が大変重要である．そこで，設置時間が短く済む電池内蔵式の多数の点滅光源を用い，カメラに対する光源の位置関係が未知である条件下で取得した画像列から、全光源が点灯しているときの画像を生成する．        本研究では，線形独立を保つ二値系列の光源の点滅パターンを擬似乱数に基づき生成し，非同期点滅光源の同期ずれに対処するために，観測される可能性のある点滅パターンの全ての組み合わせで画像列を生成し，その画像列から真値の画像を抽出する．",
        "link": "",
        "collaboration": ""
    },  
    {
		"theme": "sensor network",
        "photoPass": "images/researches/yoshimizu.jpg",
        "titleJP": "自立型センサによるモノを用いた日常行動の簡易計測システム",
        "titleEN": "研究者: 吉水 健悟",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2013.",
        "abstract": "多数のセンサと情報機器を日常品（モノ）に埋め込みユーザの日常行動を認識する技術は，ライフログの提示や日常生活における健康管理など生活の質を向上させる支援への応用が期待される．しかし日常生活における画像や音声による行動認識はユーザプライバシを侵害する問題がある．そのためユーザプライバシを侵害しないセンシング手法を用いたユーザ行動認識が求められる．また，様々な場所に偏在するモノからユーザの支援に必要な情報を収集する場合，それらはユーザによるメンテナンスが不要な自立型センサであることが望ましい．しかし，自立型センサは有線で電力供給すると設置場所が限定されるという問題からエネルギー供給には困難を伴う．そこで，バッテリーレス，メンテナンスフリーなエネギーハーベスト技術に着目する．著者は，自立型センサにエネルギーハーベストによる微弱なエネルギーでも動作可能な低消費電力化を行い，ユーザ行動を常時計測するセンサシステムの構築を目指す． 本論文では，日常生活におけるユーザの行動を常時計測する日常品（モノ）の一部としてコップに着目し，加速度センサと情報機器を埋め込んだ知的なコップ「インテリジェントコップ」を提案する．情報機器として Micro Control Unit（MCU）と無線通信モジュールを用い，MCU の起動時間の制御，データ送信周期の制御，加速度センサのデータサンプリングレートを下げる方法によってセンサシステムの低消費電力化を試みた．さらに，ユーザの生活空間における照明光等から発電する太陽電池と飲み物の温度を利用した温度差発電によるエネルギーハーベストを利用することで電力供給を行った．インテリジェントコップのバッテリー寿命およびユーザ行動認識精度の評価実験から，エネルギーハーベストによる電力供給のみでユーザ行動を常時計測可能なセンサシステムから平均認識精度 93.5% で「飲み物を飲む」，「コップを持って歩く」行動を認識できることを示した．また，ユーザ行動認識に関する考察を行ったところ，「飲み物が入っている状態でコップを持って歩く」行動と「飲み物が入っていない状態でコップを持って歩く」行動といったより詳細な行動の認識も可能であることが確認された．さらにバッテリー寿命に関する実験から，低消費電力化にはMCU 起動時間の制御とデータ送信周期の制御が有効であることが示唆され，また太陽電池において安定した電力供給が可能であることが確認された．本提案システムはコップに代表される平均使用間隔の大きいモノに対して適用可能であり，今後様々なモノからユーザ行動を常時計測可能であることが示唆された．   ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/hino.jpg",
        "titleJP": "HDR投影ディスプレイのためのフォトクロミズムを利用した反射率動的制御",
        "titleEN": "研究者: 日野 直登",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2013.",
        "abstract": "プロジェクタの投影ハイダイナミックレンジ化は，仮想現実感や複合現実感におけるユーザの没入感を向上させる可能性が高く，重要な研究課題である．プロジェクタ本体から出力する光自体のダイナミックレンジを向上させる研究も数々行われている一方，投影物体の反射率を変調することによって，プロジェクタ投影の反射光のダイナミックレンジを向上させる研究が行われている．      本研究では紫外線を照射すると発色（反射率が変化）する性質をもつフォトクロミック化合物を投影面に塗布し，それに空間変調した紫外線を照射することによって，動的に発色パターンを変化させ，動的なコンテンツに対しても投影光の HDR 化を実現する．        フォトクロミック化合物の反射率を動的に変調するため，本研究では現代制御理論による制御を導入した．フォトクロミック化合物は発色と消色の時定数が大きく異なるため，MLDシステムによるモデル化を行い，最適制御を行うことを提案する．実機実験にて．時間応答と現在の状態を考えない手法と提案手法を比較した結果，提案手法のほうがより目標に近い反射率を実現することがわかった．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/miki.jpg",
        "titleJP": "実影および仮想影の身体性を利用した情報の閲覧とポインティング",
        "titleEN": "研究者: 三木 麻理子",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2013.",
        "abstract": "近年タッチセンシング技術の向上により，PC ディスプレイやスマートフォン，そしてタブレット端末等のパネルディスプレイに表示された情報に対し，利用者が手指などの自らの身体を介して直接アクセスすることが可能となっている．このような情報へのアクセス方法は利用時にマウスやキーボード等の入力デバイスを把持する必要がなく，事前にコンピュータ操作への学習を要さない．そのため，ユーザが直感的にコンピュータにアクセスすることが可能であると考えられる．しかし，直接手指でパネルに触れるという行為は，操作の範囲がユーザの体肢の届く範囲内に限られるといった制約を有する．そのため，大画面ディスプレイの端に触れる操作等の，ユーザの身体と物理的に距離が離れた対象に触れる操作には適切でない．        そこで，操作対象がユーザの体肢の届く範囲に収まらないような場合には，身体で直接触れてコンピュータ操作を行うのではなく，操作対象から離れた位置から非接触な入力によってコンピュータの操作を行う Distant User Interface (DUI) の導入が望ましい．        本研究では，DUI としてユーザ自身の身体運動との対応がとりやすい，影を利用したインタフェースに着目し，テーブル型コンピュータ端末で情報を閲覧するための実影を用いたインタフェースおよび，着席した状態で大画面ディスプレイ上の操作対象をポインティングするための仮想影を用いたインタフェースを提案する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/marina.jpg",
        "titleJP": "6スペクトルバンドプロジェクタによる投影色補正",
        "titleEN": "研究者: 武内 真梨奈",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar．2013．",
        "abstract": "プロジェクタ技術の向上に伴い，娯楽や医療，アートなど様々な場面でプロジェクタが使用されている．その中で，理想的な白色スクリーン上だけにとどまらず，壁や天井など様々な場所へ映像を投影したいというニーズはますます高まっている．その中で重要となるのが，投影色補正という技術である．投影色補正とは，投影面に目標となる色を正しく再現するために，投影像の色をあらかじめ補正しておくことである．       投影色補正の技術も近年飛躍的に向上し，模様のコントラストが低く比較的反射率の高い投影面であれば，模様の存在をほとんど感じさせないほど自然な投影ができるようになってきている．ところが，従来の手法では投影色補正を行っても依然として投影面の模様が投影結果に現れてしまう場合がある．これは，プロジェクタからの投影光がR,G,Bの3色であり，それぞれの分光特性が波長に大きな幅を持って分布していることが一因と考えられる．        そこで本研究では，プロジェクタのスペクトルを従来の3バンドからより細かい6バンドに分割することによって，従来より精度の高い投影色補正を行う手法を提案する．本手法は，スペクトルを分割するフィルタを用いてプロジェクタから出るRGBのスペクトルをそれぞれ二つに分割し，ひとつひとつのスペクトルの分布を狭めることで，従来手法の欠点を補う．そうすることで，今までRGBの3次元で制御していた投影色を6次元で制御できるようになり，より柔軟な投影色補正が可能になると考えられる．",        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/takedam.jpg",
        "titleJP": "フォトクロミズムを利用した没入型ディスプレイ投影面の相互反射補償および高コントラスト化",
        "titleEN": "研究者: 竹田 翔一",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar．2013．",
        "abstract": "近年，仮想現実感 (Virtual Reality: VR) の分野では，没入型ディスプレイと呼ばれる，複数のスクリーンで構成される投影型システムが開発され，産業や建築など様々な分野で利用されてきた．しかし，複数のスクリーンで構成されるシステムには，スクリーン間で発生する相互反射と呼ばれる現象によって，本来表示されるべき画像よりも明るい画像が表示されてしまうという問題がある．また，プロジェクタのコントラストが小さいため，投影目標を自然に表示できないという問題がある．本研究では，この没入型ディスプレイをはじめとする，複数の非平面スクリーンで構成されるシステムで発生する，相互反射と低コントラストを同時に補償する手法を新たに提案する．そこで，本研究はフォトクロミズム (Photochromism) と呼ばれる現象に着目する．フォトクロミズムとは，フォトクロミック化合物と呼ばれる物質が，ある波長の光を吸収して変色する現象のことである．本研究では，紫外線を吸収すると黒色に発色するフォトクロミック化合物を用いて，スクリーンの反射率を変調させるという手法を用いる．スクリーン上にこのフォトクロミック化合物を塗布することで，スクリーンの反射率を変調でき，スクリーンの反射率最大最小比を大きくすることができる．この変調された反射率と，投影画像の重畳表示により高コントラストな画像を表示することができる．プロジェクタのコントラストを(cp : 1)，スクリーンの反射率最大最小比を (cs : 1) とすると，このシステムのコントラストは理論上 (cpcs : 1) となるため高コントラストな表示が可能になる．本研究では，原理確認のために市販のフォトクロミック化合物と紫外線LEDを準備し，プロジェクタとカメラを用いて，二つの平面スクリーンを垂直に配置するシステムを構成した．フォトクロミック化合物を利用して６パターンの投影画像に対して，フォトクロミズムを用いた反射率変調と相互反射補償を施した画像を重畳投影する実験を行い，画像の輝度推移を調べた．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "images/researches/tsushida.jpg",
        "titleJP": "拡散符号化光投影法による瞬時三次元形状復元",
        "titleEN": "研究者: 土屋 寛",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2013．",
        "abstract": "物体の形状を計測することはあらゆる分野において必要不可欠な技術である．近年，工業分野を中心に静止物体に対する三次元形状復元が実用化されてきている．静止物体に対する形状復元手法の多くは，異なる時刻に撮影された複数のカメラ画像を用いているため，運動物体にこれらの手法は適していない．三次元形状復元手法のうち，形状復元に必要な情報を符号化した時不変のパターン光を対象物体に投影する手法は，単一カメラ画像から計測が可能であり運動物体の形状復元に適していると考えられている．しかし時不変のパターン光は複雑になる傾向があり，復号に高いコストが掛かるとされている．        そこで本研究では，重畳投影をしても分離が可能な 2 次元パターン光を投影することで，運動物体の高密度で且つ高フレームレートな三次元形状復元を得ることを目的とする．本研究ではこのパターン光を拡散符号化光と呼び，マンチェスタ符号化された M 系列信号を元に生成する．カメラ画像を分割した各ブロック領域毎に計測対象面を平面近似し，ブロック領域の 2 次元ケプストラムから各拡散符号化光の投影パラメータを推定する．更に，ブロック間で情報伝播を行うことで投影パラメータの信頼性を高める．        2 種類のシミュレーション実験を行った．64×64bit の拡散符号化光の分離を行った結果，識別可能な最小情報量は 8×8bit であった．提案手法のノイズ耐性を調べ，分散 60の自乗のガウスノイズ下においても重畳した拡散符号化光の識別率は 70% 以上を示した．実機実験では，なだらかな曲面に対して拡散符号化光の重畳投影を行い，正しく分離し形状計測が正しく行えることを確認した.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "images/researches/satoy.jpg",
        "titleJP": "偏光解析による光沢物体のモデルベーストラッキング",
        "titleEN": "研究者: 佐藤 博俊",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar．2013．",
        "abstract": "カメラ画像から光沢性の強い動物体の位置・姿勢を推定する技術は，実シーンに対してCG で描かれた仮想物体を重畳表示する拡張現実感に応用することが出来る．従来，一般的なカメラ画像からの光沢物体の位置・姿勢の推定には，物体に映り込む像を利用する手法が複数提案されてきたが，いずれも周囲の環境が静止しているか他のカメラ等で周囲の環境が逐一取得されていることが前提であった．また，偏光を用いた三次元計測法も提案されているが，光源や背景が制御された実験環境を前提としたものが多く，拡張現実感用途に応用する場合，初期位置・姿勢の推定や，未知のパターンが背景や物体表面に映り込むことにより生じる局所解の回避策等の課題が残されている．本研究では，画素単位で偏光情報が取得可能な偏光イメージングカメラにより得られる動画像から，動的で未知な光源環境下での光沢物体の位置・姿勢を推定することを目的とし，初期位置の推定法と局所解の回避策について提案する．提案手法では，偏光方向と偏光の強さの度合いを表す偏光度を用いる．偏光方向は反射面の法線方向に直交するため光源位置に依らない性質があり，偏光度は光沢物体上で高くなる性質があるため物体位置を容易に限定することが可能である．この性質を利用し，偏光イメージングカメラで取得した各フレームの画像から算出できる偏光度を初期位置推定に，偏光方向を最適化に用いる．最適化では，物体の三次元モデルから推定される画像上での偏光方向と観測される偏光方向との差を最小化する．その最適化計算では目的関数を繰り返し二次関数で近似することで局所解の回避を図る．実験では，光沢性が強く，映り込みの発生するガラス製の直方体に対して提案手法を適用し，動画像に対して，高い割合で一定精度の位置・姿勢が連続的に推定できることを確認した．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/wakabayashis.jpg",
        "titleJP": "輝度バターン推定による赤外線画像のカラー化",
        "titleEN": "研究者: 若林 悠",
        "publication": "論文種別・提出年: 卒業論文，大阪大学基礎工学部，Mar．2013．",
        "abstract": "赤外線カメラで取得した単一チャネルの画像を明るい環境で取得したカラー画像のようにカラー化することで視認性を改善することができる．しかし，従来はカラー化画像の輝度として赤外線画像が直接用いられたため，カラー画像に存在しないテクスチャの発生や存在するはずのテクスチャの欠落，輝度の反転などの劣化が生じるという問題があった．そこで本研究では，照明を加えて撮影した同一シーンにおける異なる視点のカラー画像を事前知識として参照し，この参照画像中の輝度成分のパターンをカラー化画像の輝度成分に，色差成分をカラー化画像の色差成分に転写することで，上記劣化の少ない赤外線画像と同一視点の画像を生成する手法を提案する．提案手法は，赤外線画像と参照画像間の対応点の算出，輝度成分の推定，カラー化の３つの処理に分けられる．まず，対応点の算出では、赤外線画像と参照画像の輝度成分に対しStructure-from-Motion法により対応する特徴点を抽出し，特徴点以外の画素は線形補間により画素対画素のおおまかな対応関係を得る．次に，輝度成分の推定では赤外線画像に対する大局的な類似性と参照画像に対する局所的な類似性を最大化する様に輝度値を推定する．大局的な類似性の評価には，赤外線画像を参照画像に合わせて輝度変換した画像とカラー化画像の輝度成分との間の残差の二乗和を，局所的類似性の評価には、カラー化画像の輝度成分画像上の局所領域と参照画像の輝度成分画像上の対応画素近傍の残差の二乗和を用いて同時に最小化する．最後に，カラー化画像の色差成分を算出するために，参照画像上の特徴点位置の色差をカラー化画像上の対応する特徴点位置の色差として与え，上記手法で求めたカラー化画像の輝度成分からLevinらの手法によりカラー化する．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "sensor network",
        "photoPass": "images/researches/li.jpg",
        "titleJP": "A study on Indoor Positioning System Using ID Moduled LED Tube Lights",
        "titleEN": "研究者: CHANG LI",
        "publication": "論文種別・提出年: 博士論文，大阪大学大学院基礎工学研究科，Sep．2012.",
        "abstract": "In recent years, stepping with the popularization of smart phone and the development of mobile communication infrastructure, the conditions for ubiquitous computing society become more and more complete. In the vision of ubiquitous computing society, LBS (Location Based Service) that provides an added value to an unprecedented user experience has been paid a great deal of attention by mobile operators all over the world. As the core technology for LBS, various positioning systems have been studied extensively. For the outdoor environment GPS is mature and common. However, the performance of GPS in indoor environment is bad. Moreover, currently there is no technique whose accuracy and cost are appropriate for deployment in huge areas. This thesis presents a novel camera-based information transmission system for indoor positioning and navigation. This system, which avoids the use of any expensive equipment, is of particular benefit for infrastructure consumption and is completely portable using a hand-held terminal like smart phone. The high-intensity LED tube light, which is becoming the main illumination device due to its lower power cost and longer lifetime, is employed as optical beacon in this system. LED tubes are modulated to transmit ID information, which can be received by the camera equipped on smart phone. With the captured images of LED tubes which include the ID information, the smart phone can query a database to obtain the current position and orientation via mobile communication. The ID information embedded in LED tube lights has no harm at the illumination function o. The proposed system, which is with fairly low cost and high accuracy both about orientation and position, can be expected to be feasible for deployment in large indoor environment. ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "sensor network",
        "photoPass": "images/researches/matsumoto.jpg",
        "titleJP": "着座中の体位揺動センシングシステム",
        "titleEN": "研究者: 松本 翔平",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2012.",
        "abstract": "近年，アンビエントインテリジェンスの実現を目指す研究が盛んである．アンビエントインテリジェンスとは，生活空間や公共空間において，環境中に設置された多数のセンサと情報機器がユーザの状態を見守り，さりげなく支援を提供する環境である．このような環境では，ユーザプライバシーを侵害せず，かつセンサ装着による身体的負荷などもないセンシング手法を用いたユーザ状態の推定が求められる．そこで著者は，センサを内蔵した椅子（以下，センサ内蔵椅子）を用いたユーザ状態推定手法に着目し，４点支持式歪みゲージロードセルによる着座中の体位揺動センシングシステムを提案した．センサ内蔵椅子の先行研究では，圧力分布センサを用いて姿勢推定を行う基礎研究や，着座揺動の変化から着座ユーザのストレスを推定する心理推定などが提案されてきた．しかし姿勢識別が有効に利用されたアプリケーション例は少なく，また心理推定においても重心変動の周波数スペクトルのみを観測するなど，着座揺動をモデル化して扱った例は見られない．そこで本研究では，ユーザの着座揺動を静止状態，姿勢変化動作，周期性動作，非周期性動作の４状態が不定期に遷移していくモデルとして捉え，任意の観測区間における各状態の表出回数や表出間隔を揺動要素パラメータとして定量化することで，姿勢やタスクの種類に関係なく，多様なシーンにおいて着座揺動を定量化できるプラットフォームの提供を目指す．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/david.jpg",
        "titleJP": "Fast Focal Length Swept Projection for Extending Depth of Field",
        "titleEN": "研究者: David Samuel",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Sep．2012．",
        "abstract": "Nowadays, projectors are getting more common to be used in many interactive applications. Its usage is not only limited on fixed setup, which producing fixed display, but it’s already being utilized in such a way that allow dynamic projection on arbitrary environments. However, this advantage comes at various consequences, such as problems in distorted projection display, and limited in-focus area of projection display.        This thesis presents a method for controlling the focal lengths of a projector’s lens to reduce defocus blur and preprocessing the image before projected to the surface, hence realizing a wider depth of field (DOF) projection. In general, a projector has a large aperture to maintain the brightness of projected imagery, and therefore, has a narrow DOF. By applying an electrically tunable lens (ETL) to the objective part of a projector, we can project series of images focused at various distances in a video rate by rapidly change its focal length. This technique can be used in leveraging the using of mobile projection systems where the projection plane changes continuously with time, and in projection-based virtual and augmented reality applications where images are normally prjected onto non-planar surfaces. ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/projectionsweep.jpg",
        "titleJP": "投影型上均一解像度ディスプレイにおける画像劣化を抑えた高解像度投影像移動経路計画",
        "titleEN": "研究者: 児玉 敬",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2012.",
        "abstract": "プロジェクタ投影像に指やペンなどで触れることで操作を行える投影型インタラクティブシステムでは，投影像を近距離で閲覧するため，例えば細かい文字や，画素数の多い画像などが投影される場合では高い解像度が必要となる．しかしながら，一般的にこのシステムで用いられるプロジェクタはこの条件を十分に満たしていない．そこで，複数台のプロジェクタを用いて投影することで画素数を増加し解像度を向上させることができると考えられる．しかしながら，高い解像度が必要な領域は全表示領域の一部のみであり，単純にタイル状に投影像を並べるだけでは必要のない領域の解像度も均一に向上させてしまう．これに対し，高い解像度が必要な一部の領域み高解像度表示させ，必要でない領域は低い解像度で表示することを可能にするシステムが提案されている．本研究では，こういったシステムで動画を表示する場合に，投影像の移動による画質劣化を考慮した投影像の移動経路計画手法を提案した．この手法では，単純に各フレームの最適投影領域に高解像度投影像が移動する手法（ナイーブ手法）よりも画質劣化が生じているフレームが少なくなり，投影像が静止しているフレームでは注視領域周辺の高周波成分を多く含む領域が高解像度表示されるよう設計した．投影像の画質評価の為の被験者実験を行ったところ，主観的な画質比較実験では，シミュレーション実験においては，6 コンテンツ中 5コンテンツにおいて，8 割以上の被験者がナイーブ手法よりも提案手法の方が高画質であると答えた．また実機では，4 コンテンツ中全コンテンツにおいて，8 割以上の被験者が提案手法の方が高画質であると答えた．実機を用いた図形判別による客観的画質評価実験においては，ナイーブ手法での正答率が 48 ％であるのに対し，提案手法では 68 ％の正答率が得られた．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/shimazu.jpg",
        "titleJP": "三次元カラー迅速造形物へのマルチプロジェクション重畳による高コントラスト立体ディスプレイ",
        "titleEN": "研究者: 島津 冴子",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2012.",
        "abstract": "近年，三次元計測技術や CG（Computer Graphics）の発達により，デジタル 3D モデルや奥行き情報を持ったコンテンツが工業・エンターテイメント分野などで頻繁に利用されている．それに伴い，そういったコンテンツを立体的かつ実在感高く表示するためのディスプレイ装置の研究が盛んに行われるようになった．その中でも，投影型複合現実感を利用し立体物にプロジェクタからテクスチャを投影するタイプのディスプレイ装置では，特殊な眼鏡や視差障壁を利用したタイプの立体ディスプレイと比較して VR 酔いや輻輳矛盾などを生じにくく，非常に実在感が高いという利点がある．複数台プロジェクタを利用した投影型複合現実感システムでは，その複数台プロジェクタの配置が注目され，なるべく投影対象の全体に投影を行うことができたり，あるいはテクスチャの目標色を達成するための適切なプロジェクタ最適配置を求める研究が多数行われてきた．しかし，今までその表示コントラストや解像度については注目されてこなかった．        本論文では，投影型複合現実感を利用して，高画質に対象を表示するディスプレイシステムを提案する．その画質として，投影領域や投影輝度に加えて解像度やコントラストにも注目する．従来，投影型複合現実感の投影対象としては，白色模型あるいはあらかじめテクスチャが与えられている物体を用いてきた．しかし，提案手法では RP(Rapid Prototyping) 技術を用いて適切な投影対象のテクスチャを求め，その出力に複数台プロジェクタから投影重畳を行うことにより高コントラスト表示を実現する．さらに，従来マルチプロジェクションシステムで問題となっていたプロジェクタ配置問題，目標設置位置に対する配置ズレの問題を解決するため，少ないプロジェクタ台数でユーザの目的に沿った高画質な投影を行うプロジェクタ最適配置導出手法，及び配置ズレを軽減するための設置手法を提案する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/positionmapping.jpg",
        "titleJP": "投影型複合現実感における投影文字の可読性を考慮した重畳アノテーションの適応レイアウト",
        "titleEN": "研究者: 矢引 達教",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2012.",
        "abstract": "対象理解の促進に役に立つアノテーションは，百科事典・地図のような二次元の媒体だけでなく，立体物にも付与され利用されてきた．近年では，現実空間に仮想情報を視覚的に重畳合成できるという特長から，複合現実感（Mixed Reality : MR）技術の主要なアプリケーションとして実対象へのアノテーションが利用されており，実対象に付与された大量のアノテーションを分かりやすくユーザに提示する手法に関する研究が盛んに行われている．従来，その提示手法として MR 技術の一方式であるビデオシースルー方式を利用する研究が盛んに行われてきたが，特殊なデバイスの装着または把持が必要である点などから，例えば博物館の展示品など，一般の方々に見られることを目的とした対象に付与されたアノテーションを提示する場合にはあまり望ましくない．そこで，本研究では実物体の表面に直接仮想情報を重畳させるプロジェクション方式を採用する．投影型 MR 技術を用いて立体物に付与されたアノテーションの提示を行う際には，アノテーションのレイアウトを行う際に留意すべき点に加え，投影型 MR 技術特有の問題を考慮しなければならず，特に投影面の状態により投影像の可読性が大きく低下するという問題が大きい．そこで本研究では，投影文字の可読性を考慮することで，投影面の状態に適応的なアノテーション情報のレイアウトを求めるシステムを提案する．提案システムでは，投影に適する面の条件と良いラベル配置の条件を同時に満たすような評価関数を設定し，遺伝的アルゴリズム（GA）を用いてその最適化を行う．評価関数の可読性項には，投影文字の歪み・影，背景輝度のコントラストによる投影文字の可読性への影響を調査した基礎実験の結果を用いる．本論文では，実環境中の投影文字の可読性を比較する心理物理学実験を行い，基礎実験の結果をもとに定義した投影文字の可読性を表すモデル関数が実環境における投影文字の可読性計算に適用可能であることを検証する．また，評価関数の可読性項の重み付けの異なるレイアウトにしたがって実対象に投影したアノテーションの可読性を比較する実験を行い，提案システムの有用性を示す．提案システムにより，複数人が同時に観察するような実環境中の立体物に対して，可読性が?なわれないようなアノテーション情報のレイアウトを行うことが可能となり，ユーザにとって分かりやすい注釈情報の提示が実現可能となる．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/miharam.jpg",
        "titleJP": "投影対象面の反射特性の空間的上連続領域での高解像度カメラを用いた高精度色補正投影測",
        "titleEN": "研究者: 三原 翔一郎",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2012.",
        "abstract": "プロジェクタによる複合現実感の基盤技術として, カメラとプロジェクタで構成されるシステムによる色補正投影技術が提案されている. 色補正投影とは, カメラで投影対象を撮影し, その結果から得た投影対象面の反射特性を考慮することで, 白色の反射特性を持たない投影対象に, 所望の色を映し出す投影技術である. この技術によって, 投影対象が従来のスクリーンのような白色平面でない場合でも所望の色を映し出すことができ, より汎用性の高い複合現実感を提供することが可能となる. しかし, プロジェクタの投影対象面上での解像度が低い場合, 投影対象面の模様のエッジ部分のように反射特性が上連続に変化する領域では, 色補正投影の精度が悪化する問題が生じている. 投影対象面の反射特性が上連続に変化する領域では, プロジェクタ1画素内で投影対象の反射特性が大きく変化するため, 意図しない色が反射されることになり精度が悪化する. そこで, 本研究は, 高解像度カメラを用いて投影対象の反射特性を密に計測し, 得られた反射特性情報に平均化処理や最小二乗法を用いることで, プロジェクタ1画素内での反射特性の変化の影響を最小限にする, より高精度な色補正投影手法を提案する. 本研究では, 高解像度カメラを用いた提案手法の有効性を確かめるため, 高解像度デジタルカメラと一般的なプロジェクタを用いて, 上連続な反射特性を持つ対象に対して色補正投影を行う実験を行った. また, 投影結果と目標画像の色差で評価を行い, その結果を調べた. ",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "images/researches/ramy.jpg",
        "titleJP": "One-shot 3D Photography Using a Smart Mobile Device and a Transparency Plate",
        "titleEN": "研究者: Ramy S. ELDelgawy",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Sep．2012．",
        "abstract": "Structured-light has been used a lot in recent years for 3D shape recovery from images. There are different techniques for this method of 3D acquisition. These techniques vary in their spatial resolution, temporal resolution, cheapness and their availability to the public. In this study we propose a novel technique that is cheap, can be used by anyone and has high temporal resolution. In our method we use a smart phone, which is used a lot now a day, and a transparency plate with a grid pattern printed over it for our 3D data retrieval. This method does not need any special or expensive equipment and is very easy to use. ",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/sathawan.jpg",
        "titleJP": "Color Recovery of IR Image for Tele-Operated Robot",
        "titleEN": "研究者: Suthawan Jirandorn",
        "publication": "論文種別・提出年: テクニカルレポート，Aug．2012．",
        "abstract": "Tele-operated inspection robots have the potential to reduce workers various risks. One of the major problems is low visibility of grayscale images taken when the robot is exploring in a dark environment. The main purpose in this research is to extend the existing colorization method which generates colorized images from grayscale images using manually-given color cues. Our method consists of the following two phases. The first is pre-acquisition of environmental landmarks and their colors as prior knowledge in a bright condition. In the second phase, in a dark condition during blackout, the feature points corresponding to the landmarks are detected in acquired frames and the frames are colorized with the landmarks colors. Then using the colorization algorithm to propagate colors based on the pattern of input grayscale image. In the experiment, we used a grayscale image converted from the ground truth color image and the color marks provided by an open source SLAM software, PTAM were given to the input image at the landmark positions.",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/ishikawam.jpg",
        "titleJP": "生体の触手構造を模倣した光ファイバ束による画像センサ",
        "titleEN": "研究者: 石川 恵子",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2012.",
        "abstract": "近年の画像センサの進歩は目覚ましく，コンピュータの能力向上と併せて，リアルタイム計測や遠隔操作によるデータ取得を必要としている様々な現場で用いられている．しかし画像センサは性能が大きさとコストに影響されることから，状況によっては性能の低い画像センサを使用せざるを得ない場合がある．本研究では生物に着目し，消費電力の低い低性能画像センサを，消費電力を抑えたまま画像センサの性能を向上させる手法の提案する．生物は進化の過程で高度に最適化されているため，効率な構造や機能を持つ．本研究では生物のうち，カタツムリとイソギンチャクの構造に注目し，それぞれを生体模倣したセンサを作成した．カタツムリ模倣型センサでは視野角の性能向上について実験を行い，イソギンチャク模倣型センサでは外部状況の推定する実験を行った．これら２つのアプローチの妥当性を検証した．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/sekawa.jpg",
        "titleJP": "画素形状のランダム符号化による超解像処理の高性能化",
        "titleEN": "研究者: 笹尾 朋貴",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2012.",
        "abstract": "本論文では，撮像素子の各画素を複雑で不均一な形状とすることで，複数の低解像度画像から高解像度画像を推定する超解像処理の性能・特性を改良する手法を提案する．本論文における超解像とは，複数枚の観測画像から高解像度の原画像を推定する画像処理手法である．現在，超解像に関するカメラ製品や研究は多く存在するが，どれも撮像素子における各画素の形状は矩形（正方形）のままであり，その内部に入射する光量の総和が画素値として出力されている．この方法では各画素のサンプリングは点サンプリングではなく有限の面積によるサンプリングとなる上，全ての画素の特性が同一であることから，正方形の畳み込みによって原画像の高周波成分が失われることになる.         そこで本論文では，撮像素子の上に細かい黒色粉末を振りかけることで各画素のサンプリング関数（受光分布）のランダムなコード化を行い，正方形の畳み込みによる原画像の高周波成分の損失を低減する手法を提案する．ここで，黒色粉末を振りかけた場合，それぞれの画素の受光分布の形状は未知となる．そこで，複数の既知パターンをコード化済みのカメラにより撮影することで，それぞれの画素形状を推定する方法について示し，実験によりそれぞれの画素の形状を，画素間隔よりも高い解像度で求めることが出来ることを確認した．更に，推定したコードを用いて作成した超解像画像を評価し，従来の正方画素のカメラよりも超解像の性能が向上することを示す．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/seta.jpg",
        "titleJP": "符号化開口を用いたDepth from Defocusとステレオ法の融合に関する研究",
        "titleEN": "研究者: 武田 祐一",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2012.",
        "abstract": "露出の過不足，ぼけ，ぶれは画像の三大失敗写真と呼ばれ，これらを取り除くために自動露出，オートフォーカス，手ぶれ補正などの技術が進歩して来た．しかし，この三要因については本質的なトレードオフがあるため，既存のカメラ系では適切な露光量でぼけやぶれを含まない写真を撮影することは難しい．しかし，撮影画像とその画像がどのようにぼけたかを知ることができれば，逆演算によってぼけやぶれのない画像を取得することができる．ぼけはレンズの開口形状とシーンの奥行きによって決まるので，画像から奥行きを推定することができればよい．また通常の円形の開口では画像情報の欠落が多い．そこで開口形状を工夫し，所望の通過周波数特性を持たせる符号化開口に関する研究が盛んに行われている．        そこで本論文では，奥行き推定を行う手法であるステレオ法と Depth from Defocus 法，符号化開口を融合し，高精度な奥行き推定とぼけを取り除いた画像を得るシステムを提案する．ステレオ法の利点である高分解能な奥行き推定をベースに，ステレオ法では奥行き推定を行うことが難しい状況下でも Depth from Defocus と符号化開口の効果を取り入れることで，奥行き推定をロバストに行うことができる．さらに符号化開口の効果により高精度な逆演算を行うことができるため，高品質にぼけを取り除くことができる．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/mori.jpg",
        "titleJP": "照明環境の特性に基づく反射現象の分類とモデル化に関する研究",
        "titleEN": "研究者: 森 隆浩",
        "publication": "論文種別・提出年: 修士論文，大阪大学大学院基礎工学研究科，Mar．2012.",
        "abstract": " 本論文では物体表面各点の輝度を決定づける反射現象と影が持つ性質に着目し, それに対して照明の方位や形状を変化させた複数の画像を解析することで, 反射光を構成する複数の反射現象を分離する手法と, これらの反射現象のうち鏡面反射の拡がり特性をモデル化する手法について述べる. 第一の手法は, 物体色として観測される拡散反射が従う画像の線形性に注目することで, 照明方位の異なる複数枚の実画像から鏡面反射や影を分離し, 拡散反射成分のみを含む画像を生成する手法を提案する. 平行光源, 完全拡散反射面を仮定することで, 光源方向の異なる 3枚の基底画像の線形結合により, 任意光源方向の画像を表現することができる. この性質を利用すると, 非ランバート成分を含み照明方位が異なる４枚以上の入力画像から, 拡散反射成分のみを含む画像を推定できることが分かっている. しかし, 従来手法のアプローチには問題が残っていた. それは, 拡散反射だけではなく鏡面反射や影といった非ランバート成分を含む実画像から 3 枚を選択することで初期的な基底画像とするために, 変換生成された画像は不安定となり, 3 枚の基底画像の組み合わせに結果が大きく依存してしまうということであった. また, 従来手法では, 非ランバート成分を除去するのに組み合わせ最適化問題をランダムサンプリングにより解いているために長時間を要するという問題も持っていた.そこで, 我々は光学現象の分類を用いた新しい画素値変換アルゴリズムを提案する. 提案手法では, 実画像から拡散反射のみを含む 3 枚の理想的な基底画像を一意に生成することを可能にし, 安定的かつ高速に鏡面反射や影を除去した画像の生成を可能にする. 第二の手法は, ランバート則に従う拡散反射と異なり, 物体表面の状態により光沢の拡がりの大きさや形状, 向きが様々に変化する鏡面反射を, 少ない画像取得枚数により高速にモデル化する方法を提案する. ここでは, 各点の反射を照明方位の空間周波数の応答ゲインとして計測することで高速化を図る. たとえばヘアライン仕上げの物体は単に荒い面であるというだけでなく, それぞれの小さな面が生じる鏡面反射の集まりによって反射光が構成されているために, 各点周囲の小面の向きの分布や面が磨かれた向き, 度合いにより反射光の指向性が変化する. このような物体に対して, 従来の BRDF 計測装置では物体表面各点の反射特性を独立に取得することは不可能であった. それに対し提案手法では, カメラで観測した画像上の各点について異方性の変角反射率分布を計測することが可能である. ",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/suzuki.jpg",
        "titleJP": "拡張現実感システムによる周期構造を手がかりにした3次元計測",
        "titleEN": "研究者: 佐々木 貴之",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2012.",
        "abstract": "本研究では, 単一カメラが運動することで生じる視差により立体復元を行う3 次元計測において, 計測対象の繰り返し構造を利用することで, 通常取得できないスケールを高精度に推定する手法を提案する. 提案手法は, モバイル端末上での利用を前提に, 画像中の特徴点をフレーム間で対応づけるStructure from Motion(SfM) 法を基にしており,SfM 法により3 次元位置が推定された一部の特徴点間の距離を与えることで, 特徴点群全体のスケールを決定する. このとき, 特徴点の検出位置と距離を与える箇所が一致せず, これにより生じるスケールの誤差が対象全体の3次元計測結果に影響を与える. そこで, 提案手法では, フーリエ変換によりシーンの周期構造を抽出し, 特徴点が空間的に繰り返し検出される箇所と対応づけることにより, 個々の対応の位置ずれによる誤差を平均化し, スケール推定の精度向上を図る. 実験では, ウェブカメラを用いて, 計測した特徴点を選択及び2 点間の距離をカメラ映像上に重畳表示できる拡張現実感システムを試作し, 紙面にプリントしたパターンと繰り返し構造を含む実シーンに対して, 提案手法の有効性を検証した. 紙面上のパターンを用いた実験では, 人手により映像上の2 か所を選択しスケールを推定する方式と, パターンが既知のマーカを自動検出する方式の2 つを試した. 両方式で単純に2 つの特徴点を指定してスケールを決定するよりも, 提案手法を利用する方が, 統計的に有意な差で精度が高いことが分かった.実シーンでの実験では, タイル及びキーボードの繰り返しパターンに対して提案手法によるスケール推定が可能であることを確認した.",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "user interfaces",
        "photoPass": "images/researches/nakashima.jpg",
        "titleJP": "光学シースルーディスプレイにおける近接照明効果の補正手法",
        "titleEN": "研究者: 中嶋 康博",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2011.",
        "abstract": "近年，コンピュータにより作られた仮想空間と実空間とを融合する複合現実感(Mixed Reality：MR) 技術に関する研究が盛んに行われている．複合現実感技術により実空間中の物体へ仮想空間中の情報を付加することができる．このため複合現実感技術は，医療・福祉，教育，建築・都市計画といった幅広い分野でユーザの作業支援や理解促進を目的として利用されている．複合現実感技術は実物体へ情報を付加することができるだけでなく，実空間の物体にコンピュータで作られた画像を重畳し，物体の見え方を変化させることもできる．このような実空間には存在しない仮想的な画像情報を実空間の物体と重畳してユーザに提示することで，物体の色をユーザの意図する色に変化させる色再現の研究が行われている．複合現実感技術を用いた色再現の研究の一つに光学シースルー方式を用いた研究がある．光学シースルー方式を用いることで，小型で安価な色再現システムを構築でき，システムを使用する際にユーザは不快感を覚えることはない．この光学シースルー方式を用いた色再現の研究では，ディスプレイとハーフミラーを用い，ディスプレイに表示させたコンピュータの画像をハーフミラーを用いて色再現の対象となる実空間の物体と重畳させることで色再現を行う．しかし，色再現システムと対象物体が近接すると，近接した際に生じる光学現象のため色再現精度が低下してしまう．そこで，本研究では，光学現象のモデル化を行い，モデルの逆問題を解き光学現象の影響を補正し，システムと対象物体が近接する場合において色再現精度の向上を目指す．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/ikeda.jpg",
        "titleJP": "符号化スリット光による三次元形状計測",
        "titleEN": "研究者: 池田 和人",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2011.",
        "abstract": "物体の詳細な寸法や形状の計測が必要とされるシーンは数多く存在する．例えば，工場における生産ラインの自動化や量産部品の精度検査，壊れやすい文化財の恒久形状保存，更には歯科における施術前歯列形状の保存などである．更に一般家庭向けのゲーム機にも取り入れられるなど，その応用分野は現在も広がっている．形状計測の利用シーンが広がるにつれて，その利用の形態も従来の整備された据え置き型環境での計測から，計測対象のの存在する場所に出向きそこに環境を配置して行う計測へと広がってきた．そしてその結果，計測システムの設置や移動が煩雑でないシステムが求められるようになった．高精度かつ比較的安価に実装可能な三次元計測手法の１つにアクティブステレオ法がある．アクティブステレオ法ではプロジェクタから物体に光を投影し，その反射をカメラを用いて観測する．物体全体に一様な光を投影すると計測が困難であるため，対象に局所的に光を投影し走査と撮影を繰り返す必要がある．それに対して符号化した光を対象全体に投影することで走査・撮影の回数を減らすことのできるパターン光投影法が提案されている．本研究では，計測システムの設置が容易におこなえ，かつ短時間で計測をおこなえる手法を提案する．提案手法では計測システムの設置を容易にするため，計測治具を用いた同時校正を行う．計測対象と合わせて治具にスリット光を投影し撮影することでカメラの外部パラメータの校正とスリット平面の推定が可能であり，これにより事前のカメラ・プロジェクタの校正を行う必要がないためシステムの設置・移動が容易になる．また短時間で計測を行うために，パターン光を用いて計測を行う．提案手法では，パターン光投影法において複数のスリットを含むパターンを用いる場合に問題となるプロジェクタ画像上のスリットラインとカメラ画像上の輝線の対応付けを，スリット光の符号化により求める手法を提案する．スリット光の符号化には色変調は用いず，2値の輝度を用いた輝度変調のみを用いる．また各スリットごとに符号化を行うために，復号の際に複数のスリットを参照する必要がない．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/nakada.jpg",
        "titleJP": "複数方向からの多重投撮影による遮蔽物形状計測および投影像影補償",
        "titleEN": "研究者: 長瀬 百代",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2011.",
        "abstract": "近年，プロジェクタの小型化・低価格化が進んでいる．それに伴い，プロジェクタを用いて，様々な平面を情報提示あるいはインタラクションに用いるという，投影型複合現実感(MR: MIxed Reality) 環境に関する研究が盛んに行われている．しかしながら，そのような環境においてはユーザの影によって投影が遮蔽されるという問題がしばしば起こる．加えて，投影対象面を任意とし，ユーザの動きの自由度を上げれば上げる程，投影対象上に影ができる頻度が上がる．これを解決するために，影になっているプロジェクタを検出し，遮蔽されていないプロジェクタより投影を行うことで，投影面に影ができるのを防ぐ．また，遮蔽されているプロジェクタを認識する妥当な案の1 つとして，位置姿勢の既知なプロジェクタを用意し，遮蔽物をカメラで観測し，遮蔽物の位置を取得するという手法が考えられるが，遮蔽物の持つ反射率によっては，遮蔽物部が背景に分類されるという誤認識により，うまく影を補償することが困難になる．本論文ではこれらを解決する手法として，複数カメラを用いた，任意の遮蔽物が入ってきた場合にも対応可能な影除去手法を提案する．複数カメラの画像から，物体の形状をVisualHull を用いて復元し，その形状情報を基に投影の遮蔽が起こらないプロジェクタから投影を行うことで，ユーザーの観測する像を遮蔽なく投影することを可能とする．本提案法では，物体の形状を取得しているため，ユーザのインタラクション検出も同時に可能である．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/matsumiki.jpg",
        "titleJP": "伝播性時空間映像を適用した超低速度光の仮想表現- Snail Light Displays -",
        "titleEN": "研究者: 松崎 圭佑",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2011.",
        "abstract": "近年，複合現実感（MR: Mixed Reality）技術を日常的に体験できない物理現象を再現したり，物理的に再現の難しい環境を仮想的に構築するといったエデュテインメント分野へ応用した研究が増えている．本研究では光速度を仮想化する物理現象の対象とし，例えば速さ10[cm/s] のように非常に低速な光である”超低速度光”を考え，それらが存在する仮想空間をMR技術を用いて構築することを目指す．超低速度光の伝播では，観測者は物体のリアルタイムな状態を観測できず，物体との距離に応じて遅延した状態が観測される．また，物体と観測者の間の空間に様々な時刻に放出された光が存在するという現象が生じる．このため，観測者の空間位置の変化させることで，観測される光の時刻を変化させることができ，このインタラクションにより，ユーザは超低速度とのインタラクションを知覚すると考えられる．超低速度光の存在する仮想空間を表現する技術として，本研究では時間経過によって各フレームの位置が移動していく伝播性を持った時空間映像を適用した．よって本研究では，伝播性を持つ時空間映像を実空間中にマッピングし，超低速度光が存在する仮想空間を表現した複合現実感システムとして”Snail Light Displays”を提案する．時空間映像を切る面をスクリーンや液晶ディスプレイなどのユーザが把持する表示デバイスとした．Snail Light Displays では，様々な時刻のフレームが空間中に存在するので，ユーザは表示デバイスを動かすことで表示されるフレームの時刻を変化させることができる．本研究では，時空間映像の光源やコンテンツにより，Snail Light Displays を4 種類にモデル化し，それぞれのプロトタイプシステムを実装した．Snail Light Displays は超低速度光という仮想物理現象の存在をユーザに知覚させ，超低速度光とのインタラクションを実現したエデュテインメントシステムと位置付ける．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/matsushita.jpg",
        "titleJP": "投影型複合現実感による文書探索・収紊支援",
        "titleEN": "研究者: 松下 和弘",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2011.",
        "abstract": "本棚は限られたスペースに文書を効率よく収紊・管理することができる設備として，家庭やオフィスなど多くの場所で用いられている．しかしながら，本棚を利用する上で，問題点もいくつか存在する．文書の背表紙に表記できる情報は限られているため，探索者は文書を一冊ずつ本棚から取り出して確認する必要があり，時間と手間を要する（探索問題）．また，収紊された文書の並びを厳密に継続的に管理するには多くの時間と手間が必要である（収紊問題）．一方，近年のプロジェクタの低価格化・小型化・高輝度化によって，多くのプロジェクタが生活空間に設置され，人々の日常生活を支援する環境の構築が，今後，より進んでいくと考えられる．本研究では，このような環境を想定し，投影型複合現実感技術を用いて，本棚での文書の探索・収紊支援を効率的に行うシステムを提案する．上記の問題点を解決する手法として，まず，探索問題に対して，ユーザが指先で本棚の棚表面をなぞると，指先の接触位置の真上及びその周辺に収紊されている文書の表紙画像が，その背表紙に投影表示される「表紙画像の表示による探索支援《を提案する．これによって，ユーザはわざわざ文書を本棚から取り出す必要なしに，背表紙よりも情報量の多い表紙画像を確認できるため，探索効率の向上が期待できる．次に，収紊問題に対して，文書を本棚に接近させると，ガイド光を投影して以前の収紊位置を指示する「収紊位置の投影指示による収紊支援《を提案する．これによって，ユーザは文書の収紊位置を継続的に管理することが可能となる．提案システムでは，利用の際にユーザが特殊な装置を何も身に付ける必要はない．また，ユーザの操作空間と情報の表示空間を探索空間である本棚上で一致させることで，効率的な文書の探索・収紊支援を可能とする．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/tsushi.jpg",
        "titleJP": "瞬時三次元形状復元のための多重2次元符号化コード光投影法",
        "titleEN": "研究者: 土屋 寛",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2011.",
        "abstract": "物体の形を計測することはあらゆる分野において必要上可欠な技術である．近年，工業分野を中心に静止物体に対する三次元形状復元が実用化されてきている．一方で，運動物体に対する形状復元は静止物体に比べ多くの問題がある．また，静止物体についても，既存手法において全周の形状復元を行うには，対象をターンテーブルの上に置くなどして複数回に分けて形状復元を行う必要がある．三次元形状復元手法の一つに，形状復元に必要な情報をコード化したパターンを対象物体に投影する，能動的計測であるパターン光投影法がある．この中でも，時上変のパターン光を投影する手法が運動物体の形状復元に適していると考えられている．しかし，この手法ではパターン光が複雑になり，復号が難しいとされている．そこで，本研究では重畳分離・ 識別が可能な，2 次元パターン光を同時に複数投影することで，運動物体の高密度で且つ高フレームレートな三次元形状復元を得ることを目的とする．また，このようなパターン光を用いることで，対象の全周三次元形状を一度に復元することも可能となる．本研究ではこのパターン光を2 次元符号化コードと呼び，M系列をマンチェスタ符号化した信号列を元に生成する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/hinob.jpg",
        "titleJP": "フォトクロミズムを利用した投影面の時空間反射率変調による高コントラスト投影表示",
        "titleEN": "研究者: 日野 直登",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2011.",
        "abstract": "近年，プロジェクション型MR (Mixed Reality) に関する研究が盛んに行われている．特に，立体物に投影し，より現実世界に近い表現を可能にする研究がなされているが，そこにはプロジェクタのコントラストが低いという問題がある．現実世界のコントラストはプロジェクタのコントラストより遥かに大きいので，コントラストを高めることができれば光による煌めきなどより現実世界に近い表現が可能となる．本研究では，フォトクロミズムを利用してプロジェクタ投影面の反射率を変調することで，高コントラストな表現を可能にする手法を提案する．フォトクロミズム（photochromism）とは，光などの電磁波照射により可逆的に物質の吸収波長帯が変化する現象で，フォトクロミズムを引き起こす化合物を特にフォトクロミック化合物と呼ぶ．フォトクロミック化合物をインク状にして塗布することで，対象物体の反射率を変調することができる．プロジェクタのコントラストを（c1 : 1），投影面の反射率最大最小比を（c2 : 1）とすると，このシステムのコントラストは理論上（c1c2 : 1）となるので高コントラストな表示が可能となる．本研究では，フォトクロミズムを利用した投影面の反射率変調の有効性を確かめるため，紫外線LED と市販のフォトクロミック化合物，プロジェクタ-カメラシステムを用いて高コントラストな画像を生成する基礎実験を行い，コントラストで評価を行った．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "design engineering",
        "photoPass": "images/researches/yamamotos.jpg",
        "titleJP": "道具と手の関係に着目したデザイン支援インタフェース",
        "titleEN": "研究者: 山本 景子",
        "publication": "論文種別・提出年: 博士論文, 大阪大学大学院基礎工学研究科, Mar. 2010.",
        "abstract": "人間が道具を手にして何かの作業を行うときには，手で握る（把持）という行為を必ず伴う．そしてこの把持動作は作業の過程で様々に変化する．作業者である人間自体は，それらの変化が生じているということすら意識にのぼらない場合が多い．把持は，手と道具が関わる際に自然になされる動作であるにも関わらず，これをコンピュータへの入力として用いるユーザ支援インタフェースの研究は行われてこなかった．そこで本論文では，道具と人の接点である「手」に着目し，その手と道具をつなぐものである「把持」に焦点を当てる．把持を中心としたマンマシンインタラクション環境を構築することで，道具の機能である真の「支援」とは何かについて考察する．意図した作業が正確にかつ効率的に行えるよう，握り方を変えたり，道具の位置や姿勢を変えたり，道具にかける圧力を変えるなど，把持の仕方を様々に変化させることは，経験的にかつ無意識に行っている行為である．そのため，デバイス自身がどのように把持されているかをセンシングしそこから情報を取得することで，把持動作からユーザの意図を読み取ることが可能であると考えられる．デザイン活動においては，ユーザのもつイメージを素早く表現にまで移行させることが重要である．そこで，人が道具を用いるときに必然的にかつ自然に行う「把持」動作を入力モーダルとして利用することで，ユーザの意識をコンピュータへの入力操作ではなく作業対象自体に向けさせることが可能となり，コンピュータによる円滑なデザイン支援が実現される．本論文では，このように把持動作のセンシングを可能とする入力インタフェースを設計・試作することで，ユーザのデザイン活動における自然な把持状態の計測および解析を行い，デザイン支援システムへの応用可能性を探るため，2D ドローイング支援システム，3D 造形支援システム，動画検索支援システムを構築し，ユーザの思考を阻害しないマンマシンインタラクションを実現する．これらのシステムを通し，道具と人をつなぐ「把持」を中心としたデザイン支援システムにおける，よりよいインタフェースのあり方の包括的な知見を得る．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "sensor network",
        "photoPass": "images/researches/bradley.jpg",
        "titleJP": "2 Dimensional Infrared Robotic Mapping System",
        "titleEN": "研究者: Bradley Nobuo Watanabe",
        "publication": "論文種別・提出年: テクニカルレポート, July 2010.",
        "abstract": "This project intents to take the initial steps towards increasing the mobility and effectiveness of robotic movements. It does this by creating a 2 dimensional map of the given environment. This gives the robot the ability to avoid obstacles more efficiently and take a more direct route to its destination. In this prototype, the system will only create a map of a small well defined area. This concept will later be expanded to a larger, more rugged environment.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "sensor network",
        "photoPass": "images/researches/yoshimizud.jpg",
        "titleJP": "指数輝度変調に基づく光源方向推定を用いた位置推定",
        "titleEN": "研究者: 清水 知也",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2010.",
        "abstract": "センサネットワークとは，環境中のさまざまな場所にセンサノードを散在させ，センサ情報を収集し，人間にとって役立つサービスを提供するものである．このようなセンサネットワークにおいて，センサノードの位置情報は重要である．本研究では屋内でのセンサノードの位置推定手法を提案する．提案手法は方向推定に基づいて位置推定をする．方向推定では，指数関数型輝度変調をするLED の方向を簡易なデバイス（赤外線受光センサ）を用いて推定する．位置推定計算は，PnP(Perspective n-point) 法を用いる．この提案手法に基づいて方向推定と位置計算をするセンサノードを赤外線受光センサとマイコンを用いて実装し，位置推定実験をして，位置推定精度と消費時間の考察をした．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "sensor network",
        "photoPass": "images/researches/ishikawa.jpg",
        "titleJP": "二次元光センサを搭載した光通信型センサネットワーク",
        "titleEN": "研究者: 石川 恵子",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2010.",
        "abstract": "センサネットワークでは，ネットワークで繋がれた多数のセンサが周囲の状況や環境を自動で認識し，協調動作しながら機能することでその場に適したサービスを提供する．このセンサネットワークの実現には収集したセンサ情報とともにセンサ間の通信方式とセンサノードの位置同定が重要となる．本研究ではそれぞれを光通信と二次元光センサで行うセンサネットワークを提案する．搭載する二次元光センサは赤外線を受光すると画像中の輝点座標を読み出すことができる．提案するシステムでは，三次元位置が既知なノードのLEDが発する赤外線を位置が不明なセンサノードの二次元光センサが受光し，得られるLED輝点座標と発光したLEDの世界座標から三次元位置を推定する．三次元位置推定計算は各ノードでは行わず，サーバで行う．本論文ではシステムを実際に構築し，提案システムによる位置推定の誤差の評価を行った．実験の結果からノードの三次元位置が推定されることが示された．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/kimura.jpg",
        "titleJP": "ハンドヘルドプロジェクタの遅延投影と手姿勢変化を活用したユーザインタフェース",
        "titleEN": "研究者: 木室 俊一",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2010.",
        "abstract": "近年，光半導体技術の革新により小型プロジェクタの普及に拍車がかかっている．小型化により従来のモバイル端末にプロジェクタが搭載され，スクリーンの場所を選ばず，日常に存在する壁に映像を投影するような状況が訪れると考えられる．ハンドヘルドプロジェクタは，現在の小型表示ディスプレイを搭載したモバイル端末では行うことが出来ないような大画面投影に基づいたインタラクションを可能にすると考えられる．ハンドヘルドプロジェクタはモバイル端末でありながらも，大型画面を投影できることが強みである．ユーザが投影した大型画面を見てアプリケーションを操作する時，ユーザはモバイル端末の入力インタフェースと投影画面を交互に見て操作しなければならず，入出力空間の一致したユーザインタフェースが必要である．ハンドヘルドプロジェクタを保持しながら行える手の運動にはレーザポインタのように指す動作や，手首を捻る動作などの日常動作とコンピュータの操作方法を結びつけれる動きも存在するため，手の運動を用いたインタフェースは習得が容易である．また，日常的な経験から，自身の手の運動は目で確認することなく行えると考えられる．よって，手の運動によるハンドヘルドプロジェクタの姿勢変化でコンピュータとインタラクションするシステムが有用であると考えられる．本研究では，プロジェクションする投影画像を手姿勢変化に対して遅延投影させることにより，ウィンドウ投影を行いながらも手姿勢変化で投影ウィンドウ内を操作できる手法を提案する．提案するDelayingWindow 投影は，投影画像をプロジェクタの光軸に対してあえて遅延して追従する制御を行い，カーソルと投影画像の制御を一時的に分離することで手姿勢変化を用いて投影画像内コンテンツのポインティングによるターゲット選択を可能とする．また，投影画像の遅延が安定化制御の役割も担い，手振れの問題も解決する．投影遅延時間とそれが操作性に与える影響に関して実験を行い，Delaying Window メタファのハンドヘルドプロジェクタインタラクションを行う際のデザイン指針を示した．最後に，手姿勢変化を活用した操作方法を提案し，ビデオ操作アプリケーションを開発して応用への可能性を示した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/yoshiki.jpg",
        "titleJP": "投影光の２次元符号化による間接反射にロバストな三次元形状計測",
        "titleEN": "研究者: 古瀬 達彦",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2010.",
        "abstract": "物体の形を計るということは特に工業分野を中心に必要上可欠なことである．また近年，密な三次元の形状を取得する三次元形状計測が実用化されきている．工業分野はもちろん，医療，?飾，建築，考古学といった様々な分野に適用されつつある．それに伴って，計測対象となる物体の種類も増えている．そのため計測対象の特性（大きさ，色，動き，材質など）に合わせて各手法が提案されている．中でも光源から何らかのパターンを物体表面に投影し，その様子を観測することによって計測を行う能動的計測手法は非接触，非侵襲かつ高精度に計測できるという利点がある．この手法の前提として光源から物体表面に到達した光がその到達した点で反射してカメラで観測されることを前提としている．しかし光の反射現象は複雑なものであり，必ずしもこの前提を満たすとは限らない．一般的に物体の表面で反射された光には直接反射成分と間接反射成分と呼ばれる二つの要素がある．直接反射成分とは物体表面に到達した光が到達した点で反射をする光のことをいう．つまり，前述した前提を満たすので三次元形状計測において，理想的な光といえる．一方，間接反射成分とは到達した光が，その到達した点とは異なる点から放射されて観測される光のことをいう．間接反射成分の例として，表面下散乱や相互反射がある．表面下散乱とは物体内部に光が入り込み，投影した光が滲んだように見える現象のことであり，半透明物体で観測される．また相互反射とは一度物体表面に当たった光が再び光源として他の領域を照らす現象のことをいう．これらは前提を満たさず，計測精度を低下させる原因となる．そこで本研究では直接反射成分と間接反射成分を分離し，直接反射成分のみを利用することによって計測精度の向上を目的とする．具体的には投影パターンの各点を周期的擬似乱数であるM系列を用いて時間軸方向に変調する．間接反射成分の影響の抑制には以下の二つの原理を用いる．一つは，直接反射成分と間接反射成分の周波数特性の違い，もう一つは投影パタンと観測輝度値の同期検波を用いる．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/shimago.jpg",
        "titleJP": "複数台のパンチルトプロジェクタによる投影コンテンツに適応的な上均一解像度ディスプレイ",
        "titleEN": "研究者: 児玉 敬",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2010.",
        "abstract": "プロジェクタ投影像に指やペンなどで触れることで操作を行える投影型インタラクティブシステムでは，投影像を近距離で閲覧することが多いため，例えば細かい文字や，画素数の多い画像などが投影される場合では高い解像度が必要となる．しかしながら，一般的にこのシステムで用いられるプロジェクタはこの条件を十分に満たしていない．そこで，複数台のプロジェクタを用いて投影することで画素数を増加し解像度を向上させることができると考えられる．しかしながら，高い解像度が必要な領域は全表示領域の一部のみであり，単純にタイル状にプロジェクタを並べるだけでは必要のない領域の解像度も均一に向上させてしまう．そこで本研究では，高い解像度が必要な一部の領域のみ高解像度表示させ，必要でない領域は低い解像度で表示することを可能にするシステムを実現した．実際に投影表示を行ったところ，元画像の高周波成分を多く含む領域では，解像度が高い投影像で表示され，その他の領域では解像度の低い投影像で表示されていることが確認できた．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/shimatsu.jpg",
        "titleJP": "３次元カラープリンタ出力へのプロジェクタ投影重畳による高コントラスト立体ディスプレイ",
        "titleEN": "研究者: 島津 冴子",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2010.",
        "abstract": "高コントラストな色彩をもつ立体物の形状情報・色情報をデジタル化し活用する試みが盛んにおこなわれている．それに伴い，それらの形状情報の立体性と色情報のコントラストを?なうことなく詳細に表示することが可能なディスプレイへのニーズも高まっている．本論文では，三次元カラープリンタ出力に対してプロジェクタ投影重畳を行うことで，高コントラストかつ立体感・実在感の高い表示を行うディスプレイシステムを提案する．三次元カラープリンタは対象物体の形状情報を立体的に出力できるが，コントラストが低くその色情報を十分に表現できない．そこで本システムでは，対象物体の高コントラストな色情報を低コントラストな三次元カラープリンタ出力とプロジェクタ出力に分割する．そしてこれらを投影重畳することで，三次元カラープリンタ出力のもつ立体感や実在感を?なわず，かつそれぞれのデバイスを単独で用いた場合と比較して高コントラストな表示を行う．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/kenta.jpg",
        "titleJP": "投影型複合現実感における対象形状・反射率を考慮した重畳アノテーションの適応レイアウト",
        "titleEN": "研究者: 矢引 達教",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2010.",
        "abstract": "例えば医学の解剖書や百科事典の図解に付与された部位の吊称など，アノテーションは対象理解の促進に役立つ．アノテーションが付与される対象は百科事典・地図のような二次元の媒体だけでなく立体物にも拡張されており，近年では，現実空間に仮想情報を視覚的に重畳合成できるという特長から複合現実感（Mixed Reality : MR）技術の主要なアプリケーションとして実対象へのアノテーションが利用されている．従来，その手法としてMR技術の一方式であるビデオシースルー方式を利用する研究が盛んに行われてきたが，特殊なデバイスの装着または把持が必要である点などから，例えば博物館の展示品など，一般の方々に見られることを目的とした対象に付与されたアノテーションを提示する場合にはあまり望ましくない．そこで，本研究では実物体の表面に直接仮想情報を重畳させるプロジェクション方式を採用する．投影型MR技術を用いてアノテーションの提示を行う際には，先に述べたアノテーションのレイアウトで留意すべき点に加え，投影型MR固有の問題を考慮しなければならず，特に投影面の状態により投影像の可読性が大きく低下するという問題が大きい．そこで本研究では，対象の三次元形状・表面テクスチャの反射率といった情報をもとに，プロジェクタ投影特有の問題を考慮した，投影面の状態に適応的なアノテーション情報のレイアウトを求めるシステムを提案する．本卒業論文では，投影面の形状・反射率が投影像の可読性に与える影響を調べる基礎実験を行った上で，その結果を利用し投影像の読みにくさの度合いに適応的なアノテーションのレイアウトを行うシステムを実装した．また，実物体を対象として提案システムを適用し，実際にアノテーションの投影を行い，投影像の読みにくさの度合いが高い面を避けてアノテーションを投影することができることを確認した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "images/researches/samakoto.jpg",
        "titleJP": "視点と露光量が任意な画像群からのデフォーカスコントロール",
        "titleEN": "研究者: 楠本 夏未",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2010.",
        "abstract": "同じシーンを撮影した視点位置が疎で不規則な複数枚の画像と，露光量の異なる任意視点画像から被写界深度や焦点面の配置を変更し，それによって生じるぼけの強さや形状を調節できるシステムを提案する．現在，画像の焦点面や被写界深度を撮影後に変更するような研究は多く存在するが，特殊な撮影機器や撮影方法を必要とする．これによって機材を保有する人に撮影者が限定されたり，撮影の機会が限定されてしまう．しかし，普及率が高く，どこへでも手軽に持ち運びできる小型のデジタルカメラでは，設計上十分な大きさのぼけを得る事が出来ず，主要被写体を引き立たせるような作画が出来ない．そこで本論文では，特殊なカメラやレンズを必要としない簡単な方法で撮影した画像から，ユーザの意図した「ぼけ」を含む写真を作成する手法を提案する．これにより，より多くの人がデフォーカスコントロールを手軽に楽しめるシステムの実現を目的とする．従来の焦点面や被写界深度の変更に関する研究は，大きく1) カメラアレイなど，特殊な機器で撮影した多数の画像を重ね合わせるような“light field”の獲得を前提とする方法，2) ステレオ法などを用いて求めた奥行きを利用してぼかすような，シーンのモデル化に基づく方法，の二つに分ける事ができる．しかし，前者のアプローチは特殊な撮像機器や補助機器を必要としており，システムの利用機会，利用者などが著しく制限される．一方，後者のアプローチはシーンのモデル化の精度に限界があるため，これが生成画像の品質に悪影響を及ぼす．そこで本論文ではImage Based な手法の考え方を軸に，カメラパラメータの自己校正や幾何拘束に基づく任意視点画像作成，視点位置及び露光量の異なる画像間でのハイライト部分の対応付けといったコンピュータビジョン分野の手法を組み合わせる事で，撮影時において精密なカメラ制御が不要で，手持ち撮影により得た画像を入力として用いる事ができる，デフォーカスコントロールを実現する手法を提案する．実験の結果，提案手法により，コーナー特徴点のみを利用していた従来の合成開口法よりも滑らかなぼけが再現できる事を確認した．更に，従来手法よりもオクルージョンに強く，シーンの形状に即した画像が生成できることを確認した．また，画像上の光量飽和領域の光量を短時間露光画像から復元する事により，シーン中の光源などの光量が飽和した部分のぼけを良好に再現する事が出来た．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/tsukawa.jpg",
        "titleJP": "既知形状物体の観測による光源方位と拡散反射率のロバスト同時推定",
        "titleEN": "研究者: 立川 雄大",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2010.",
        "abstract": "近年，写真に代わり実物体の3 次元情報を蓄積・提示する計算機システムは様々な分野において利用されている．例えば劣化や損傷が進む歴史的文化財を記録し保存するディジタルアーカイブは大規模な建築物から小さな出土品までを対象として盛んに行われている．中でも3 次元形状は様々な視点からの見えを提示するうえで必要不可欠な情報であるが，その形状情報だけではリアルな画像を再現し提示することはできない．物体表面には固有の反射特性があり，それを基に光の反射をシミュレートすることでリアリティのある画像を再現し提示できる．つまり，物体の幾何的情報と光学的情報の双方を物体の計測により得る必要がある．実物体の3 次元形状を計測する手法については古くから盛んに研究が行われ，現在はレーザレンジファインダ等の計測装置も多く販売されており，これらを用いることで詳細な形状を取得することができる．しかしそれに対し，物体表面全体の反射特性の分布を取得することはより困難である．本論文では形状が既知の物体を異なる照明条件において撮影した２枚の画像から，それぞれの光源方位と物体表面の拡散反射率分布を同時に推定する手法を提案する．提案手法では反射率と照明条件の双方が未知であっても，法線が既知で照明条件が共通の点が５点以上あれば成立する拘束条件を推定に用いる．このとき，鏡面反射や影が外乱として働き誤差を生じる原因になるが，RANSAC を用いて外れ値に対しロバストな推定をすることによりこれらの影響を避ける．シミュレーションといくつかの実物体での実験の結果，鏡面反射や影を含む物体でも拡散反射率と光源方位の推定が可能あることが確認できた．形状既知の場合でも，反射率と光源方位の同時推定は入力画像の枚数が1 枚では不定性が生じ推定が不可能であることから，本論文の提案手法で必要とする画像枚数である2 枚は最小の画像枚数となる．3 枚以上の画像を必要とする他の多くの手法では各光源への方位ベクトルが同一平面上にあるような光源環境下での推定が困難であったが，本論文の提案手法は2 枚の画像で推定できることから，太陽光のようにほぼ平面上を移動する光源環境下での推定が可能であることが実用上の利点である．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/nakai.jpg",
        "titleJP": "スリット型レンジファインダの把持走査による3 次元形状の統合",
        "titleEN": "研究者: 中井 裕文",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2010.",
        "abstract": "本研究では遺跡計測を簡便化するべく，光飛行時間測定法に基づく小型レーザレンジファインダを用いたハンドヘルド型計測システムを提案する．従来のハンドヘルド型計測システムは計測器にマーカや磁気センサなどの位置姿勢取得センサを装着し，計測器の運動を推定することで形状を復元するのが一般的な方法であった．しかし遺跡はさまざまな環境に存在するものであるため，各位置姿勢取得センサが不向きな環境によっては，正確にセンサの運動が推定できない可能性があり，計測精度の悪化に起因してしまうという問題がある．一方，光飛行時間測定法の小型レーザレンジファインダを用いる利点は，奥行き情報を直接計測法に基づいて出力することで，環境光に対してロバストであるという点であり，考古調査現場での計測に適していると言える．システム実現に当たって，本研究で解決すべき重要な課題はレーザレンジファインダの運動パラメータを推定し，時系列的に出力される断面距離データを正確に世界座標でアライメントすることである．問題解決のために本研究では固定カメラを一台設置し，カメラの幾何学に基づいてレーザレンジファインダの運動パラメータを推定する．そして，断面距離データを世界座標に座標変換することで形状を復元する．さらにこの手法を拡張し，スリット曲線の集合が生み出す交点に基づいて，レーザレンジファインダと世界座標との位置関係を再構成し，統合する手法も提案する．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/lic.jpg",
        "titleJP": "Indoor Navigation System using ID Modulated LED Tube Lights",
        "titleEN": "研究者: 李 昶",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2010.",
        "abstract": "Nowadays GPS has been widely used in outdoor positioning. However, the errorgets to dozens meters and the ratio could not reach inside building and tunnel. Thispaper presents the design, implementation, and evaluation of a novel camera-basedinformation transmission system for indoor positioning and navigation. This systemtakes advantage of high-intensity LED tube, which is expected to be mainillumination source for the next generation because of its lower power cost and longerlifetime compared to traditional fluorescent, as the optical maker. LED tubes areencoded to transmit ID information without controlled circuit and the information isreceived by one normal camera. This system is of particular benefits of infrastructureconsumption and portable terminal. In order to estimate the exact 3D position andattitude, we employ units of two parallel LED tubes. The position of user in the worldcould be calculated by the relative position from unit of LED tubes and the position ofthis unit which is stored in database with the index of its ID number. Result ofexperiment shows the accuracy of this system both about location and attitude issuitable for most applications.",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/kehi.jpg",
        "titleJP": "超解像のための画素形状のコード化に関する研究",
        "titleEN": "研究者: 笹尾 朋貴",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2010.",
        "abstract": "近年，CCD やCMOS センサなどの撮像素子の微細化が進んでおり，コンパクトデジタルカメラや携帯電話搭載のカメラなどの小型なカメラでも解像度が飛躍的に向上している．しかしCCD などの撮像素子は画素数が大きくなるほど読み出しに時間がかかる，感度が低下するためぶれやすくなるなどの問題があり，動物体の撮影が困難になる．この問題の一つの対処法として超解像により画素数の小さい撮像系を用いてセンサの解像度以上の高解像度画像を得ることが望まれる．ここで本研究における超解像とは，複数枚の低解像度画像と画像間の位置ずれ情報が与えられたときに，高解像度画像を再構成する処理のことをいう．この技術は，セキュリティー防犯分野では犯人や車のナンバーが映し出された防犯カメラ映像を，医療分野では患部のデジタル画像を鮮明化・高画質化するために利用されている．しかし，現在，超解像に関するカメラ製品や研究は多く存在するが，どれも撮像素子における各画素を矩形（正方形）のままで扱っている．この方法では各画素のサンプリングは点サンプリングではなく有限の面積内の平均となってしまい，正方形の畳み込みによって原画像の高周波成分が失われることになる．従来は失われた情報を何らかの先験的知識を用いて推定することで解像度を向上させていたが，入力画像と使用した知識が異なるとき生成した高解像度画像は誤ったものとなる. そこで本研究では，互いに僅かな位置ずれを持つ複数の画像から，より高解像度の画像を求めるマルチフレーム超解像において，画素形状をランダムとすることにより高性能化を図る方法を提案する．撮像素子上に微細な黒色粉末（レーザプリンタのトナーなど）を散布するなどの方法により画素の受光パターンをランダムにコード化し，これにより高周波成分の損失を抑制することでノイズの増加を抑えつつ，矩形画素を持つセンサよりも解像度を向上させることができることをシミュレーション実験により確認した．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/shita.jpg",
        "titleJP": "符号化開口を用いたステレオ法の頑健化",
        "titleEN": "研究者: 武田 祐一",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2010.",
        "abstract": "画像を入力として距離計測を行うステレオ法において，計測精度は対応点探索の精度に大きく依存する．そのため，対応点探索をより正確に行うアルゴリズムが数多く研究されてきた．しかし，カメラに対して相対的に小さいシーンにおいては，被写界深度が浅くなるため，ぼけにより対応付けが不安定となる．また，ぼけの大きさは合焦面からの距離が大きくなるほど大きくなる性質がある．そこで，本研究ではレンズの開口部を符号化することにより，ぼけによるテクスチャ情報の損失を抑制し，ノイズに対してより頑健なステレオ計測を行うことを目的とする．ステレオマッチングにおいては物体表面のテクスチャなど，画像中の高周波成分が欠落していないことが望ましいので，用いる符号には一様な通過周波数特性を持つものがよい．そこで本研究ではM系列を用いて符号化した．実験を通して，符号化開口を用いることによりマッチングの評価値が，一般的な開口を用いた場合より急峻となり，ノイズを付加したシミュレーションにおいてマッチング誤差が小さくなることが確認された．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/moria.jpg",
        "titleJP": "鏡面・拡散反射成分分離のための照明パターンの最適化",
        "titleEN": "研究者: 森 隆浩",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2010.",
        "abstract": "物体表面で反射する光を, その成分ごとに分離すること, いわゆる反射成分の分離は, 三次元形状計測, 反射モデルパラメータの推定, 物体認識などのための基礎技術として重要である. 例えば, 鏡面・拡散反射成分を分離し, 拡散反射成分だけを含む画像を取得することができれば, ディジタルアーカイブのための形状計測精度や, 顔認識の識別精度を上げることが可能である.反射成分の分離における従来手法は, 拡散反射成分と鏡面反射成分の色の違いを利用する手法, 偏光を利用する手法, 拡散反射成分の自由度に基づく手法, 高周波照明パターンを用いる手法の四つの手法に大別される. そのうち高周波照明パターンを用いる手法では, 色空間解析や偏光板, 基底画像を必要とせず, 任意の色の対象物体に用いることが出来るが, 様々な物体形状や表面反射特性に応じて照明パターンの間隔や種類をどのように変化・決定する必要があるのかは明らかになっていないのが現状である.そこで本論文では, 暗室環境下で高周波照明パターンを用いて鏡面・拡散反射成分を分離する際に, 対象物体の形状や表面反射特性に応じて照明パターン間隔を自動的に調整する手法を提案する. 提案手法では, 対象物体の形状や表面反射特性は未知であり, 前処理としてグレイコードパターンを投影することにより得られたディスプレイ画素とカメラ画素の対応関係から, 適切な照明パターン間隔を算出している.提案手法を用いることにより, 対象物体に応じた適切な照明パターン間隔を自動決定することができ, その結果, 対象物体の鏡面・拡散反射成分を精度よく分離できていることを実験により確認した.",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "user interfaces",
        "photoPass": "images/researches/nakajima.jpg",
        "titleJP": "近接光学シースルー方式複合現実感ディスプレイのための光学補正モデル",
        "titleEN": "研究者: 中嶋 康博",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2009.",
        "abstract": "近年，コンピュータにより作られた仮想空間と実空間とを融合する複合現実感(MixedReality：MR) 技術に関する研究が行われている．複合現実感技術により，ユーザは仮想空間と実空間が融合した空間を体験することができる．このため，複合現実感技術は，アートやエンターテイメント，医療・福祉，教育，建築・都市計画といった幅広い分野での利用が期待されている．この複合現実感技術を用いて，実空間の物体にコンピュータで作られた画像を重畳し，物体の見え方を変化させることができる．このような実空間には存在しない仮想的な情報をユーザに提示することで，物体の色をユーザの意図する色に変化させる色再現の研究が行われている．複合現実感技術を用いた色再現の研究の一つに光学シースルー方式を用いた研究がある．光学シースルー方式を用いることで，小型で安価な色再現システムを構築できる．また，システムを使用する際にユーザは不快感を覚えることはない．この光学シースルー方式を用いた色再現の研究では，ディスプレイとハーフミラーを用い，ディスプレイに表示させたコンピュータの画像をハーフミラーを用いて色再現の対象となる実空間の物体と重畳させることで色再現を行うことができる．しかし，色再現システムと対象物体が近接した際に色再現精度が低下してしまう．そこで，本研究では，色再現精度が低下する原因を明らかにし，システムと対象物体が近接する際に色再現精度の向上を目指す．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/yamamoto.jpg",
        "titleJP": "掌を介した身体インタフェースに関する研究",
        "titleEN": "研究者: 山本 豪志朗",
        "publication": "論文種別・提出年: 博士論文, 大阪大学大学院基礎工学研究科, Mar. 2009.",
        "abstract": "人間は外界への働きかけとして体肢による身体運動を行っている．その中でもしばしば手を巧みに使用し，対象物体に直接または道具を用いて間接的に働きかけることが可能である．しかし，作業によっては，道具の介在に煩わしさを覚え，手で代用することがある．コンピュータに入力を行う場合，手でデバイスに働きかける利用形態が一般的となっているが，作業に応じてデバイスの介在を上要とし，手で直接操作できる環境が望ましい．そこで，手による入力を可能とするハンドジェスチャ認識に着目する．このハンドジェスチャは2 種に分類できる．ひとつは手の構えに意味のある信号であり，もうひとつは対象物体に対して働きかける能動的な動作である．本論文では，能動的に作用するハンドジェスチャにより，デバイスを扱う煩雑さから脱却した，新しいコンピュータの利用方法を示す．特に，非接触計測手法としてカメラによるハンドジェスチャ認識を用いることで，手装着物を要さず，自然体でコンピュータを利用できる環境を目指す．そして，日常生活にて既に習得している動作をジェスチャとして適用することで，ユーザの簡便な入力を実現する．ユーザが動き回りながらコンピュータを利用する環境を，ディスプレイに作用する距離から近接作用と遠隔作用の2 種に分類し，それぞれの環境に対して，デバイスを介在させないインタフェースを提案する．まず近接作用環境において，デバイスを把持することなく，掌のみを用いて入出力を実行するインタフェースを提案する．具体的には，カメラとプロジェクタを利用して，指先同士の接触や指の傾け動作を入力ジェスチャとして認識し，情報提示として掌への光投影を行う投影型ウェアラブルシステムを構築する．このシステムに家電機器を操作するのに充分な入力機構を完備することで，掌だけでネットワークに接続された複数台の機器を統括的に管理できる．遠隔作用環境では，特に大型ディスプレイ表示される情報に直接手の届かない位置からアクセスしたいという要求に対して，掌のシルエットを介したハンドジェスチャによるインタフェースを提案する．離れた位置でも身体と連動して自在に動かすことができる影に着目し，人工的に手影を模した掌シルエットをディスプレイに表示するシステムを構築する．まず，リーチングと掌の開閉の2 種のハンドジェスチャにより，ディスプレイに表示された仮想物体に能動的に働きかけ，任意に選択・移動を可能とするインタフェースを提案する．このインタフェースを用いることで，複数ディスプレイ間にて一貫した動作で，仮想物体を扱うことが可能となる．次に，掌の回転運動を入力機構として適用し，機能性の拡張を行う．この回転運動は，ダイヤルなどの回転する対象に作用するジェスチャであり，回転操作を行うインタフェースとして適用する．さらに，シルエットの動きを制約し，視覚的に抵抗感のように知覚される感覚を与え，ロータリースイッチに類似した機能を実現するための設計指針を得る．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/akaki.jpg",
        "titleJP": "投影型複合現実感のための知覚軽減を考慮したカラーキャリブレーション手法",
        "titleEN": "研究者: 赤木 優子",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2009.",
        "abstract": " 近年，実世界に仮想現実感（Virtual Reality:VR）技術を融合する複合現実感（Mixed Reality:MR）技術の様々な研究が行われており，アートやエンターテイメント，医療・福祉，教育，建築・都市計画といった幅広い分野で利用されている．近年，複合現実感技術の一つの研究であるプロジェクタとカメラを用いたシステム(プロジェクタ・カメラシステム) の研究が行われており，白色スクリーンのような理想的なプロジェクタ投影環境でなくても，任意の反射特性を持つ投影面に対して色再現を行うことが可能になってきている．プロジェクタの低価格化，小型化も進んでおり，今後様々な環境において高い色再現性を実現するプロジェクタ投影への利用が期待される．そのような場合に，ユーザがより円滑に投影システムを利用できることが重要になってくる．しかし，このようなシステム実現のためには，幾何学および色彩に関するキャリブレーション（カラーキャリブレーション）が必要であるが，ユーザにとって上要なパタン画像を複数枚投影する必要があり，ユーザの利用の妨げとなる可能性がある．そこでユーザ利用を妨げないためのプロジェクタ・カメラシステムにおけるキャリブレーションの研究が多く行われているが，本研究では，物体の反射特性を計測するカラーキャリブレーションについて，ユーザが鑑賞している動画を利用することで，精度を維持しつつ，ユーザに知覚されにくいキャリブレーション手法を提案する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/akimo.jpg",
        "titleJP": "シーン輝度分布制御のための光伝播の解析",
        "titleEN": "研究者: 那須 督",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2009.",
        "abstract": "近年のコンピュータグラフィックスの技術の進歩によって，コンピュータによって非常に高品質な画像を生成することが可能となった．特にラジオシティ法などによって，多重反射などを考慮した計算も可能となり，その写実性は実世界に迫るものがある．しかし，これらの多くは画像としてディスプレイなどによって提示されるものであり，実世界のオブジェクトを着色するといったケースでは，複雑な光学的反射現象などによって高い再現性を実現するには至っていない．実世界のオブジェクト上における画像提示の高い再現性の実現にはそのシーン内で起こっている反射現象を解析する必要がある．カメラにより撮影される画像は，シーン内の各ピクセルに対応する物体平面上の輝度情報を記録したものである．しかし，多くの場合被写体自身が発光するのではなく，照明から発せられた光が物体表面で反射することで輝度が決定される．さらに，この反射現象は各点で独立してはおらず，光を受けた点はさまざまな方向に光を反射し，それ自身が二次的な光源のように働き再び他の点を照明する．シーン内において，このような光の反射が繰り返されることでシーンの輝度分布が決定されている．このような複雑な反射現象を単一の画像から推定することは困難である．そこで，プロジェクタのような制御可能な光源を用い積極的に照明条件を変更する．制御された多様な照明条件下におけるシーンを撮影した多数の画像群を得ることでシーン内における複雑な反射現象を解析することが可能となる．しかし，光の反射は入出力ともに，方向と位置の各2 次元の合計8 次元の空間を持つ．その自由度の高さゆえにシーン内の反射表面上のすべての点における反射現象の解析には，膨大な数の画像を得る必要がある．視点の固定や照明条件を限定したとしても計測には多大な時間を要する．ただし，ある点に入射した光は影や減衰などの影響でシーン内の他の点すべてに影響を及ぼすわけではないことからもわかるように，冗長性を多分に含んでいることも事実である．本研究では，反射現象の解析に当たりその冗長性に着目し，光の反射成分を直接反射成分と間接反射成分に分離し，それぞれの特性に応じた効率的手法で反射現象を解析する．また，解析された反射現象を利用し，多重反射などの影響も考慮した上での指定の照明条件下でのシーンの見えのシミュレーション，さらに，その逆の目的とする見えを実現する照明条件の推定を行う．単に形状に応じた投影によって実物体を着色を試みれば，その色が地面に映り込んだり，物体凹部において発生する相互反射などの影響で目標とする色とはずれてしまうことが予想される．しかし，反射現象の解析はこれらの問題も解決することが可能であり，商品撮影や拡張現実感など幅広い応用が期待される．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/yoshio.jpg",
        "titleJP": "複数台プロジェクタによる投影像のぼけ最小化と影除去",
        "titleEN": "研究者: 長瀬 百代",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2009.",
        "abstract": "近年、プロジェクタの小型化・低価格化が進み、学術分野でも投影型複合現実感の研究が盛んになってきている。それに従って、どこにでも投影できるようなプロジェクション環境づくりの一環として、複数のプロジェクタが存在した場合にどのように投影範囲を割り当てれば、最も目的に即した高品位な像が投影できるのかといった研究が進んできている。本研究では、複数台のプロジェクタを用いて、投影対象物体表面に対して焦点ぼけのない解像度の高い像を投影し、また、対象物体の前方に存在する遮蔽物によってプロジェクタ光が遮られた時に投影上可となる領域をできるだけ小さくすることを目的とする。",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/matsushitam.jpg",
        "titleJP": "画像認識と投影型複合現実感技術を用いた書架管理支援システム",
        "titleEN": "研究者: 松下 和弘",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2009. ",
        "abstract": "本研究では，以前読んだことのある書類を本棚から探索する際に，ユーザに本棚に関する情報を提示することで探索の支援を行うシステムを提案する．投影型複合現実感技術を用いてユーザが書類を取り出す前に書類の表紙画像や出し入れの頻度を可視化した情報を本棚に表示することで，ユーザの負担となる書類を取り出す動作の回数を減らす．また，特別な撮影手順やタグ付けを用いることなく本棚に収紊される書類の表紙画像や位置情報をリアルタイムに取得する．探索・ 操作・ 表示空間を一致させることで直観的なインタラクションを実現する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/matsubashi.jpg",
        "titleJP": "超低速光速を模倣した時空間映像インタラクション",
        "titleEN": "研究者: 松崎 圭佑",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2009.",
        "abstract": "現在の映像の再生・編集などの映像操作に関するインタフェースは，GUI (Graphical UserInterface) による2 次元表現に基づくものが主流であり，PC の画面内操作ではなく，3 次元空間中での映像操作に関するインタフェースの研究は少ない．GUI に基づくアプリケーションで映像の操作を行うには，操作に対応したボタンの選択などが必要であり，これらの操作方法は複雑なため，学習コストと作業効率という点で優れているとは言えない．GUI と異なるインタフェースの形式としてTUI (Tangible User Interface) がある．TUI は，入力空間と出力空間を一致させることで直接操作性を高めたインタフェースであり，TUI による映像操作は，よりインタラクティブな映像操作となる．よって，タンジブルな環境で映像や画像などのメディアにインタラクションを行うことを可能にするシステムの開発が有用であると言える．そこで，本研究では映像編集などの実用的な用途を想定したTUI に基づいたインタフェースで映像操作を行うシステムとして，映像があたかも超低速な光としてプロジェクタから投影されていることを模倣する３次元空間インタラクションシステム“ Snail Light Projector”を提案する．超低速な光で映像を投影することで，映像の個々のフレームを実空間中に表現でき，スクリーンの前後の空間にスクリーンに映っている画像の過去・未来の画像を投影する光が存在すると考えられる．よって，ユーザは直接スクリーンを前後に移動させる操作により，映像の任意のフレームを探索することができる．またスクリーンをプロジェクタに対する傾ける操作により，異なる再生時刻のフレームの部分的な画素が入り混ざった時空間映像の断面となる画像を見ることができる．時空間映像の断面画像は従来の映像操作アプリケーションでは表現の難しく，本システムは新たな映像インタラクションシステムとなる．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "design engineering",
        "photoPass": "images/researches/rokda.jpg",
        "titleJP": "ドローイング入力を利用したモーションデザイン- Computer Aided Motion Design System -",
        "titleEN": "研究者: 甲田 春樹",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2009.",
        "abstract": "近年の計算機性能の向上やメディア形態の急激な多様化に伴い，創作活動の在り方が大きく変容しつつある．グラフィックデザインのみでなく動画コンテンツもまた，個人レベルでの創作・発信が可能となり，今後，専門知識を持たない一般ユーザでも容易に動画コンテンツやアニメーションの創作が可能な環境への需要が高まると考えられる．しかし，従来の開発環境のGUI(Graphical User Interface) は複雑で階層化されており，これらのGUI は操作方法の特殊性故に学習コストや効率性の観点において問題であると言える．また，アニメーション作成ソフトウェアの多くでは補間法によるモーションデザインが採られており，加速度的な変化を伴うモーションを扱う場合，ユーザが意図する速度変化を設計するには多くの煩雑な調整作業が要求され，最適な作業環境であるとは言えない．　本研究に於いてはまず，スケッチやデッサンなどの創作活動において，デザイナがペン速度を巧みに調整して描画線の形状を変化させている事に着目し，モーションデザインの入力法としてドローイング入力の適性を調べる実験を行った．実験から得られた結果および知見に基づいて，ドローイング動作の身体性を利用した速度入力を可能とするインタフェースを提案した． 提案したインタフェースを実装しアプリケーションにおいては，ドローイングの描画領域である座標平面を張る軸に対して並進や回転などのモーションの制御変数が割り当てられており，ユーザはペンタブレットを用いてドローイングを行うことによりモーションを作成し，あたかもスケッチするようにモーションデザインが可能である．提案したインタフェースの有用性を調べるため，実装したシステムを用いた被験者実験及び観察実験を行った結果，被験者はドローイングの身体性を利用して直感的に作業を行っていた事，また，ドローイング入力に対してリアルタイムにモーションが出力されることから効率性にも優れていることが示された．また，本システムを用いて作成されたモーションの印象評価実験を行った結果，震えや揺らぎの含まれる擬人的な表現を行いたいモーションの作成に最適である事が示された．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "design engineering",
        "photoPass": "images/researches/kandanic.jpg",
        "titleJP": "印象語によるマチエール創作支援システム- The Computer-Aided Matiere Design -",
        "titleEN": "研究者: 関谷 祐輔",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2009.",
        "abstract": "美術絵画は油絵や水彩画など様々なものがあるが，対象や構図によっては，色彩要素だけではなく，キャンバス表面の質感，すなわちマチエールにも創作意図を込めて描画されている．マチエールを自由に作成することが出来ればアーティストの表現の幅が広がり，アーティストにとって非常に有益である．しかしながら，マチエールの作成は困難で習熟するには敷居が高い．そこで，本研究では，アーティストが所望のマチエールを作成するために，人がマチエールに対して受ける印象とマチエールの持つ画像的な特徴量とを対応付けることによって，印象パラメータを入力とした直感的なマチエール創作支援システムの提案を行う．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "design engineering",
        "photoPass": "images/researches/fujita.jpg",
        "titleJP": "GEONに基づく複合現実感造形デザインシステム -An MR Shape Builder-",
        "titleEN": "研究者: 富樫 淳",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2009.",
        "abstract": "コンピュータ技術の発展に伴い，デザインの行程においてもデジタル化が進んでいる．そして，3DCAD や3DCGソフトウェアを用いることで，高品質の3DCG が仮想空間内にデザインできるようになった．しかし，ユーザが扱うインタフェースは昔から進歩がみられず，3DCG を満足に作成できる環境が整っているとはいえない．例えば，操作環境は2 次元の画面上で行わなければならなく，立体的な物体を操作するのに適した環境であるとはいえない．また，3DCG の表示には，従来から平面ディスプレイを用いられているが，平面ディスプレイは3DCGを三次元から二次元に落として表示しているため，物体の立体感や臨場感が失われているといえる．本論文では，実世界指向インタフェースを用いた新しい造形デザインシステムを提案する．インタフェースは立方体の形をした手のひらサイズのブロックを数個用いる．まず，geon と呼ばれるプリミティブ形状を立方体の形に沿って定義し，その形状をブロック一つ一つで指定できるようにした．指定した形状は，その3DCG をブロックにリアルタイムに重畳させることで表示する．ブロックと複合現実感を利用して立体感や臨場感をユーザに与えることで，直観的な操作を可能とするシステムを作成した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "digital achieve",
        "photoPass": "images/researches/nakayamag.jpg",
        "titleJP": "２Ｄデバイスによる３Ｄフォトブラウジングのための視点切替手法",
        "titleEN": "研究者: 中山 太一郎",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2008.",
        "abstract": "デジタルアーカイブは，写真や 3 次元形状データを取得しデータベース化する技術で，遺跡・遺物の色や形状の保存・閲覧に用いられてきた．近年は，WEB 技術の発展に伴い，データベースとして保存するだけにとどまらず一般的に公開を行うことが求められている．本研究ではWEB上でデジタルアーカイブの閲覧を効率的に行うことができるシステムを構築する．写真は，色や陰影による凹凸情報や周辺の様子が含まれる情報量の多いデータであると考えられるため，本システムでユーザに対して提示するデータは写真として利用する．しかし，写真データではユーザに写真間の位置関係や写真に対象の形状を知覚させることは難しく，さらに，写真は一般的にデータ数が多くなるため，ユーザは望む写真を探すために時間や労力を費やすことになる．そこで，本システムでは，3 次元形状情報をユーザに知覚させるために，3Dデータを用いて写真を3次元的に切り替える．ユーザにとって自然な3次元写真切替は，写真の高速な検索も可能にすると考えられる．さらに，3次元写真切替操作のためのデバイスは一般的に普及している 2D操作デバイスを用いることが望ましい．本論文では，2Dデバイスを用いて3Dフォトブラウジングを行うための一手法として，3次元頂点データを用いて構成したポテンシャル面に沿った視点移動を行う手法を提案した．さらに，Ajaxを用いたWEBアプリケー        ションやスマートデスクシステムで実装し，WEB上で実現できることやマウス以外の2Dデバイスでの操作に対しても応用できることを示した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "sensor network",
        "photoPass": "images/researches/nakata.jpg",
        "titleJP": "カメラと光源を搭載した集中画像処理型センサネットワークの構築",
        "titleEN": "研究者: 中田 周作",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2008.",
        "abstract": "これまでのセンサは主に工場の機械に組み込まれ，制御や品質管理を行うため，あるいは機器や製品に組み込まれて自動化や安全性を向上させるためのセンサであった．しかし，これからのセンサは人が持ち歩いたり身に付けたり，様々な所に数多く分散配置されたり，必要に応じて自分で動き回るようなセンサになると考えられている．そこで，センサと通信機能を持つ小型コンピュータを組み合わせてネットワークを構築するという考えが生まれ，センサネットワークの発端となった．センサネットワークとは，超小型無線通信装置が個々のセンサに内蔵され，センサ同士が自律的に情報の流通を行い，収集したデータからその場に適したサービスを提供するというシステムである．センサネットワークにおいては，各ノードのセンサ情報だけではなくセンシングの位置情報が重要となってくる．そこで，本研究ではカメラと発光源を搭載した集中画像処理型センサネットワークにおける画像計測的アプローチによる位置計測手法を提案する．提案する方式は位置が不明なセンサノードのカメラにより4個以上の位置が既知なセンサノー        ドの発光源を撮影し，画像上の輝点座標とその世界座標の関係から三次元位置および姿勢を推定する．また，複数の位置未知ノードの計測データを複合的に処理する誤差分散化手法を提案し，誤差伝播による誤差拡大を防ぐことにより推定精度の向上を試みる．これらの手法をシミュレーションや試作したセンサノードを用いて実験を行うことにより，精度評価や提案手法の有効性を確かめた．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "sensor network",
        "photoPass": "images/researches/yoshiza.jpg",
        "titleJP": "指数関数型輝度変調に基づく光源方向推定手法",
        "titleEN": "研究者: 清水 知也",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2008.",
        "abstract": "到来しつつあるユビキタスネットワーク社会に向けて，センサネットワーク技術が注目されている．センサネットワークとは，センサノードを様々な場所に設置し，搭載したセンサから情報を収集し，人間にとって有用なサービスを提供するものである．センサネットワークでは，センサ情報だけでなく，それぞれのセンサノードの位置を知ることが重要となる．そこで，本研究では，位置推定の基礎となる方向推定の手法として，LEDの輝度の指数関数型変調に基づく光源方向計測手法を提案する．提案手法は，LEDの輝度を指数関数的に変化させることにより，受光部とLEDの距離によらず輝点方向を推定することができるというものである．この提案手法に基づいて方向推定するシステムを実装し，実験を行い，本手法の有効性を示した．以下に本論文の構成を示す．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "sensor network",
        "photoPass": "images/researches/nakatsu.jpg",
        "titleJP": "LEDをオフセット配置したカメラ付きセンサネットワークの位置姿勢推定",
        "titleEN": "研究者: 中室 英之",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2008.",
        "abstract": "センサネットワークにおいてはセンサ情報だけでなく，センサノードの位置が非常に重要な情報となることが多い．しかしながら，センサノードの位置情報を取得することは非常に困難とされている．センサノードの位置情報取得のための一手法として，カメラ付きセンサノードを用いる手法が提案されている．しかし，これまでのカメラ付きセンサノードを用いた三次元位置同定手法では，カメラとLEDを同一の場所には配置できないことが問題となっていた．本研究では，LEDをオフセット配置したカメラ付きセンサノードを試作し，これまで問題であったカメラ，LED間のオフセットを利用した実スケールでの三次元位置同定手法を提案する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/yosuda.jpg",
        "titleJP": "三次元形状に適応的な投影型インタフェース",
        "titleEN": "研究者: 脇安 秀喜",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2008.",
        "abstract": "GUIに替わる新しいインタフェース手法として実世界指向インタフェースという考え方が近年注目されている. 実世界指向インタフェースとは，計算機内部のデータと現実の事物の閣のギャップを最小にするととによって，計算機を意識するととなく透明な存在として活用する手法の総称である. 実世界インタフェースの研究の一分野として，机を対象としたものがある. 計算機の画面をディスプレイではなく，プロジェクタを使って机の上に投影するととにより，計算機のデスクトップと本当のデスクトップを同じ感覚で扱うととを可能にし，また机の上をカメラで撮影するととによりユーザの動きや机上のオブジェクトを計算機データとして扱うととができるものである.との分野において多くの研究がなされているが，いずれも平面を対象としたものであり，環境に大きな凹凸がある場合には対応していない. 本研究では，環境の三次元形状を計測し，その形状に合わせて適切な場所にインタフェースを投影するシステムを提案した.光の投影に対して本来邪魔であるはずの凹凸の形状を利用し，その形にそって投影するととで，むしろ平面上のみに投影した場合よりもより自然な実世界指向インタフェースを実現するととが狙いである. また，実環境に対し提案システムを適用し，環境に応じて投影インタフェースの種類と位置が変化することを確認した.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "design engineering",
        "photoPass": "images/researches/sakamotoc.jpg",
        "titleJP": "テキスタイルデザインの創作支援システム - The art of MOJA patterns -",
        "titleEN": "研究者: 坂本 武士",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2008.",
        "abstract": "フラクタルは審美的な魅力をもっていると言われており，フラクタル構造をもつ模様（フラクタルパタン）がテキスタイルデザインの分野において利用されつつある．しかし，フラクタル構造を生成するアルゴリズムであるL-Systemはテキスタイルデザインを対象としたものではなく，L-Systemでは意図したフラクタルパタンを得ることが困難であった．フラクタルパタンを用いたテキスタイルデザインを実現するためには，意図したフラクタルパタンを容易にデザインできる必要がある．そこで本研究では，フラクタルパタンを用いたテキスタイルデザインの実現を目指し，審美的なフラクタルパタンを自在にデザイン可能なフラクタルパタンデザインシステムの構築を行う．この目的のため本論文では，拡張Parametric L-Systemによる審美的なフラクタルパタン生成手法，フラクタルパタンの印象解析手法，拡張Parametric L-SystemとInteractive GAを組み合わせたフラクタルパタンデザインシステムの３点を提案する．これらの提案により，審美的なフラクタルパタンがデザイン可能であることを示す.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "design engineering",
        "photoPass": "images/researches/maeda.jpg",
        "titleJP": "ハンドドローイングのコンピュータ支援に関する研究",
        "titleEN": "研究者: 宋 寛勝",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2008.",
        "abstract": "近年，工業デザインや建築，そして漫画などの分野では，コンピュータの利用が盛んになっている．しかしながら，工業デザイナ，建築家，漫画家は作りたいもののイメージをまずハンドドローイングによる手描きラフスケッチによって表現する．本論文では，創作活動の初期のステップで行うハンドドローイングに対するコンピュータ支援システムを二つ提案する．一つ目は，ハンドドローイングを行う全ての人をターゲットユーザとする「hyperdraw: 推定ガイドラインのリアルタイム提示によるハンドドローイング支援システム」である．二つ目は，手描きパース制作を行う建築家や漫画家等をターゲットユーザとする「Hyperspective: パース制作中の消失点移動と補助線提示による手描きパース制作支援システム」である．両者の評価のために被験者実験を行った．hyperdrawに関しては，推定ガイドラインの提示がイメージ通りの線を描くことを支援していたかどうかを検証した．Hyperspectiveに関しては，「パースの補助線の提示機能」と「描画中に消失点を移動できる機能」の有効性を検証した．被験者実験の結果，提案システムのハンドドローイングに対する支援が有効であることを確認した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "images/researches/kawashima.jpg",
        "titleJP": "動的環境における未知事象検出に関する研究",
        "titleEN": "研究者: 川端 聡",
        "publication": "論文種別・提出年: 博士論文, 大阪大学大学院基礎工学研究科, Mar. 2008.",
        "abstract": "ある事象が未知であることを，その事象のみから説明することは不可能である．一方，ある事象が既知であるか否か，つまり「過去に経験したか否か」という問いに答えることは可能である．これは過去に経験したことを既知とし，その事象と比べることができるためである．従って，ある時点までに生起した事象を集め，それにより構築したデータベースに新たに生起した事象が含まれるか否かを正しく判定することができるならば，その事象が既知か未知かを知ることができる．本論文は画像列として与えられた既知の事象をつぶさに記述することで，未知事象を含む画像からその領域を選り分け検出する枠組みを示すものである．具体的には画像を高次元空間中の特徴量とみなし，それに部分空間を当てはめることで既知事象のモデル化を行う．この部分空間は，既知事象の画像列に対する主成分分析で算出される固有基底によって構成される．つまりこの部分空間は，平均二乗投影誤差を最小にするという意味で最適なものである．そしてこの空間内において未知物体により隠蔽された領域を実時間で推定するための枠組みとして，高速に推定が可能な繰り返し投影法を提唱する．更に非線形射影によって画像空間の既知事象を高次元或いは無限次元の特徴量へ変換すると，この特徴空間における部分空間は画像空間における部分空間より既知事象を精細に記述できることを示す．この際，カーネル主成分分析などで用いられるカーネルトリックを適用することによってこの高次元特徴空間上での演算を回避しつつ，提案する繰り返し投影法を非線形特徴量を扱う高速な推定法へと拡張する．最後に未知物体領域のシルエットを利用した未知事象検出として，特定領域への侵入を判定するシステムを提案する．ここでは3次元空間中における未知物体の侵入状態が射影変換に対して不変であることを利用し，未較正カメラによる射影復元によって煩雑な較正作業を回避できることを示す．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/kawanaka.jpg",
        "titleJP": "カーネル主成分分析による事例学習に基づく陰影からの形状推定",
        "titleEN": "研究者: 川中 昇平",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2008.",
        "abstract": " 3次元コンピュータグラフィックス (3DCG) による動的な３次元情報提示技術は，静止画像よりも人間に高い現実感を提供する．3DCG では対象を視点を変更させて見ることができ，陰影の変化やハイライトの移動から金属やプラスチックといった物体特有の質感を得ることで物体のより詳細な情報を認識することができる．したがって，近年では 3DCG の用途はアニメ，ゲームのみならず，カーナビゲーションや仮想観光システム，医療など様々な分野に応用されているが，物体やシーンの色・形状情報や物体表面の反射特性，環境の光源分布などのレンダリングパラメータの取得コストの高さがその普及を妨げている．特に映像描画部分では物体表面の凹凸や法線方向を利用して現実感のある表現が可能となっているが，このような情報をレンジファインダなどにより対象物全体にわたり取得するためには非常に大きな労力が必要であるため，簡易な形状計測法が必要とされている．2D の静止写真から形状を推定する研究は古くから行われているが，表面の反射が拡散反射，表面が滑らか，光源位置が既知，などの拘束条件を仮定して物体の反射率分布と表面の傾きの関係を線形的に表すことで，解析的，演繹的に解くことが多かった．一方，人間は写真のような静止画像からでも物体・シーンの形状や反射特性を想像することができるが，これは人間が様々な環境の中で視覚情報と 3 次元形状，反射特性との対応を事例ベースで日々学習しているからである．したがって，多くの事例を学習することで画像の色情報から帰納的に物体の形状を推定することが可能であると考えられる．そこで本論文では表面の色と法線との相関性を非線形主成分分析を用いて学習することで，光源位置，反射特性が未知の物体表面の法線方向を推定する．実験の結果，拡散反射などの単純な物体のみならず，鏡面反射や異方性反射などの複雑な反射をする物体の表面の法線方向を視覚的に良好に推定することができた．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/takada.jpg",
        "titleJP": "2平面の距離計測に基づく3次元環境モデル生成",
        "titleEN": "研究者: 高田 健吾",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2008.",
        "abstract": "コンピュータの処理能力の向上に伴い，複合現実感やディジタルアーカイブなど様々な分野において，3次元環境モデルを利用する機会が増加している．現状ではそれらのモデル生成を手作業に頼っている部分が多く，実環境の計測から簡単にモデルを生成する手法への期待が高まっている．環境の3次元形状計測を行う場合，計測装置に対し背面となる領域の形状は取得できないため，欠損のない環境モデルの生成には，少なくとも複数回のレンジファインダの移動が必要となる．移動が必要であるのならば，一回の計測から広域の距離画像を取得するレンジファインダを用いなくとも，より小型で安価な平面内の距離を取得するレンジファインダを，移動させながら計測することによって対象の3次元モデルを取得できる．そこで本研究では2台の平面計測レンジファインダを用いて，1台の計測値から平面に沿った3自由度運動を推定し，他方のレンジファインダから得た距離情報を統合することから環境モデルを構築する手法について検討する．また一般的な環境下では段差や斜面などが存在し，そのような環境において，平面に沿う運動制約のもとでは移動できない領域が生じる．そこで初期計測点において周辺環境モデルを構築し，それに2平面内の距離計測結果を位置合わせすることにより，計測器を制約なく6自由度運動させながら3次元環境モデルを計測するシステムの構築を目指す．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/yoshiko.jpg",
        "titleJP": "表面下散乱の抑制による三次元形状計測の高精度化",
        "titleEN": "研究者: 古瀬 達彦",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2008.",
        "abstract": "計算機による物体形状の蓄積や処理は様々な分野で必要とされている．それに伴い近年，三次元形状計測のニーズが高まっている．そのため様々な計測手法が提案され，産業分野で実用化されているものもある．三次元形状計測のうち光を用いた方法では，物体の表面で光が反射されることを前提に，投影光に対する反射光の位置を観測することによって計測を行なっている．しかし光の反射は複雑な現象であり，必ずしも物体の表面に光が入射した位置のみで反射するとは限らない．一般に物体の表面で反射された光には直接反射成分と間接反射成分が含まれる．直接反射成分とは投影した光が物体の表面に達し，その点で反射する光のことを言う．一方，間接反射成分とは投影した光が物体の表面に到達した点とは異なる点から射出される光のことを言う．よって半透明物体など間接反射成分を含む物体では投影した点と反射した点の位置がずれるため計測精度が悪化する．そこで本研究ではスリット光投影法において間接反射成分のうち表面下散乱や相互反射を抑制することにより精度よく計測を行う方法を提案する．これにはまず直接反射成分と間接反射成分を分離する必要があるが，その方法としては空間的な高周波パタンを投影する手法を用いる．本研究ではスリットを点線状にすることによって高周波パタンとすることで高精度化を図る．また高周波パタンにより計測精度が向上することを示すだけでは，様々は種類の物体に対し，具体的にどのような高周波パタンを用いれば効果的であるのかはわからない．そのためM系列を利用したスリット光を用いて，スリット光投影時の表面下散乱の影響についても解析を行い，最適な高周波パタンを求める．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/sokawa.jpg",
        "titleJP": "合成開口撮影法によるデフォーカスコントロール",
        "titleEN": "研究者: 楠本 夏未",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2008.",
        "abstract": "本論文では，一般的なコンパクトデジタルカメラを使って撮影した複数の画像からぼけを作り出し，ユーザが撮影後自由にぼけの強さや配置を調節することができるシステムを提案する．現在，デフォーカスコントロールに関するカメラ製品や研究は多く存在するが，どれも特別な機材や撮影法を必要とする．これによって機材を保有する人に撮影者が限定されたり，撮影の機会が限定されてしまう．しかし，どこへでも手軽に持ち運びでき，普及率の高い小型のデジタルカメラでは，十分なぼけを得ることが出来ず，主要被写体を引き立たせるような作画が出来ない．そこで本論文では，特別なカメラやレンズを必要とせずコンパクトデジタルカメラのみを使用し，簡単な方法で撮影した複数視点からの画像群をもとに，ユーザの意図した「ぼけ」を含んだ写真を，撮影後，合成開口撮影法により作り出す手法を提案する．これによって，より多くの人が手軽にデフォーカスコントロールを楽しめるシステムの実現を目的とする．従来の合成開口撮影法に関する研究では，ぼけの美しさの追求や評価が十分になされていない．そこで本研究では，ぼけの生成段階で様々な「ぼけ味」を作り出すことも目的とする．奥行き情報や撮影点の位置関係を利用することによって，ぼけの大きさや形状，重み付けの変化を行い「ぼけ味」に変化をつける．以上のようなシステムを構築し，そのシステムで作成したぼけ画像を評価することで，提案システムの有効性を確かめた．その結果，提案システムでは実際の口径で得られるぼけより大きなぼけを得ることができ，従来の合成開口法によるぼけよりも滑らかで多様なぼけを得ることができた．また，作成した画像の評価実験からは，意図したぼけが生成されたことを確認し，ぼけ像の変化に対する人間の知覚についての知見を得た．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/nakagai.jpg",
        "titleJP": "ハンドヘルド型レンジファインダとカメラを用いた３次元形状計測",
        "titleEN": "研究者: 中井 裕文",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2008.",
        "abstract": "遺跡や文化財などの形状や色，文字をデジタル保存するデジタルアーカイブの需要が高まってきており，特に近年の計測器の進歩，普及によって遺跡，文化財の３次元計測技術はデジタルアーカイブの有力な手段として注目されている．しかし，遺跡の中には足場が悪く，狭い場所が多く存在し，構成要素が固定された大型のレンジファインダではデータ統合のための満足な情報を取得できない可能性がある．大型計測器の設置が困難な場所にある遺物や狭い通路や３次元形状取得のためにハンドヘルド型の計測器を用いる方法が考えられる．従来のハンドヘルド型計測システムは計測器にマーカや磁気センサなどの位置姿勢取得センサを装着して計測器の運動を推定しながら３次元形状を取得するというのが一般的な方法であった．しかし遺跡はさまざまな環境に存在するものであるため，各位置姿勢取得センサが不向きな環境によっては，正確にセンサの運動が推定できない可能性があり，計測精度の悪化に起因してしまうという問題がある．本研究では，上記２つの問題を解決するために，ハンドヘルド型レンジファインダと固定ビデオカメラを用い，位置姿勢推定センサを使用せずに３次元形状計測を行う手法を提案する．ハンドヘルド型レンジファインダと固定ビデオカメラから逐次距離データとスリット細線を取得し，データどうしの対応関係を求めることによって得られる射影変換行列からハンドヘルド型レンジファインダの位置姿勢を推定するという方法である．このシステムを用いることによって遺跡内における計測が困難な場所において環境にある程度依存しないハンドヘルド型計測器でリアルタイムに３次元形状を取得できると考えられる．本論文では提案手法を用いてオフラインでデータ統合を行う試作システムを構築し，簡単な形状を持つ物体の３次元形状が計測可能であることを示した．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/souda.jpg",
        "titleJP": "爪画像を用いた指先接触判定",
        "titleEN": "研究者: 杉田 尚基",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2008.",
        "abstract": "従来，ディスプレイは一方的に情報を提示するものであった．しかし近年，ユーザがディスプレイ表面に対して働きかけを行うことができるインタラクティブディスプレイが，我々の身の回りにも普及してきている．インタラクティブディスプレイは，ディスプレイ面に直接指を触れることで，直観的な操作を可能にしている．一方，近年のプロジェクタ技術の発展により，投影型ディスプレイ技術が注目されている．この技術は，情報表示機能を持たない実物体の面上に様々な情報を重ね合わせて表示することを可能とする．この場合，上記のようなディスプレイ面に直接指を触れることで操作するシステムを作ることは容易ではない．なぜなら現在普及しているインタラクティブディスプレイの多くでは，指の接触および位置判定にタッチパネルを用いているが，これを全ての接触対象に組み込むことは現実的でないからである．そこで対象物体に装置を組み込むことなく，指の接触および位置を求める手法が求められている．そこで，いかなる物体表面においても適用可能な，カメラを用いた指先の接触判定法を提案する．本手法では，指先を硬物体に押し当てると爪の色模様が変化する性質を利用することで接触判定を行う．これにより，ユーザの触感覚を妨げず，かつ場所を限定しない指先接触判定が可能となる．また実験を通して，指先の接触および物体表面に加える力の方向判定を行い，本手法の有効性を検証する．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/takawa.jpg",
        "titleJP": "照明条件の異なる画像からの光源方向と反射率の同時推定",
        "titleEN": "研究者: 立川 雄大",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2008.",
        "abstract": "3DCG (3次元コンピュータグラフィックス)は，計算機の性能向上や小型化・可搬化に伴い，用いられる場面や用途が急激に増加している．これらは，様々な視点から撮影された画像のデータベースとは異なり，対象を自由な視点から観察することが出来るため，対象物体全体の把握から細部の確認までを連続的に行うことが出来ることが利点として挙げられる．そのため，文化財の3次元形状や反射特性を含んだ3次元情報を記録するディジタルアーカイブも近年盛んに行われており，形状や反射特性の計測技術は3DCGにおける提示手法の発展に伴い重要となっている．実物体の3次元形状データの表面に色彩情報を定義するとき，対象の写真をテクスチャとすることがよくあるが，複数の写真をつなぎ合わせると撮影時の光源環境に起因してテクスチャの陰影や，テクスチャ接合部の境界が現れてしまい不自然になるという問題が起こる．そこで，本論文ではある特定の照明条件下の物体表面の輝度分布であるテクスチャマッピングではなく，物体表面の反射率分布を推定することにより，テクスチャの陰影・境界における不自然さの問題の解決法を提案する．提案手法では対象物体の幾何学的形状が既知であるという前提のもと，2枚のテクスチャが物体表面上で重なる部分について光源方位・拡散反射率と法線方向の間に成立する条件を用いることで，光源方位と各点の反射率を同時推定する．テクスチャの代わりに反射率を色彩情報として用いることで陰影・境界の問題点を解決できる．シミュレーション実験といくつかの実物体での実験の結果，相互反射などが起こらない理想的な面ならば反射率の推定が可能で，自然なテクスチャを得られることが確認できた．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "digital achieve",
        "photoPass": "images/researches/minata.jpg",
        "titleJP": "RFID を用いた作業映像の記録・管理システム",
        "titleEN": "研究者: 南部 俊輔",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2007.",
        "abstract": "作業時に作業記録をつけておくことにより，後の作業を効率的に行うことができる．また，作業記録として映像データを記録しておけば，作業後に作業の検証を行う際や，第三者に作業の様子を伝える際に効果的に利用できる．そこで，本研究では RFID の非接触認証機能を利用することで，作業映像を自動で記録し，効率的に参照できるシステムの構築を目指す．具体的には，作業対象に IC タグを取り付けることで，作業者の作業対象への接触を感知し，それをトリガとして自動的に作業映像の記録を行う．また，作業場面ごとに IC タグから得られる作業者情報や作業場所情報などのメタ情報を記録映像に付加して保存する．付加されたメタ情報によってデータの管理が容易になる．さらに，作業対象に付加されたタグを読み取ることで直観的な記録映像の検索を可能とする．本論文では，システムの提案に加えて，システム構築のための基礎実験，および試作システムの実装と検証実験を行い，有効性を確認した．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "digital achieve",
        "photoPass": "images/researches/tsukida.jpg",
        "titleJP": "考古調査情報共有のための写真ブラウジングシステム",
        "titleEN": "研究者: 鷹田 陽介",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2007.",
        "abstract": "考古調査におけるミーティングは，図面を机上に広げて行われることが多い．その図面を用いて議論をし，調査計画や調査報告を行う．そのとき提示される調査データや写真は，膨大な量であり，管理が十分にされていない場合は提示する側と提示される側との間で情報共有にかかる負荷が大きい．本研究では，考古調査のミーティングにおける情報共有を支援することを目的とし，調査データへの直観的なアクセス，実空間との幾何整合性が高い調査データの提示を目指す．本論文では調査データとして写真を扱い，考古調査において重要な要素となる位置情報を用いて写真の管理，写真へのアクセスを行い，実空間と幾何整合性の取れた写真提示が可能となるシステムを提案する．図面上に置かれたディスプレイの位置・方位をシステムの入力とし，その位置・方位に対応する実空間の位置・方位で撮影された写真を，システムの出力としてディスプレイに表示する．被験者実験により，本システムは，直観的な操作，写真へのアクセス，写真の提示が可能であり，また本写真提示手法は実空間との幾何整合性が高いことが示された．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "design engineering",
        "photoPass": "images/researches/edac.jpg",
        "titleJP": "デザイン言語に基づいた３次元形状モデルの検索のための形状表現法",
        "titleEN": "研究者: 江田 幸弘",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2007.",
        "abstract": "近年のコンピュータ技術の発達によって，テキスト，画像はもとより，3次元形状データもまた膨大な量がコンピュータに保存されるようになってきた．このように大量に蓄積されたデータから目的のデータを検索する技術は必要不可欠になると考えられる．しかし，従来の手法では，Web上の莫大な3次元モデルを大まかなカテゴリに分類するための検索がほとんどであり，3次元形状のデザイン印象や感性はほとんど考慮されておらず，造形美術や工業デザインの検索は不向きであった．そこで，本研究では，実物体から生成した3次元形状モデルを使用し，かつ人が3次元形状に対して受けるデザイン印象や感性を考慮した3次元形状表現法を提案する．具体的には，人が3次元形状に対して受ける印象と3次元形状モデルの特徴量を対応付けることによって，印象パラメータをクエリとした直観的な3次元形状モデルの検索システムの提案を行う．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "design engineering",
        "photoPass": "images/researches/kandani.jpg",
        "titleJP": "コンピュータグラフィックスによる質感表現可能な絵画制作支援システム",
        "titleEN": "研究者: 関谷 祐輔",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2007.",
        "abstract": "美術絵画は一般的に，色彩要素だけではなく，キャンバス表面の質感，すなわち凹凸などの3次元形状を含んで描かれている．本研究では色彩要素に合わせて，任意の距離画像を用い，3次元CGによって表面の3次元形状をもつ立体キャンバスを生成することを目的とする．また，元来絵画作成において，オリジナルの質感を作成することは難しいとされている．そこで本研究では，距離画像のデプス情報を混合することにより，オリジナルの質感作成を支援するシステムを提案する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/iwai.jpg",
        "titleJP": "熱現象を媒介とする実世界指向インタフェースに関する研究",
        "titleEN": "研究者: 岩井 大輔",
        "publication": "論文種別・提出年: 博士論文, 大阪大学大学院基礎工学研究科, Mar. 2007.",
        "abstract": "熱は、我々の存在する実環境中に遍在している。そして、実物体同士の接触や空気の流れ、太陽からの輻射熱等によって、環境中の熱は絶えず変化を続けている。同様に、人が環境中に存在していることで、意図するしないに関わらずそこに熱の変化を引き起こしている。人が何らかの動作を行えば環境の熱は否応なく変動し乱される。このように、熱現象は我々の身近な物理現象であるにもかかわらず、これをコンピュータへの入力として用いるインタフェースの研究はこれまで行われてこなかった。本研究では、実物体表面の熱分布そのものを仮想空間への入力情報として利用することで、ユーザが実物体を介してデジタルデータの操作を行うことのできるインタフェースの構築を目指す。日常空間の実環境中でその熱分布に変化を引き起こすことは、我々が無意識下で常に行っている行為である。このため、これを入力とするシステムを構築することで、ユーザを自然にコンピュータ操作へと導入することが可能となる。また、提案するシステムの出力としてプロジェクタ投影を用い、操作された仮想空間内の情報を実物体に対して直接光学的に重畳することでユーザに提示する。これにより、ユーザに物理的拘束のない情報提示を可能とし、日常生活の中でスムーズにシステムからの支援を享受できるようなインタフェースの構築が可能となる。本研究では、これらの入出力機構を採用することで入力出力双方が同一の実物体を介する実世界指向インタフェースを構築し、直観的なマン‐マシンインタラクションを実現する。 具体的には、熱画像処理技術と投影型複合現実感技術（プロジェクタを用いて実空間と仮想空間とを融合する技術）とによる実世界指向インタフェース（実世界に存在する事物を介する直観的なヒューマンコンピュータインタラクション技法）を提案した。ユーザがある物体に接触する際に物体上に熱が残るという現象を利用し、実シーンの温度分布の時系列データを熱画像として取得・処理し、実空間中の面へのユーザの接触を検出する手法を提案した。これにより、従来、当研究分野において課題となっていたユーザに非侵襲な形での接触検出を可能とした。そして、この接触を入力とし、プロジェクタよりインタラクション結果を投影出力するシステムを構築した。提案した'ThermoPainter'では、従来マウスとペンという固定されたツールのみしか利用することの出来なかったコンピュータでの描画において、実世界で通常用いられる描画ツールを直接用いること可能とした。熱画像を用いて検出した面上の高温変化領域に直接プロジェクタ光を投影することで、ヘアドライヤや絵筆といった道具のみならず、ユーザの手・指や呼気を直接用いた描画を可能とした。'Limpid Desk'は、書類で溢れる実机上での書類探索作業を効率化するために、書類スタックを投影光によってその場で仮想的に透明化するシステムである。熱画像処理を用いて実机上の書類スタックへのユーザの接触を検出し、その接触動作をトリガとして、あらかじめデータベースに蓄えられているスタック内の書類の表面テクスチャ画像を、あたかも書類が上から順に透明になるかのように処理して投影することで、積まれた書類を物理的に移動させることなくスタック内の書類を探索可能とした。",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/aokim.jpg",
        "titleJP": "複数プロジェクタの重畳投影による投影面の反射特性を考慮した高色再現ディスプレイの構築",
        "titleEN": "研究者: 青木 洋一",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2007.",
        "abstract": "近年，プロジェクタは小型化・低価格化・高輝度化が進んでおり，手軽に利用できるディスプレイ装置の一つになっている．従来，プロジェクタを利用する際には部屋に設置した専用の白色スクリーンの上に投影することが主であったが，上記のような理由から白色スクリーン上でなくても十分実用に耐えうる環境が整いつつある．本研究では，プロジェクタとカメラを利用したディスプレイシステム（これを一般に，プロジェクタ-カメラシステムと呼ぶ）を利用して，任意の反射特性を持つ投影面に対して，所望の目標色・画像を投影する手法を提案する．白色一様でない投影面に目標色を再現する研究は従来から多数報告されているが，色再現を行うことに重点を置いた従来研究は，プロジェクタを1台のみ用いたものであるため，目標色再現を阻害する問題をはらんでいる．本論文では，この問題を明らかにするとともに，複数のプロジェクタを利用することでこの問題を解決する手法を提案し，より色再現性の高いディスプレイの構築を目指す．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/tsuda.jpg",
        "titleJP": "投影型複合現実重畳による三次元形状デザイン支援",
        "titleEN": "研究者: 久田 理",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2007.",
        "abstract": "本論文ではプロジェクション方式による実物体の仮想変形システムを提案する。従来のプロジェクションMRによるディスプレイシステムは実オブジェクトが有する立体感、実在感といった点においては有用である。しかし、工業製品の形態デザイン・意匠設計においては試行錯誤を繰り返し行い製品開発していくため、実物体の色の見えや質感等の表面属性に加え形状情報の変更も頻繁に行われる。そのため、投影したい物体形状の数だけ投影用の実物体が必要である従来手法では上十分である。本論文ではこのプロジェクション方式を仮想情報提示手法として用い、実物体上の適切な位置に人間の視覚特性を考慮した光学パタンを投影することで、実物体の仮想的な形状変形を実現する。これにより高い立体感を持った新たなディスプレイシステムを提案し、実物体ベース三次元形状造形デザイン支援システムの構築を目指す。",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/nakamurap.jpg",
        "titleJP": "シーン状況の認識に基づく作業過程の記録と支援情報の提示",
        "titleEN": "研究者: 中村 太祐",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2007.",
        "abstract": "計算機技術の発達に伴い三次元計測は様々な分野で利用されているが，その利用分野の一つに作業支援がある．例えば遠隔地間の協調作業では作業中のシーンを計測により三次元モデル化し遠方の支援者へ伝えることで，作業を的確に認識・把握させることが可能となる．同様に自動車におけるボディ表面への映り込みの評価や空力設計など計算機シミュレーションにも三次元形状は利用できる．これら支援者もしくは計算機により得た支援情報を複合現実感技術により実物上に重畳表示するためにも三次元形状モデルは上可欠である．このように三次元形状モデルの獲得は作業支援に有用であるが，三次元形状計測技術の多くは静止物体を対象としているために作業により動的に変化するシーンを計測することができなかったり，光の投影が目障りとなるなど作業者に何らかの負担をかけるものであった．そこで本研究では作業者に負担をかけることなく作業シーンの三次元形状計測を行うシステムの構築を目指す．また，獲得した三次元形状モデルを利用した作業支援システムとして，作業シーンを記録・再現するシステム及び形状デザインの支援情報を提示するシステムの二つを提案する．まず，作業シーンの記録・再現を行うシステムでは作業者に知覚されずに計測を行うために上可視の赤外線を用いたグレイコードパターン光投影法によりシーンの三次元形状計測を行う．このとき計算機への負担の軽減から，グレイコードパターン光の投影によって得られる空間コードを用いてシーンの領域判別を行う．シーンの変化があった領域のみ計測を行い，その部分を更新していくことでシーンの変化を記録していく．また，記録したシーンの三次元形状モデルを再現表示するアプリケーションを試作する． 次に支援情報を提示するシステムではプロジェクタより実モデル上に映り込みを投影し再現することで形状デザインの支援を行う．形状のデザインにおいて映り込むハイライトの形により面のつながりや滑らかさが評価される．作業者は評価のため少し離れた位置から対象モデルの観察を行うことから，作業者がシーンから離れた時に自律的に計測を開始することで作業者に負担をかけずに計測を行う．また，作業者の頭部位置にLEDを設置し，画像中の鏡面球に映ったLED位置から視線方向を導出し，計測により得られた三次元形状から物体の法線方向を求める．導出した物体の法線方向と作業者の視線方向を用いて鏡面球の画像をスフィアマッピングすることにより対象の映り込みを求める． 最後にこれら構築したシステムを用いて簡単な実験をし，その有効性について検討を行った．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/kaiwa.jpg",
        "titleJP": "Using Artificial Shadow as Intermediate to Realize Distant Human-Computer Interaction",
        "titleEN": "研究者: 徐 会川",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2007.",
        "abstract": "This paper proposes both concept and experiments of a new shadow-based human-computer-interaction technique for indoor ubiquitous user interface. On one hand we constructed a computer-controlled responsive environment which perceives user's body information by sensing his/her shadow and provides visual feedback by projecting computer-generated artificial shadow. On the other hand, we also aimed to realize natural human-computer interaction by taking advantage of our mental model of very common shadow phenomenon in our daily life.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/aokis.jpg",
        "titleJP": "投影型複合現実感による実物体ペインティング",
        "titleEN": "研究者: 赤木 優子",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2007.",
        "abstract": "近年，実世界に仮想現実感（Virtual Reality:VR）技術を融合する複合現実感（Mixed Reality:MR）技術の様々な研究が行われており，アートやエンターテイメント，医療・福祉，教育，建築・都市計画といった幅広い分野で利用されている．この MR 技術を用いて，実空間に存在する対象物体に対して仮想像を重畳表示し，対象物体の見え方を変化させることができる．MR 技術の一方式であるプロジェクション方式を用いて，対象物体の形状に合わせて巧みに作られた映像を投影し，実物体の見え方を変化させる研究や，任意の反射特性を持つ実物体に対して目標の色の見えを実現する，色再現の研究も行われている．これらの研究は，彩色デザインシステムや色彩が劣化した絵画や文化財の色修復などへの応用が期待できる．このような MR のプロジェクション方式を用いた実物体の仮想的な彩色システムを考える場合には，ユーザが彩色する領域を適切に抽出する必要がある．本論文では，実物体の反射特性に着目して領域を抽出する手法を提案する．対象物体に対して複数のパターン光を投影し，この様子をカメラで撮像することで物体の反射特性を調べ，類似した反射特性をもつ領域をシーンから抽出する．素材が異なる物体がカメラでは同一色と判断される場合や，環境光の影響で物体の色の見えが変化する場合など，領域抽出が困難である場合がある．このような場合に，本手法によって，環境光の影響を受けることなく，効果的な領域抽出が期待できる．この領域抽出手法を用いて，実物体に対してインタラクティブに仮想的な彩色を行うシステムを提案する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/budeta.jpg",
        "titleJP": "直接成分と間接成分の分離に基づく照明光の伝播解析",
        "titleEN": "研究者: 那須 督",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2007.",
        "abstract": "カメラによるり撮影される画像は，シーン内の各ピクセルに対応する物体平面上の輝度情報を記録したものである．しかし多くの場合，被写体自身が発光するのではなく，照明から発せられた光が物体表面で反射することで輝度が決定される．この反射現象は各点で独立してはおらず，光を受けた点はさまざまな方向に光を反射し，それ自身が二次的な光源のように働き再び他の点を照明する．シーン内において，このような光の反射が繰り返されることでシーンの輝度分布が決定されている．このような非発光点が再度，照明のように振舞って別の点を照らす現象をグローバルイルミネーションと呼び，本論文では特定のシーンに関するこの現象を数値モデル化する手法について述べる．これが実現すれば，そのシーンに対する照明効果のシミュレーションや仮想物体の自然な合成，プロジェクタによる投影像の品質向上など様々な応用が期待される．従来，グローバルイルミネーションの理論的解析や応用はラジオシティ法に代表されるようにコンピュータグラフィックスの分野で大きく発展してきた．しかし，コンピュータビジョンにおけるシーン解析の問題として考えるとこれは上良設定問題であり，単一の画像からの解析は困難である．そこで光源をプロジェクタに置き換えることで様々な照明条件における画像を獲得し，それらにより解析する方法が提案されている．しかし，この方法ではプロジェクタからの投影光のパターン数や画像の撮影枚数が多く，データの取得に長時間を要する上，出力されるデータが非常に大きいという問題がある．そこで本論文では，直接反射 (Direct) 成分と相互反射（Global）成分の性質の違いに着目し，より効率的な計測法およびデータ表現法を提案する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "images/researches/sata.jpg",
        "titleJP": "シーンのレンダリングに基づく動物体追跡",
        "titleEN": "研究者: 森谷 貴行",
        "publication": "論文種別・提出年: 博士論文, 大阪大学大学院基礎工学研究科, Mar. 2007.",
        "abstract": "我々人間は，眼に映るシーン情報を瞬時に取得し理解するという高度な視覚機能を備えている．しかし，工場の生産ラインにおける検査やカメラによる映像の監視などの単純作業や長時間作業においては，心理的な要因を含めて視覚への負担が大きく，その補助的な役割を果たす視覚システム実現に対する要求が高まっている．さらに，様々な応用が期待されている自律移動ロボットのために，周囲環境や作業対象を把握することができるような視覚システムが必要とされている．このように視覚システムに要求される機能はますます高度化，多様化している．また近年，計算機性能が著しく進歩し，記憶装置が大容量化したため，画像や映像に関する処理を行うことが容易になってきている．これらの社会的，技術的背景も要因の一つとしてコンピュータビジョン分野の研究が盛んに行われており，その中でも映像から物体運動を計測する動物体追跡の研究が基本かつ重要な課題の一つとなっている．従来の動物体追跡手法は，連続する画像フレーム間の変化から見かけの動きを検出することで実物体の運動を復元するものが多く，この見かけの動きを求めるための手法として，画像から角やエッジなどの画像特徴を抽出し，連続フレーム間で同一特徴の対応付けが行われることが多かった．しかしこのような手法は，画像から特徴点を容易に抽出できない物体や，表面の反射特性のために周囲の環境が映り込むような物体に対しては適用できない．そこで本論文では，追跡対象やその周囲環境の情報があらかじめ計測によって得られているものとして，それらのモデルから生成したコンピュータグラフィックス画像と，カメラから得た入力画像の差を最小化するようにモデルの位置・姿勢を決定することで実世界の物体の運動を追跡する新たな手法を提案した．実験では，従来手法では追跡することが難しいとされていた物体である滑らかなテクスチャを持つ物体や鏡面反射特性を有する物体を対象としてその運動追跡を安定に行った．その結果，これらの物体の 6 自由度運動をオンライン処理で追跡することに成功した．さらに，複数の物体がシーン内を独立して運動する場合の追跡実験も行い，カメラから物体の一部が重なって見えるような場合にも追跡可能であることを示した．しかし，カメラから物体が完全に見えなくなった場合には追跡が不可能になるという問題がある．この問題に対処する方法として，また同時に，精度や安定性を向上させることを目的として，複数のカメラを設置することで得られる多視点画像を利用することによって追跡を行った．最後に，情報が得られていない未知の環境において，シーンに対するカメラの自己運動を追跡し，同時にステレオカメラを用いてシーンの 3 次元形状を計測することで，実際の未知環境におけるカメラの自己位置と環境マップの同時推定を実現した．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/nishida.jpg",
        "titleJP": "移動結像面型光IDマーカ",
        "titleEN": "研究者: 西浦 優己",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2007.",
        "abstract": "今日、実世界とネットワーク上の情報を効果的に結びつけユーザにとって有益な情報を積極的に提供する拡張現実感システム(ARシステム)が注目を浴びており、拡張現実感システムの実現に必要不可欠な光学タグを用いたIDタグシステムの研究が多々なされている。一般的に光学タグを用いたIDタグシステムではイメージセンサで変調している光学タグを連続撮影することでIDコードを認識している。しかし、従来法では連続撮影する1フレームの画像から1ビットの情報しか認識することができず、光学タグがイメージセンサのフレームレートより高速に変調する時その情報を正確に認識することができない。そこで本研究では、イメージセンサの撮像素子を高速移動させながら光学タグを撮影することで意図的にモーションブラを発生させ、1フレームの画像から多ビットの情報をデコードすることができるシステムを提案する。",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/mikita.jpg",
        "titleJP": "複数のステレオカメラを用いた人物頭部のモデル化と正面顔の生成",
        "titleEN": "研究者: 宮城 玲子",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2006.",
        "abstract": "近年，日常生活の安心や安全を脅かす危険や脅威が増加し，誰もが安心して暮らすことのできる社会の実現や，生活の安心・安全を確保する技術に対する期待が高まっている．安心で安全な社会の構築において，コンピュータによる人物の自動監視技術が大きな役割を担うことが期待されている．顔認証システムの多くが前提とする，対象をカメラの前に立ち止まらせる様な拘束を与えず，通路や室内を自由に移動する人物を観察・認識するとき，頭部の位置や方向など顔の見え方の変化が生じるため，顔画像の蓄積や利用が困難である．しかし，頭部がどのような姿勢であっても正面顔を生成することができる技術の導入により，対象となる人物に意識させることなく人物データの蓄積や利用を行うことができると考えられる．また，移動する人物の頭部三次元モデルを取得する技術は，対象の追跡などより高度な処理のために用いることができるという観点から見て，今後有効になるといえる．本研究では，壁面などに設置された複数のステレオカメラを用いて，自由に移動する人物頭部の様々な見えの方向からの形状を取得し，頭部の全周形状モデルを構築すること，及び頭部姿勢の推定により正面顔を自動的に生成することを目的とする．ステレオセンサは一瞬の撮像で三次元情報の取得が可能であり，光の投影を必要としないので被写体への負担が小さい．また，シーン中から自動的に顔領域を検出することで顔領域の三次元情報のみを取得する．更に，頭部の形状・色彩特性と鼻部の位置を利用して正面方向を推定することで，眼鏡や髭，表情などの影響を受けることなく正面顔の生成を可能にする．本システムは複数の計算機・ステレオセンサ組で構成される．本システムを用いた実験では，多様な条件で実際の人物の三次元モデルを構築し，正面顔が生成されることを確認する．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/gawata.jpg",
        "titleJP": "固有空間法による学習に基づくカラー画像からの距離画像の推定",
        "titleEN": "研究者: 川中 昇平",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2006.",
        "abstract": "近年，ウォークスルー表示によるミュージアムの案内や，立体表示のできるカーナビゲーションシステム，3DCG で表示されたゲーム等の３次元情報提示が我々の身の回りに多数存在している．これらは物体・環境の情報を多視点から表示させることができるため，2 次元カラー写真のような 1 視点のみの画像と比べてよりリアルで正確な情報が伝達でき，注目されている．これらのシステムを実現するには，物体やシーンの形状情報が必要である．しかし，現在ではそれらを取得するためには非常に大きな計測装置が必要であり，またそういった装置は大変高価で，計測時間に多大な時間を費やす，などの問題がある．また一方で，人間は単なる 2 次元の写真からでも物体・環境の形状を想像することができるが，これは人間が様々な環境の中で視覚情報と 3 次元形状との対応を日々学習しているからである．つまり，2 次元画像と，実際の物体の形状との間には相関性があり，その相関性を記述するルールが存在すると考えられる．このような色と形状との間に存在する相関性を計算機が得ることのできる情報から特徴を抽出する，というかたちで学習し，色情報からの物体・環境の形状の推定を行なうことが本論文の目的である．そこで，本論文では固有空間を用いた画像の特徴抽出による学習方法を提示し，その学習結果から画像内の欠損要素を補間・推定する手法を紹介した．そして，それらの手法を用いて画像の持つ自己相関性を学習し，カラー画像の超解像度化を行なった．また，色情報と距離情報に相関性があると考えられるカラー画像とそれに対応する距離画像において，その特徴を抽出・学習することにより，カラー画像から距離画像を推定する手法を提案し，それを実際に確認する実験を行なった．その結果，本論文で提案した手法を用いると，うまく学習データを選べば一般的な補間技術では復元できないような情報を復元できることが確認され，また，学習によってカラー画像から距離画像のバンプ値を推定できることが確認された．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/takadas.jpg",
        "titleJP": "平面内の距離計測に基づく自己運動推定とその応用",
        "titleEN": "研究者: 高田 健吾",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2006.",
        "abstract": "実世界の 3 次元形状データは，コンピュータグラフィックの向上に伴い，考古学における遺跡形状の三次元データでの保存 (ディジタルアーカイブ) や，バーチャルリアリティー (VR)，シミュレーションなど様々な分野で活用される．そのような背景を受け，多くの 3 次元形状計測装置が開発されており，中には広域にわたる距離画像を 1 度に取得できるシステムもある．3 次元形状モデルの生成には全周囲からの計測データが必要となるが，計測装置に対し背面側にある領域の計測はできないため，1 度の計測では未計測部分が必ず残る．そのため計測装置が移動して複数回の計測を行う必要がある．計測範囲の広さに関わらず装置の移動が必要であるのならば，広域にわたり測定可能であるが大きく高価で計測に時間がかかる装置を使わなくとも，対象表面をライン状に距離計測する装置を用いて自身の移動を求めながら計測することで 3 次元形状を取得することが可能である．そこで本論文ではまず平面内の距離計測に基づく移動推定法を提案し，次に 2 台のレンジファインダを組み合わせ一方で移動量の推定，他方でシーンの形状計測をすることでシーン全体の形状計測を行うための方法について検討した．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "sensor network",
        "photoPass": "images/researches/yokawa.jpg",
        "titleJP": "光通信型アドホックセンサネットワークにおける位置検出手法",
        "titleEN": "研究者: 廣川 新",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2006.",
        "abstract": "無線通信技術や高集積化技術，低消費電力化技術などの発達により，センサの新しい可能性としてセンサネットワークが注目されている．実世界とデジタル情報の融合であるユビキタスの社会の実現においてセンサネットワークは非常に重要な要素となる．センサネットワークとは多数のセンサがネットワークを構築し，協調動作してさまざまなアプリケーションを提供するシステムである．センサネットワークにおいてセンサノードの位置情報は非常に重要な要素である．本研究ではカメラと LED による光通信を用いたセンサネットワークにおける位置計測手法を提案する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "sensor network",
        "photoPass": "images/researches/nakatak.jpg",
        "titleJP": "画像処理ホストを有するカメラ・光源付センサネットワーク",
        "titleEN": "研究者: 中田 周作",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2006.",
        "abstract": "センサネットワークとは，超小型通信装置が個々のセンサに内蔵され，センサ同士が自律的に情報の流通を行い，収集したデータからその場に適したサービスを提供するというシステムである．センサネットワークにおいては各ノードのセンサ情報だけではなく，センサノードの位置情報は非常に重要な要素である．本研究では，センサに小型カメラおよび 4 個の光源を取り付けたノードを用いた画像計測的アプローチによる位置計測手法を提案する．提案する方式は位置が不明なセンサノードのカメラが位置が既知のセンサノードの 4 つの光源を撮影し，画像に写り込んだ輝点座標より 3 次元位置および姿勢を推定するというものである．また，各ノード毎に画像処理を行うのではなく，画像処理を実行するホストを設け，ノード上の小型カメラの電源を制御することで画像データをホストに配信し処理させる，画像処理ホスト型センサネットワークにおいて位置計測を行う．ここでカメラの内部パラメータが必要なため，内部パラメータのキャリブレーションは Zhang の提案する手法を用いた．また，ピンホールカメラモデルを用いているが，実験に使用するカメラはレンズを用いているために取得する画像にレンズ歪が生じる．そこで，位置計算に誤差を発生させる要因となるレンズ歪の補正を行った．シミュレーション実験により，本研究で用いた位置計算手法はノード間距離が大きくなるほど誤差が大きくなることが分かった．また，ノードの姿勢によって誤差の発生の分布が異なることが分かった．次に，試作システムを構築し実験を行った結果，6 回の距離計測において最大 11.8%の誤差が発生した．ノード間ベクトルと位置計測により求まったベクトルの大きさを比較した場合，誤差は最大 0.87%と小さいので，ベクトルの方向が誤差に大きく影響を与えることが分かった．また，ベクトルの方向の誤差が発生することにより，ノード間距離が大きくなるほど誤差が大きくなることが分かった．これらの結果により，ノード間距離が短ければ精度の高い位置計測が行え，距離が遠ければ精度は低くなるものの位置計測が行える事が示された．また，位置計測の誤差を小さくするためにはベクトルの方向をより精確に推定しなければならないことが分かった．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/hanadani.jpg",
        "titleJP": "投影型複合現実感による重畳物体の透過表示インタラクション",
        "titleEN": "研究者: 花谷 佐和子",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2006.",
        "abstract": "本研究では、散らかりやすい机の上で書類探索を行い、上層の書類のユーザが触れるというインタフェース操作ができる Limpid Desk の提案を行う．投影型複合現実感技術を用いて上層書類の見かけを透明にして下の書類を表示させることで上に置かれた書類を物理的に移動させることなく，下層書類の情報を視覚的に取得する．またユーザの手の上層の書類への接触を特殊な道具を身につけたり持ったりせずに熱（遠赤外線）画像によるセンシングの技術を用いることで接触によるインタフェースを実現する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/yamadac.jpg",
        "titleJP": "掌への光投影を利用した身体インタフェース",
        "titleEN": "研究者: 山本 豪志朗",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2006.",
        "abstract": "コンピュータの小型化，高性能化が進むと，それらはいろいろな環境に埋め込まれ，用途も多様化してゆく．そして，コンピュータが組み込まれた機器は現在よりも増加し，多くの操作が必要になる．このような機器の変化に伴い，扱われる情報は膨大な量になると考えられる．今後，機器操作が複雑化し，様々な情報が氾濫していく環境の中で，機器の操作と情報の扱いが重要な問題となってくる．そうした未来を見据えた技術として，常に計算機を装着して使用するウェアラブルコンピュータや，新たなインタフェースを提供する複合現実感技術が注目されている．本修士論文研究では，プロジェクタを情報提示装置とした肩部搭載型ウェアラブルコンピュータと複合現実感の技術を用いた二種類のインタフェースについて研究する．一つは，コンピュータ組み込み型のネットワーク家電機器などを操作するインタフェースで，掌上に仮想コントローラを投影し，ユーザは自らの体を通じて直感的に操作することができる．掌部分には操作対象機器からのフィードバック情報等が表示される．もう一つは，人間の自然な動作に着目した情報転送インタフェースで，掌上に情報を示す仮想物体を表示し，三次元空間移動をあたかも移動しているかのように表示することで，その情報の実在感をより豊かにできる．そして，ユーザは情報を自然な動作での操作によって授受することが可能である．このように人間の自然な動作に着目し，コンピュータが複雑に絡み合った環境の中で人間に優しいインタラクションを設計する研究と位置づけ，ユーザが実世界での生活において，いつでもどこでも自然に，身の回りの機器や既存の情報を扱うことが可能なウェアラブルシステムの実現していく．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/nakayama.jpg",
        "titleJP": "文字認識機能を有する投影型インタラクティブシステム",
        "titleEN": "研究者: 中山 太一郎",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2006.",
        "abstract": "近年，ユビキタスコンピューティングを実現するのための環境中の情報認識や，それに適したインタフェースの研究が盛んに行われており，実世界中の文字情報にも度々焦点が当てられている．ユーザにとって必要な情報のみを抽出するため，文字選択をする機能が必要である．しかし，既存の方法の多くは，普段ユーザが文字を選択する場合に行う動作と異なる動作が必要であり，自然とは言えない．また，既存の投影型インタラクティブシステムでは，投影位置はあらかじめ用意しておく必要があり，ユーザにとって最も便利な位置に投影するといった研究は行われていない．そこで，本研究では，ユーザが他のユーザに文章中の特定の単語を示したい場合，人差し指やペンでその単語を指す方法を用いることに注目し，机上のドキュメントに対して指先にある単語を OCR で読み取るというユーザにとって自然な文字選択手法を提案し，それを人間が視認しやすい位置に投影するインタラクティブシステムの試作を行った．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/takaha.jpg",
        "titleJP": "動的パーティクル像投影による実物体の視覚的形状変形の基礎的検討",
        "titleEN": "研究者: 高瀬 和彦",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2006.",
        "abstract": "本論文は，プロジェクション型複合現実感 (MR:mixed reality) 技術を応用することで立体感，実在感を保った実物体形状変形を行い，動的パーティクル像投影の視覚的効果の有効性を検証することを目的とするものである．プロジェクション MR 技術は，実在の白色物体にコンピュータ上で合成した物体表面情報を光学的に重畳させる MR 技術の一種である．本論文はこの方法を応用し，物体表面属性情報のみでなく，動的パーティクルを重畳させる手法を提案する．パーティクルとは小さな点のことであり，これを物体表面に沿って流すことを本論文では動的パーティクルレンダリングと呼ぶ．従来から実物体に仮想の陰影情報を重畳させることにより、実物体を視覚的に変形させる研究が試みられているが，本論文ではこの動的パーティクルレンダリングにより，陰影のみを実物体に投影する場合に比べより強い立体感を保持しつつ実物体の形状を仮想的に変形することができる．試作システムとして，提案手法を実装した視覚的形状変形システムを構築した．この試作システムを用いて，実際に実物体の視覚的形状変形に関する比較実験を行い，提案手法により高い奥行き提示能力を示すことができた．本論文の構成は以下の通りである．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "design engineering",
        "photoPass": "images/researches/sakamoto.jpg",
        "titleJP": "意匠デザインのためのフラクタルパタンの合成と解析",
        "titleEN": "研究者: 坂本 武士",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2006.",
        "abstract": " テキスタイルデザインにおいて, 意匠パタンは製品（作品）の印象や価値を決める重要な要素である. 意匠パタンの審美的解析と合成は興味深い. 本研究は図形の印象が生まれるメカニズムを解明することを目的とする. 具体的には, フラクタル２次元パタンを L-System を用いて生成し, その図形のもつ印象を解析する. 解析手法として, フラクタル収束度と, 構造組成分析を提案し, これらの解析手法が人間の印象をよく区別可能であることを実験的に示す.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "digital achieve",
        "photoPass": "images/researches/hang.jpg",
        "titleJP": "A Study of photo archiving based on shooting position and orientation for field work",
        "titleEN": "研究者: Hang Thi Thuy Bui",
        "publication": "論文種別・提出年: Master Thesis, Graduate School of Engineering Science, Osaka University, Sep. 2005.",
        "abstract": "Conventional photo browsers show photos as a grid of thumbnails that users can see a high resolution version of a photo by clicking on it. One of the problems when using these browsers is the difficulty to get an overview of the scene where the photos were taken. In this thesis, the author introduces a 3D photo browser that replaces the conventional grid of thumbnails by a simulated 3D space contains thumbnails. The browser is created base on shooting positions and orientations of cameras. With the purpose of determining orientations and positions of cameras used outdoor and even in severe conditions, the author uses direction to the sun, marker point and the flatness of terrain as constraints. In the proposed system, each camera is fixed with another fisheye lens camera, so that its orientation is determined through that of the fisheye lens camera. The orientation of the fisheye lens cameras can be determined using direction to the sun. As we know, depending on information of time and observed location we can determine position of the sun in the world coordinate system. Besides that, position of the sun relative to a fisheye lens camera coordinate system is determined through its coordinates in the image plane. Using the relationship between coordinates of the same point in different coordinate systems and an additional assumption that camera does not rotate about its y axis, orientation of the fisheye lens camera relative to the world coordinate system is determined. Assuming that the height from the ground to the normal camera is known, position of the camera is determined by using a marker point of which coordinates relative to the world coordinate system and coordinates of image point in image plane are known. As we know, field of view of a photo depends on image sensor size and focal length of the camera. So that, in the proposed system, appearance of a thumbnail photo in the browser is decided depending on the values of these two parameters. The image sensor size and focal length of a camera is obtained and calculated directly from Exif tag data of the photo. At last, to help viewers get an overview of the scene where the photos were taken, the proposed system allows users rotate the browser to see “the scene” from different directions, move “the scene” around the screen and they can also zoom in or zoom out “the scene” to change the viewpoint of the browser. And the browser also supports the function of displaying the high resolution version of the photo in a 2D window when user clicks on its thumbnail photo in the simulated 3D space.",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/hanaka.jpg",
        "titleJP": "立体形状計測におけるハンドプロジェクタを使用した作業支援システム",
        "titleEN": "研究者: 芳賀 浩嗣",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2005.",
        "abstract": "立体物の全周形状計測は、形状計測センサによって特定方向から３次元データを取得し、それを複数方向から繰り返し得たデータ群をポスト処理することで、全周モデルを取得するという方法と、形状計測センサ自体の位置姿勢情報をリアルタイムで監視し、随時データ更新を行うことで全周のモデルを取得する方法の２種で使われてきた。しかし、いずれの方法でも、モニター上に構成された３Ｄモデルを参考に実計測対象との確認を行うために、作業者の上注意によって計測欠?領域が生じたり、作業者の視線が実計測対象とモニターとの間を往復するために作業効率が上がらなかったり、という問題があった。そこで、本研究では、プロジェクタとビデオカメラを一体化し、プロジェクタより計測用スリット光を投光してその様子をビデオカメラで撮影することで立体形状データを取得するユニット装置を作成するとともに、世界座標センサによってユニットの位置姿勢情報をリアルタイムで捕捉し得られた３次元データを即座に世界座標に変換し、立体形状データを随時更新すると同時にプロジェクタを介して実空間に投影するという方法で、作業者に計測情報を支援光としてただちにフィードバックするというシステムを提案・開発する。また、本支援システムを用いて、支援光の投光有りの場合、無しの場合、支援システムの構成による差異の作業実験を行い。本支援システムによる、作業者の作業効率改善を実証する",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/iwaid.jpg",
        "titleJP": "熱感覚と領域入力型インタフェースによる画像創作支援",
        "titleEN": "研究者: 岩井 大輔",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2005.",
        "abstract": "本研究では、直観的な画像情報操作インタフェースを目指し、熱感覚と領域入力型インタフェースを用いた画像創作支援システムを構築した。画像情報操作と強い相関を持つ熱感覚メタファを調査し、熱画像を用いた領域入力型インタフェースを提案した。そしてこのインタフェースに、いくつかの対話技法を実装した。まず、実世界の絵道具を直接用いてコンピュータ上で描画作業を行える描画システム'ThermoPainter'を提案する。絵道具をコンピュータ上での描画作業に直接用いるためには、画材の接触領域形状を計測する必要がある。接触面に温度の異なる物体が接触すると、面上の接触領域において温度変化が生じる。面の温度変化領域を接触領域として、赤外線カメラを用いて接触面の温度分布を連続して取得することで、接触領域形状を二次元で計測することができる。'ThermoPainter'では、接触面上の接触領域に光を投影することで描画結果の表示を行う。描画面に温度変化を生じさせることができれば、身近な環境中の任意の道具で入力可能であり、体温を保持する手指や呼気はもとより、温水を使うことで絵筆やエアブラシも利用することができる。加えて、温度の変化量に合わせて、投影光の濃淡を制御し、水彩画のような効果を得ることも可能とした。次に、ユーザの持つ熱感覚メタファと強い相関を持つ画像パラメータを'ThermoPainter'上で操作するインタフェースの構築を行った。心理調査の結果、熱感覚メタファと強い相関を持つものは、「彩度《「色相《「塑性《「体積《の各画像操作パラメータであった。そこで、熱感覚メタファを利用して直観的に画像情報操作を行う対話技法を提案する。彩度操作では、画像に熱を与えると彩度が上がり、逆に熱を奪うと彩度が下がるというインタラクションを実現する。色相、体積の各操作も同様に実装する。塑性操作では、接触面上の形状モデルに対する高温接触部で、モデルの熱可塑性を変化させて柔らかくする。それと同時にマウスでモデルをドラッグして引っ張ることで形状変形を行うことができる。",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/yoshida.jpg",
        "titleJP": "複合現実博物館のための反射色計測に基づくプロジェクタ投影テクスチャ",
        "titleEN": "研究者: 吉田 壮伸",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2005.",
        "abstract": "本論文では，複合現実感技術の一方式であるプロジェクション方式MRシステムによって，実空間に存在する対象物体に対して仮想像を重畳表示し，対象物体の目標の色の見えを実空間内で再現する手法を提案する．提案手法では，投影対象となる物体の反射特性を計測によって求めた後，目標の色の見えを実現するために投影すべき光を決定する．この技術を用いることでコンピュータによって設定した目標の色の見えを実空間内で再現できることから，デジタルアーカイブされた色彩情報や形状データを用いて，色彩が劣化した絵画などの文化財を実空間内で仮想的に色修復できるのではないかと考えた．この方式を“文化財の仮想的色修復”と呼ぶことにする．また本論文では，MR技術を用いた新しい展示手法を提供する博物館や美術館である“複合現実博物館 Mixed Reality Museum”を提唱する．“文化財の仮想的色修復”は複合現実博物館における展示手法の一手法として位置付けている．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/iwainaka.jpg",
        "titleJP": "赤外パターン光の投影制御による触覚情報提示装置",
        "titleEN": "研究者: 岩中 由紀",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2005.",
        "abstract": "我々は現在，文書・映像・音声など多様化した情報を，コンピュータなどの情報機器を用いて得ることができる．そしてそれらの情報をいかにわかりやすく，使いやすくするためにはどうしたらよいかという研究が盛んに行われており，視覚と触覚を組み合わせた情報提示が注目されている．本研究では，指先に装着する形態の新たなユーザインタフェースデバイスに関して着目している．従来のユーザインタフェースに関する研究では，物体上の視覚情報に応じて触覚情報提示がなされるため，視覚的に変化のない画像上では触覚情報を得ることができないという問題点があった．そこで本論文では赤外線センサと赤外線プロジェクタを用いた新たな触覚情報提示手法を提案し，フラットなディスプレイ面に映し出された絵を触るかのように触覚情報を得るシステムを提案する．そして心理実験から，本システムが提示する触覚情報である振動強度を3段階に変化可能な装置であることを評価し，また，視覚と触覚の関係性からコンテンツの設計指針を与える．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/nakamurak.jpg",
        "titleJP": "赤外光の投影による作業過程の三次元形状計測",
        "titleEN": "研究者: 中村 太祐",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2005.",
        "abstract": "近年におけるコンピュータやネットワークの技術発展により，画像通信を利用したアプリケーションの開発が注目されている．その中で作業空間の映像を遠隔地に伝送することで協調作業を行う研究が進められている．しかし，その多くはカメラが設置された視点からしか対象を観察することができず，遠隔地から立体的な状況を正確に把握することが困難である．対象物体の立体形状を計測し伝送することで自由な視点からの観察を可能にする方法があるが，計測の手間や時間が作業者の負担になっては立体形状を得る意味も半減してしまう．本研究は，遠隔協調作業支援システムにおける形状情報の取得の必要性から，作業者に意識されずにシーンを計測するシステムの構築を目指すものである．計測手法はアクティブステレオ法に基づいたグレイコードパターン投影法を赤外光により行い，作業者に知覚されずに計測することを実現する．また計測を断続的に行うことによって作業過程の再現を行う．このとき，繰り返し得られる空間コードの振る舞いから作業者の判別を行い，さらに効率的な計測を行うため作業空間で変化が起きたところを判別し，その部分だけ計測を行う．最後にシステムを実装し，実際に本システムを利用して作業過程の記録を行い，システムの問題点について検討する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/yamamotoc.jpg",
        "titleJP": "ハイパーリアル三次元形状デザイン支援システム",
        "titleEN": "研究者: 山本 景子",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2005.",
        "abstract": "本研究は，複合現実感技術を応用した工業デザイン向け製品デザインシステムに関するものである．従来のコンピュータ支援設計 (CAD:Computer Aided Design) システムでは，ユーザが自由に形状を変形できる反面，表示は平面ディスプレイや両眼視差を利用したステレオディスプレイを用いており，最終製品の持つボリューム感，実在感を提示することは困難であった．そのため，CAD システムでいったん設計した後，製品デザインの評価のために三次元プリンタなどのラピッドモデラを用いてモックアップを作成する必要があり，最終デザインに至るまでこのサイクルを繰り返す必要があった．本研究では，複合現実感技術を応用し，モックアップにバーチャルな陰影情報を付加することで，モックアップの実在感を?なわずにボリューム感を制御し，また微妙な形状操作を行えるようにし，CAD システムの設計自由度とモックアップの実在感を両立させるシステムを提案する．また，ユーザが自然かつ直観的に形状操作できるようなユーザインタフェースを提案する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "design engineering",
        "photoPass": "images/researches/nakano.jpg",
        "titleJP": "立体曲率対数分布を用いた意匠形状の感性的解析と合成",
        "titleEN": "研究者: 中野 雄矢",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2005.",
        "abstract": "近年製造業界において、機能や品質、コスト等において各メーカの製品間の格差がなくなりなりつつある。そこで家庭電化製品や自動車などの業界では、消費者の商品に対する評価の重要な因子として、意匠形状デザインが注目されている。しかし従来の意匠形状デザインで用いられるCAD（Computer Aided Design）システムはデザイナにとって扱いづらいものである。そこで本研究では、デザイナが直観的に操作できる意匠形状創成支援システム構築のための要素技術として、曲率単調な形状の感性的な解析および合成を行う。まず、曲率単調な形状を感性的に評価するモデル「K-vector」を提案し、K-vectorを用いて、デザイン印象の違いによる形状の分類を行う。また形状の持つ印象と曲率分布の関係について述べ、曲率分布を制御することにより、異なるデザイン印象を持つ形状を合成する手法を提案する。そして合成した形状が、人間の感性と一致していることを検証するため、被験者実験により評価を行う。",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "design engineering",
        "photoPass": "images/researches/eda.jpg",
        "titleJP": "デザイン感性に基づいた３次元形状モデルの検索手法",
        "titleEN": "研究者: 江田 幸弘",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2005.",
        "abstract": "次元形状モデルの検索技術は，従来幾何学的，位相幾何学的特徴のみに着目したものがほとんどで，造形美術品，工業デザイン分野の検索には不向きであった．本研究では，立体物の持つ感性的特徴を抽出し，感性的な 3 次元形状検索技術の基礎的検討を行う．具体的には，曲面の持つ感性的特徴量を定義し，これが人間のデザイン感性によく一致することを示し，ついで，本提案の感性的特徴量に基づいた立体造形物の感性的距離を提案する．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "computer vision",
        "photoPass": "images/researches/kawanase.jpg",
        "titleJP": "動的背景の学習による未知物体領域の実時間抽出法",
        "titleEN": "研究者: 川端 聡",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2005.",
        "abstract": "コンピュータビジョンにおいて，画像中の処理対象領域を抽出する手段として背景差分法が広く用いられている．背景差分法は，予め背景となる画像を取得しておき入力画像との差分を求めることにより，背景から大きく変化した領域を処理対象領域として抽出する手法であるが，背景の変化に対応することが難しい．これに対応する手段として背景画像の更新に因るものが多く提案されているが，一定の条件を満たせば新規物体を背景画像の一部と自由に置き換えられるため，背景の確からしさを保証できない．そこで本論文では動的背景画像のセットを学習することで，学習段階に存在しなかった未知物体領域の抽出を実時間で行う手法を提案する．提案手法は単純な固有空間への投影と逆投影によって構成されており，未知物体領域を固定した場合は従来手法である BPLP による解と一致することを示した．また，実験では提案手法が従来手法に比べ 20 倍以上高速に背景の更新が可能であり，これによって従来手法より誤差のレベルを低く保てることを確認した．更に CG 画像を用いた評価実験では，提案手法の従来手法に対する優位性の他，従来研究されていた静止画像に対しても，提案手法が有効であることを確認した．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/momose.jpg",
        "titleJP": "3次元形状計測による正面顔の生成",
        "titleEN": "研究者: 堀 磨伊也",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2005.",
        "abstract": "近年、バイオメトリクスセキュリティに対する関心が急速に高まり，導入が加速している．バイオメトリクスによる個人認証には，指紋や虹彩，掌形，顔などの身体的特徴が用いられている．その中でも顔認識は，非接触で心理的抵抗感が少なく，かつヒューマンインタフェースとして優れた特徴を持つことから実用化が大いに期待されている．しかしながら，高い認識率が得られた研究では，入力画像の照明条件が一定であり，顔が正面を向いていると仮定しているものが多かった．しかし実用的で使いやすいシステムを実現するためには，顔の位置，姿勢，向いている方向ならびに照明条件などさまざまな変化のある入力顔画像に対応できる個人認識システムを構築する必要がある．そこで本研究では，対象人物が斜めを向くことによって，入力された顔画像が登録された本人顔画像と一致しない場合に，顔の3次元形状を用いて正面顔を作成するシステムの構築を提案する．3次元形状計測には能動型ステレオ法であるグレイコードパターン光投影法を用い，CG描画にはOpenGLを用いた．CGモデルにおいて鼻先の検出を行い，顔の対称性を利用して正面顔を生成することに成功した．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/nishimata.jpg",
        "titleJP": "画像平面の回転に基づく光マーカーのID認識",
        "titleEN": "研究者: 西浦 優己",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2005.",
        "abstract": "近年、コンビュータの技術の発達が著しく、ユピキタスコンビューティングの時代がやってきたといわれている。その中で、現実世界の「もの」一つ一つにその「もの」の情報を付加する研究が進められている。しかし、直接「もの」に情報を公開するのでは有限の情報しか提供できず、また有効な情報を提供することもできない。そこで、ネットワーク上に情報をおいておき、それぞれの「もの」にIDタグを付与することによってネットワークと「もの」とを関連付け、情報を提供しようとしづ研究が様々な分野でなされている。ARシステムをその例にあげることができる。ARシステムでは、ユーザはIDタグをデ、コードできる携帯端末を保持することにより、視界内に存在する現実世界の様々な「もの」の情報を取得することができる。このようなシステムを実現するには既存の「もの」や環境の外観を損なわないような物理的に微小で、かつ瞬時にIDを取得できるID認識システムが必要となってくる。そこで、本研究では、光IDマーカーと移動可能な撮像素子を利用したID認識システムを提案する。提案する方法では、光IDマーカーとしてLEDの点滅パターンを利用する。そして、撮像素子を回転させながらLEDを撮影することで時系列なLEDの点滅パターンを空間的な一枚の画像に表示されるIDに変換し、その画像に認識処理を施すことでID認識を行う。",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "user interfaces",
        "photoPass": "images/researches/shota.jpg",
        "titleJP": "光学シースルー複合現実環境下における奥行き面の知覚特性に関する研究",
        "titleEN": "研究者: 小谷 亘介",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2005.",
        "abstract": "複合現実感 (MR: Mixed Reality) 技術の発達に伴い、娯楽分野や都市計画分野、医療・福祉分野、さらには災害対策分野や教育分野など、様々な応用分野が開拓されてきた。MRにおいては、CG (Computer Graphics) で形成される仮想世界と、実際にわれわれが暮らしている現実世界とを重畳してユーザに提示する。その際、違和感を生じさせないために、仮想世界と現実世界との間の位置ずれや、照明条件の不一致、時間遅れなどを解決する必要がある。また、立体表示ディスプレイを用いて仮想世界を提示する場合、奥行きを知覚させる手がかりの不一致に起因する、没入感の消失や、疲労などの問題も報告されている。本研究では、MR環境下におけるヒトの奥行き知覚特性を調べ、MRコンテンツの設計指針を得ることを目的とする。そこで、立体表示ディスプレイを用いて、光学シースルー型MRシステムを構築し、MR環境下でのヒトの奥行き弁別精度について調べた。実験1では、前額面に平行な実物の平面と、立体表示ディスプレイによって提示された仮想平面との間で弁別課題を行った結果、どちらも仮想平面であった場合に比べて、弁別閾のシフトが見られた。また、仮想平面と実物の平面との重複領域の有無や、両者の大小関係によって、シフトに差があることもわかった。このことは、MR環境において、仮想平面と実物の平面との間に、奥行き知覚に関する相互作用があることを示している。同様の現象が、奥行き方向に傾きを持つ面に関しても起こるということが、Hill ら (2004) や Oruc ら (2003) 、Raymond ら (1999) らによって心理物理学的な手法を用いて確認されている。実験2では、鉛直軸に対してある傾きを持った実物の平面と、それとは独立な傾きに知覚されるような視差勾配のついた仮想平面とを重畳して提示し、実物の平面と前額面との弁別課題を行った。その結果、仮想物体の視差勾配が、前額面との傾き差の検出率に影響を及ぼすことがわかった。以上の結果と、両眼に異なる映像を提示できるという立体表示ディスプレイの特徴を踏まえ、光沢感を持ったテクスチャを現実の物体に付加するというアプリケーションを提案、試作システムを構築した。",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "user interfaces",
        "photoPass": "images/researches/aokit.jpg",
        "titleJP": "透過度可変型光学シースルー方式を利用した実物体に対する色再現システム",
        "titleEN": "研究者: 青木 洋一",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2005.",
        "abstract": "複合現実感 (Mixed Reality:MR) は，従来のバーチャル・リアリティー (VR) やコンピュータ・グラフィックス (CG) で描画した仮想空間と現実世界を融合させる技術であり，近年では，アートやエンタテイメントの分野に留まらず，医療・教育・都市計画といった幅広い分野で盛んに研究されている．実世界と仮想世界を違和感なく融合させるには，時間的整合性，幾何学的整合性，光学的整合性の三つの整合性を実現することが必要不可欠である．時間的整合性とは実世界と仮想像の動きを時間的に整合させることである．また幾何学的整合性とは実世界と仮想像の幾何学的位置に整合性を持たせることであり，光学的整合性とは実物体と仮想像との間の陰影関係や色調などを一致させることである．従来，時間的・幾何学的に実世界と仮想像を整合させる研究は盛んに行われている．光学的整合性の問題に関しても，実物体と仮想像の陰影関係や反射特性などを整合させる研究は行われている．しかし，MR 技術をデザイン作業支援システムや文化財の仮想的修復に応用するためには MR 環境で合成される色彩が得たい色を正しく色再現されたものであることが必須である．本論文では，MR 技術における色彩に着目し，実物体を目標色に適切に色再現するシステムを提案する．MR 技術としては，従来方式の一つである光学シースルー方式を拡張し，透過度可変の素子を付加した透過度可変型光学シースルー方式を提案する．本システムは，透過度が可変であることにより実物体の分光反射率に依存することなく色再現が可能であることが大きな特徴である．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "user interfaces",
        "photoPass": "images/researches/nakayamas.jpg",
        "titleJP": "LCDキューブによる光学的複合現実感",
        "titleEN": "研究者: 中山 浩佑",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2004.",
        "abstract": "複合現実感においてより高い現実感を得るために、実世界と仮想世界の整合性を的確に取ることが求められている。この整合性としては幾何学的整合性、光学的整合性、時間的整合性といったものが代表的に挙げられる。本論文では、特に光学的整合性に注目して考案する。光学的整合性の実現には実世界の照明環境の取得と、この照明環境の精確な再現が必要となる。本論文では、照明環境の再現を目的とした新たな全周パターン照明装置”LCDキューブ”を提案し、この照明装置による光学的複合現実感の実現を目指す。",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "user interfaces",
        "photoPass": "images/researches/hanadasa.jpg",
        "titleJP": "液晶ハーフミラーを用いたMR型色再現",
        "titleEN": "研究者: 花谷 佐和子",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2004.",
        "abstract": "複合現実感において，視覚や聴覚，触覚といった感覚情報の適切な提示が必要であるが，実世界と仮想環境が合成されたときに受け取られる感覚の整合性には多くの問題が残されている．本研究では，この問題の中から，作業者に提供する最も有力な感覚情報として視覚情報を取り上げ，光学的な整合問題の１つである色彩情報の再現性について述べる．MR技術としてハーフミラーを用いた光学シースルー方式を用い，実世界の物体色に仮想色を光学的に重畳する実物体ベースの色再現システムを提案する．本システムでは，透過度を調節できるハーフミラーとして液晶パネルを用いることで、分光反射率の低い実物体に対して、実環境の影響を最小限に抑えながらユーザが意図する物体の色の見えを再現することができる．本研究で提案した手法を用いて，対象物体に対して目標色を設定し，その目標色を再現する実験を行った．その結果，実物体の分光反射率や実世界の照明状況や実物体の分光反射率に対応した目標色を再現できることが確認された．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "sensor network",
        "photoPass": "images/researches/yokaway.jpg",
        "titleJP": "カメラ付アドホックセンサネットワークにおける3D 位置計測",
        "titleEN": "研究者: 廣川 新",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2004.",
        "abstract": "近年，ハードウェアの技術の発達により微小なコンピュータが実現可能となりアドホックセンサネットワークという新しい情報環境が提案されている．アドホックセンサネットワークとは，無線通信機能とセンサを持った超小型端末が，自動的に構成を更新しながら自律的にネットワークを構築し，センサ情報を基地局あるいは相互に送信して様々なサービスを提供するというシステムである．センサネットワークにおいて，各ノードが収集した情報を利用する場合，情報を取得した位置は非常に重要な情報である．野外での大規模なセンサネットワークでは，GPS が利用できる他，ごましおモデルに基づきノード間のホップ数で大まかな位置を推定する方法がある．屋内では無線と超音波の伝送時間の差を利用したものがあるが，光学的な位置計測に適切な方法論はない．そこで本論文では，センサノードに小型 CMOS カメラと LED を装着し，発光制御からネットワークの各ノードの 3 次元位置を画像計測的アプローチから取得する方式を提案する．提案する方式は位置が不明なセンサノードのカメラが撮影した画像内に写っている 3 次元位置が既知なノードの座標から 3 次元位置を算出するというものである．シミュレーション実験と試作システムの構築から提案方式による誤差の評価を行った．これにより，基準位置ノードや位置が既知のノードとの距離が短ければ精度の高い位置検出ができ，距離が遠ければ精度が落ちながらも，3 次元位置の同定が可能であるということが示された．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/tsuna.jpg",
        "titleJP": "プロジェクタを用いた遠隔作業支援システム",
        "titleEN": "研究者: 藤原 馨",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2004.",
        "abstract": "実空間で行われる作業を遠隔地から指示することを目的に、カメラとプロジェクタをあらかじめキャリブレーションをすることなくプロジェクタにより実物体上に指示図形を重畳表示することの出来るシステムを構築した。このシステムを用いて遠隔指示の評価実験を行ったところ、回転の指示を伝えることが難しいことがわかった。そこで、球形スクリーンへ指示を投影することにより、回転指示を伝えることに特化したシステムを構築し、評価を行った。",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/tsurukawa.jpg",
        "titleJP": "投影型ウェアラブル複合現実感システムの構築",
        "titleEN": "研究者: 狩塚 俊和",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2004.",
        "abstract": "本研究は，投影型ウェアラブル複合現実感システムを提案し，試作システムを構築することを目指したものである．近年，通信インフラの構築が進み，インターネットなどのネットワーク環境が充実してきた．そして，利用できる装置・サービス・情報が多様化し，ユーザとのインタフェース機器としての情報機器の新規開発が益々激しさを増している．なかでも，コンピュータのダウンサイジングとともに，実装技術，LSI技術・マイクロマシン技術など微小化技術が急展開し，情報端末機器の技術が革新的に進んでいる．しかし，ノートパソコン等に音声認識機能やカメラが装備されつつも，コンピュータとのインタラクションはいまだGUI（Graphical User Interface）が主流である．だが時代の潮流として，ウェアラブルコンピュータの時代に入りつつある．つまり，情報機器も携帯用微小情報機器すなわち“着る情報機器”の時代が現実味を増している．モバイルからウェアラブルへと，コンピュータは，ますます実世界の中に入り込み，我々の生活に切り離せない技術になってきている．これにより，コンピュータは単なる机の上の置物ではなく「いつでも，どこでも《利用できる巨大化した情報空間の入り口となった．現時点のウェアラブルコンピュータは小型軽量化したパソコンとディスプレイとをそのまま装着するレベルであるが，将来的には衣?のレベルにまで一体化することで，人間の記憶や感性を拡張し，社会や文明を変革し文化を創造する可能性を秘めている．このような新しいコンピュータを真に有効に活用するために，GUI などといった従来のユーザインタフェースの概念を超えた新しいHCI(Human-Computer Interaction)技術の開発が切望されている．こうした技術背景を踏まえ，真のユビキタスコンピュータの実現の一手法として，現実世界と仮想世界とをシームレスに融合する複合現実感（Mixed Reality：MR）をウェアラブルコンピュータで実現する「ウェアラブル複合現実感MRシステム《が新たなメディア環境として注目されている．このコンピュータシステムがユーザのウェアラブルな環境において実現されるならば，ユーザは実世界での生活の中で，いつでもどこでもコンピュータによって自然に支援されるようになると考えられる．本研究は，このような人間中心の観点で，ディジタル技術とデバイス技術とを融合させ，常時装着可能で快適なディジタル機器と価値あるサービスを生み出す先端的な研究であると位置付けることができる．",
        "link": "",
        "collaboration": ""
    }, 
    {
		"theme": "projector-camera system",
        "photoPass": "images/researches/tsuruta.jpg",
        "titleJP": "陰影投影型複合現実重畳による実物体の視覚的変形",
        "titleEN": "研究者: 久田 理",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2004.",
        "abstract": "本研究は、プロジェクションMR方式を応用することで立体感、実在感を保った実物体形状を視覚的に変形するシステムを提案、構築する事を目的とするものである。プロジェクションMR方式は、現実世界に存在する白色物体にコンピュータ上で合成した表面属性情報を光学的に重畳させるMR方式の一種である。本研究ではこの方式を応用し、物体表面属性情報のみでなく、物体3次元形状情報の変更にも対応させる手法を提案した。これにより目視による高い立体感、実在感を保持しつつ容易に実物体形状を仮想的に変形することができる。試作システムとして、提案手法を実装した視覚的形状変形システムを構築した。この試作システムを用いて、実際に実物体の視覚的形状変形に関する比較実験を行い、提案システムの高い奥行き提示能力を示すことができた。また、リアルタイムに視覚的形状変形を行うアプリケーションを試作システムに実装し、モデリング時におけるディスプレイシステムとしての本提案システムの有用性を示した。",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/seda.jpg",
        "titleJP": "作業状況の判定に基づくシーンの自律的３次元計測",
        "titleEN": "研究者: 稗田 洋也",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2004.",
        "abstract": "近年におけるコンピュータやネットワークの技術発展により，画像通信を利用したアプリケーションの開発が注目されている．その中で作業空間の映像を遠隔地に伝送することで協調作業を行う研究が進められている．しかしその多くは通常のカメラを用いて映像を獲得するものであり，次元情報が欠落している事から，カメラが設置された視点からしか対象を観察することが出来ず，遠隔地から立体的な状況を正確に把握することが困難である．本研究は，遠隔協調作業支援システムにおける形状情報の取得の必要性から，シーンをアクティブビジョンの概念に従って効率的・自律的に計測することが可能なシステムの構築を目指すものである．計測手法はアクティブステレオ法に基づいたグレイコードパターン投影法を用いており，それによって得られる空間コードから首振り前後のカメラ座標系同士のキャリブレーションを行うという新しい手法を提案する．視点固定型パン・チルト・ズームカメラを使用しているため，首振りを行ったカメラ座標系において再度カメラパラメータを求める必要は無く，それぞれのカメラ座標間における画素の対応が求まれば距離画像の統合が可能である．また，作業者が計測のために作業を中断すれば作業効率が低下することになる。そこで計測するタイミングや計測が必要な部位を判断し、自律的な計測を行うシステムを構築した．システムはフレーム間差分と背景差分を組み合わせた判別手法によって作業空間における作業者の作業状況を判定し，自動的に計測を開始する．また，シーンの変化によりシーンが変化した部分の空間コードが変化し、正確な座標変換行列が求められなくなる問題については，無作為にサンプルを抽出してパラメータを算出するアルゴリズムを用いることで解決した．また，得られたカラー画像に対するシェーディング歪補正等の明度補正や，距離画像を統合することによって発生するテクスチャの不連続の解消を行うことによってのリアリティを向上させた．さらに応用アプリケーションとして，作業の経過を次元情報を保持したまま保存し，後から任意に作業の経過やそのシーンの立体形状を観察することが可能なアプリケーション“Scene Viewer”を作成し，その有効性について検討した．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/moritani.jpg",
        "titleJP": "多視点画像とCG 画像の比較に基づく動物体追跡に関する研究",
        "titleEN": "研究者: 森谷 貴行",
        "publication": "論文種別・提出年: 修士論文, 大阪大学大学院基礎工学研究科, Mar. 2004.",
        "abstract": "人間が便利で安心できる生活環境を得るために，産業や医療などの様々な分野で視覚システムに要求される機能が近年ますます多様化，高度化している．また，計算機性能が著しく向上し，コストも低下したため，画像や映像の処理をパーソナルコンピュータで行うことが容易になっている．これらの背景を理由に動画像処理をテーマとした研究が盛んに行われており，その中でも一連の画像から物体の運動を計測する動物体追跡の研究が重要な課題の 1 つである．従来の動物体追跡手法は，連続画像間の同一特徴点を抽出し，対応付けを行うことにより画像上のみかけの動きを求め，次にそれらを統合することで実際の物体の運動を推定する方法を利用したものが一般的である．しかし，物体によっては安定して特徴点を抽出し，追跡できるとは限らない．そこで本研究では，カメラなどから得られる映像の明度変化を利用し，特徴点の抽出を行うことなく物体を追跡する勾配法に基づく手法を提案する．さらに 3 次元空間での追跡を効果的に行うために，対象物体の情報を利用したモデルベース解析を行う．対象物体のCG モデルに基づき精密に再現した CG 画像を利用し，映像の明度変化から直接的に物体の運動を推定し追跡を行う．このとき，単一視点から得られる映像を利用するだけでは安定に追跡することができないため，視点を増やし様々な角度から得られる映像をすべて利用することによってより安定な追跡を実現する．動物体の追跡実験を行うために，複数のカメラを利用した追跡システムを構築した．特徴点の抽出が難しい自由曲面によって構成された剛体に対して，3 次元空間内の 6 自由度運動を約 5 frame/sec の速度で追跡し，本研究での提案手法によって安定な動物体追跡が可能であることを示した．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/mikitas.jpg",
        "titleJP": "複数のステレオカメラを用いた人物形状モデルの復元",
        "titleEN": "研究者: 宮城 玲子",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2004.",
        "abstract": "近年コンピュータを用いた画像処理技術は，私たちの日常生活における応用が求められている．例として，自動監視システムや車両の自動操縦などへの応用が考えられる．これらの場合，運動の追跡や認識といった高度な処理が求められることになる．この様な高度な処理を安定に行う際には，対象のモデルを取得することが必要である．受動型計測法の代表的な例であるステレオ法は，一度の撮像だけで形状計測が可能であるため，動物体の計測にも適用できる．そこで，本研究では複数のステレオカメラを用いて人物の全周形状モデルを取得することを目的とする．また，対象の位置を検出し ，すべてのカメラから見て計測に向いた位 置に来たときに全周計測結果を出力することも目的とする．システムは，2台のステレオカメラとPC1台で構成される．まず各ステレオカメラから得られる視差画像を用いて背景差分を行い，対象を背景から切り出す．次に，得られた差分画像の中から人物の顔と思われる領域を検出し ，その領域内の対象の三次元情報を取得する．そして，各カメラから得られた三次元情報列を統合することで人物の形状モデルの復元を行う．実験では，人物領域が正しく検出され，その領域内のモデルを復元できることを確認した．",
        "link": "",
        "collaboration": ""
    },
    {
		"theme": "computer vision",
        "photoPass": "images/researches/myoshi.jpg",
        "titleJP": "屋外環境下における表面反射特性の計測手法",
        "titleEN": "研究者: 三好 裕樹",
        "publication": "論文種別・提出年: 卒業論文, 大阪大学基礎工学部, Mar. 2004.",
        "abstract": "近年，遺跡や古建築などの景観，形状などをデジタル保存するデジタルアーカイブの需要が高まってきている．デジタルアーカイブにおいて, 対象物の 3 次元形状を記述する幾何モデルとともに, 物体の色の見えや質感を再現するために, 光学的特性を記述する光学モデルの取得, 保存が重要である. しかし, 屋外建造物の形状は 3 次元形状計測技術やレーザレーダ技術の発達で容易にデジタル化できるようになってきたものの, 表面の光学特性（色，つや，質感等）のデジタル化は，主に屋外では照明環境をコントロールできないことから困難であり，これまでは限定された条件下のみでしか行われていない．表面反射特性を記述するものとしては BRDF(Bidirectional Re・Ｆctance Distri-bution Function：双方向反射率分布関数) を用いるのが一般的である. この BRDFの計測方法として, 従来 goniore・Ｆctometer と呼ばれる機器を用いられていたが, 測定試料のサンプリングのため, 遺物などの非破壊での計測が求められる対象に対しては測定が難しく, また, 計測時には点光源以外の光が入ることが許されないので，屋外環境での厳密な計測は事実上不可能であった. そこで, デジタルカメラにより取得した画像から BRDF を推定する手法が現在主流である. この手法を inverse rendering と呼ぶ. しかし屋外環境下での計測は難しく, 一定の条件下以外ではこれまで実用化には至らなかった. そこで, 本研究では任意光源下での BRDF 計測が可能な方法として, 取得画像の球面調和関数展開による周波数領域での解析を用いた手法を提案する. また, 実際に日中晴天下での計測システムを作り, 本提案の有効性を検証する. さらに, システムに対する考察を行うとともに, 改善点を模索する.",
        "link": "",
        "collaboration": ""
    }
]
